Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/advanced.po
Languages: fr

source: Advanced Management
fr: Gestion avancée

source: Working with Kolibri from the Command Line
fr: Faire fonctionner Kolibri à partir de la ligne de commande

source: In Windows you need to open the command prompt, for example by using the :guilabel:`WIN` + :guilabel:`R` shortcut, and then typing ``cmd``.
fr: Sous Windows, il vous faudra ouvrir l'invite de commande, par exemple au moyen du raccourci :guilabel:`WIN` + :guilabel:`R`, puis en tapant ``cmd``.

source: On macOS open Spotlight and type ``Terminal``. You may also need to prefix the commands with ``python -m``, for example ``python -m kolibri start``.
fr: Sur MacOS, ouvrez Spotlight et saisissez ``Terminal``. Vous pouriez aussi avoir besoin de préfixer les commandes de ``python -m``, par exemple ``python -m kolibri start``.

source: If you are running Kolibri with the ``.pex`` file, make sure to substitute the ``kolibri`` in below commands **with the exact name of the file you downloaded** preceded by ``./``. For example, to start Kolibri from the downloaded file ``kolibri-v0.12.pex``, type ``./kolibri-v0.12.pex start``.
fr: Si vous utilisez Kolibri avec le fichier ``.pex``, assurez-vous de remplacer ``kolibri`` dans les commandes ci-dessous **par le nom exact du fichier que vous avez téléchargé** précédé de ``./``. Par exemple, pour démarrer Kolibri à partir du fichier téléchargé ``kolibri-v0.12.pex``, saisissez ``./kolibri-v0.12.pex start``.

source: In the commands below, angle brackets and the text between them ``<...>`` are used to denote placeholders for you to modify. Make sure to replace them with your own information.
fr: Dans les commandes ci-dessous, les chevrons et le texte qu'ils contiennent ``<...>`` sont utilisés pour indiquer les paramètres substituables à modifier. Assurez-vous de les remplacer par vos propres informations.

source: If you see errors in the prompt/terminal output while running the commands below, ask for help at our `Community Forums <https://community.learningequality.org/>`_, or `file an issue on GitHub <https://github.com/learningequality/kolibri/issues/new>`_.
fr: En cas d'erreurs dans l'invite ou dans la sortie du terminal lors de l'exécution des commandes ci-dessous, demandez de l'aide sur nos `Forums communautaires <https://community.learningequality.org/>`_, ou `signalez le problème sur GitHub <https://github.com/learningequality/kolibri/issues/new>`_.

source: Start/Stop Kolibri
fr: Démarrer/Arrêter Kolibri

source: In case you need to troubleshoot potential problems while running Kolibri, you may try to start it manually from the command line.
fr: Dans le cas où vous auriez besoin de résoudre des problèmes potentiels pendant l'exécution de Kolibri, vous pouvez essayer de le démarrer manuellement à partir de la ligne de commande.

source: Import Content Channels from Internet
fr: Importer des chaînes de contenu à partir d'Internet

source: To import content channels from Internet, run these two commands in sequence. The first downloads the channel database, and the second downloads the resources (videos, documents, etc.).
fr: Pour importer des chaînes de contenu à partir d'Internet, exécutez ces deux commandes en succession. La première télécharge la base de données des chaînes, et la seconde les ressources (vidéos, documents, etc.).

source: For example (``Channel ID`` without angle brackets ``<...>``):
fr: Par exemple (``Channel ID`` sans chevrons ``<...>``) :

source: When you import content channels from the command line, you still must use the **32 digit channel ID**, as the :ref:`command will not work with the token <id_token>`. Make sure to receive the correct channel ID from the person who curated the unlisted channel you need to import, or refer to `Kolibri Studio user guide <https://kolibri-studio.readthedocs.io/en/latest/share_channels.html#make-content-channels-available-for-import-into-kolibri>`_ how to find it in Studio user interface, if you have channel editor access.
fr: Lorsque vous importez des chaînes de contenu à partir de la ligne de commande, vous devez toujours utiliser **l'ID de chaîne à 32 chiffres**, car la commande :ref:`ne fonctionnera pas avec le jeton <id_token>`. Assurez-vous d'obtenir le bon ID de chaîne de la part de la personne ayant créé la chaîne non répertoriée que vous devez importer, ou référez-vous au `Guide de l'utilisateur de Kolibri Studio <https://kolibri-studio.readthedocs.io/en/latest/share_channels.html#make-content-channels-available-for-import-into-kolibri>`_ pour découvrir comment le localiser dans l'interface utilisateur de Studio si vous avez accès aux chaînes en tant qu'éditeur.

source: Export Content Channels
fr: Exporter des chaînes de contenu

source: To export Kolibri content channels on a local drive in order to share it with another device, run these two commands in sequence. The first exports the channel database, and the second exports the resources (videos, documents, etc.).
fr: Pour exporter des chaînes de contenu Kolibri sur un support amovible afin de les partager avec un autre appareil, exécutez ces deux commandes en succession. La première exporte la base de données des chaînes, et la seconde les ressources (vidéos, documents, etc.).

source: The path should be to a folder named ``KOLIBRI_DATA`` at the root of the local drive, so it will get picked up later for importing via the Web UI.
fr: Le chemin doit pointer vers un dossier nommé ``KOLIBRI_DATA`` à la racine du support amovible, afin qu'il soit récupéré plus tard pour l'import via l'interface Web.

source: Reorder Content Channels
fr: Réordonner des chaînes de contenu

source: You can set the specific order for content channels in the **Learn** page according to your preferences. Follow these steps.
fr: Vous pouvez définir l'ordre spécifique des chaînes de contenu dans la page **Apprendre** selon vos préférences. Suivez les étapes suivantes.

source: To view the current ordered list of channels, run the command:
fr: Pour afficher la liste des chaînes dans l'ordre actuel, exécutez la commande :

source: The output will be something like:
fr: Les résultats ressembleront aux suivants :

source: To set a position for a channel, run the command:
fr: Pour définir la position d'une chaîne en particulier, exécutez la commande :

source: Example with the above channels:
fr: Exemple reprenant les chaînes ci-dessus :

source: Create a New Super Admin
fr: Créer un nouveau super administrateur

source: In case you need to create another **super admin** user, either to address additional need of managing facility, or if you lost the password for the old one, run the following command.
fr: Au cas où vous auriez besoin de créer un autre **super admin**, soit car vous avez besoin d'un utilisateur supplémentaire pour gérer l'établissement, soit parce que vous avez perdu le mot de passe de l'ancien super administrateur, exécutez la commande suivante.

source: You will be prompted to input the **Username** and **Password** and the new **super admin** user account will be created.
fr: Vous serez invité à entrer votre **Nom d'utilisateur** et un **Mot de passe** et le nouveau compte **super admin** sera créé.

source: Import Users from a CSV File
fr: Importer des utilisateurs à partir d'un fichier CSV

source: This is currently an experimental feature, so please forward to the development team any details about the issues you may encounter while using it.
fr: Cette fonctionnalité est actuellement en phase expérimentale, merci donc de transmettre à l'équipe de développement tous les détails concernant les problèmes que vous pourriez rencontrer lors de son utilisation.

source: Command works on Kolibri version 0.9 and above.
fr: La commande fonctionne sur les versions 0.9 et ultérieures de Kolibri.

source: CSV File Structure
fr: Structure du fichier CSV

source: To import users into Kolibri with this command, you will need to provide the user data in a CSV (comma separated values) file format. You can export a CSV file from a tabular data in any spreadsheet program (Excel, Google Sheets, LibreOffice Calc, etc.).
fr: Pour importer des utilisateurs dans Kolibri à l'aide de cette commande, vous devrez fournir les données utilisateurs dans un fichier au format CSV (comma separated values). Vous pouvez exporter ce fichier CSV à partir de données tabulaires de n'importe quel tableur (Excel, Google Sheets, LibreOffice Calc, etc.).

source: User data in a spreadsheet table.
fr: Données utilisateurs dans un tableur.

source: Header row is optional, but if you do not include it, Kolibri will assume that you are providing the data in the following order:
fr: La ligne d'en-tête est facultative, mais si vous ne l'incluez pas, Kolibri supposera que les données sont fournies dans l'ordre suivant :

source: If you do include a header row, you can provide less data, or put them a different order:
fr: Si vous incluez une ligne d'en-tête, vous pouvez fournir moins de données ou les placer dans un ordre différent :

source: Only the ``username`` is required.
fr: Seul le ``username`` est important.

source: When you do not provide passwords for the imported users, Kolibri will set the default password ``kolibri`` for those usernames.
fr: Lorsque vous ne fournissez pas de mots de passe pour les utilisateurs importés, Kolibri leur assignera par défaut le mot de passe ``kolibri``.

source: The facility can be either the facility name or the facility ID. If you do not provide the facility, Kolibri will import users in the default facility on the device. You can also specify the facility by adding the ``--facility`` argument in the command line (see below).
fr: L'établissement peut correspondre soit au nom, soit à l'identifiant de l'établissement. Si vous ne fournissez pas d'établissements, Kolibri importera les utilisateurs dans l'établissement par défaut de l'appareil. Vous pouvez aussi spécifier l'établissement en ajoutant l'argument ``--facility`` dans la ligne de commande (voir ci-dessous).

source: Change User's Password
fr: Changer le mot de passe d'un utilisateur

source: Run the following command to change the password for a user.
fr: Exécutez la commande suivante pour changer le mot de passe d'un utilisateur.

source: You will be prompted twice to input the new password for the user.
fr: On vous demandera deux fois d'entrer le nouveau mot de passe pour l'utilisateur.

source: Delete Users Permanantly
fr: Supprimer définitivement des utilisateurs

source: If you need to permanently delete a Kolibri user and all the data associated with their account, for example to ensure privacy rights according to GDPR, use the following command.
fr: Si vous avez besoin de supprimer définitivement un utilisateur Kolibri et toutes les données associées à son compte, pour par exemple garantir ses droits à la vie privée conformément au RGPD, utilisez la commande suivante.

source: This will permanently erase all the user data.
fr: Cela effacera définitivement toutes les données de l'utilisateur.

source: Backup and Restore Kolibri Database
fr: Sauvegarder et restaurer la base de données Kolibri

source: Kolibri automatically creates a backup of the database with every version upgrade. If for some reason you need to make a manual backup, use the following command.
fr: Kolibri sauvegarde automatiquement la base de données à chaque changement de version. Si pour une raison quelconque vous devriez effectuer une sauvegarde manuelle, utilisez la commande suivante.

source: This command will create a time-stamped ``.dump`` file in the ``./kolibri/backups`` folder that you can use to restore the database with the following command.
fr: Cette commande créera un fichier ``.dump`` horodaté dans le dossier ``./kolibri/backups`` que vous pourrez utiliser pour restaurer la base de données grâce à la commande suivante.

source: To restore the DB from a specific ``.dump`` file, use the flag ``--select`` to see all that available sorted by date, and select the one you need.
fr: Pour restaurer la base de données à partir d'un fichier ``.dump`` spécifique, utilisez l'option ``--select`` pour voir l'ensemble des fichiers disponibles triés par date, et sélectionnez celui dont vous avez besoin.

source: This command is not intended for replication across different devices, but **only** for restoring on a single device from a local backup of the database.
fr: Cette commande n'est pas destinée à la duplication sur différents appareils, mais **seulement** à la restauration sur un seul appareil à partir d'une sauvegarde locale de la base de données.

source: Change the Location of Kolibri Content Files
fr: Changer l'emplacement des fichiers de contenu Kolibri

source: Kolibri content channels may occupy a considerable amount of hard disk space over time. If you have concerns about running out of storage on your device, you can move the Kolibri **content files** to another drive.
fr: Les chaînes de contenu Kolibri peuvent occuper une quantité considérable d'espace sur le disque dur au fil du temps. Si vous craignez de manquer d'espace de stockage sur votre appareil, vous pouvez déplacer les **fichiers de contenu** de Kolibri sur un autre disque.

source: If you have both SSD disk and HDD disk available on your device, it is recommended to install Kolibri on the SSD drive to allow faster access to the database, and move just the content file to the HDD drive.
fr: Si vous disposez à la fois d'un disque SSD et d'un disque dur sur votre appareil, il est recommandé d'installer Kolibri sur le disque SSD pour permettre un accès plus rapide à la base de données, et de déplacer uniquement le fichier de contenu vers le disque dur.

source: To move the Kolibri content folders to another location, follow these steps.
fr: Pour déplacer les dossiers de contenu Kolibri vers un autre emplacement, suivez les étapes suivantes.

source: Stop Kolibri.
fr: Arrêtez Kolibri.

source: Create a new folder that will contain all the content files and resources on the destination drive.
fr: Créez un nouveau dossier qui contiendra l'ensemble des fichiers de contenu et des ressources sur le disque de destination.

source: For example, if you created a new folder ``KolibriContent`` on an external drive, run this command.
fr: Par exemple, si vous avez créé un nouveau dossier ``KolibriContent`` sur un disque externe, exécutez la commande suivante.

source: If you are on Windows, and the new folder ``KolibriContent`` is on the drive ``F:``, run this command.
fr: Si vous travaillez sous Windows, et que le nouveau dossier ``KolibriContent`` se trouve sur le disque ``F:``, lancez la commande suivante.

source: Restart Kolibri.
fr: Redémarrez Kolibri.

source: This command will move the 2 subfolders ``databases`` and ``storage``, from their default location inside the ``.kolibri/content`` folder in your device's home directory, to a new location you specified in the command.
fr: Cette commande va déplacer les 2 sous-dossiers ``databases`` et ``storage``, de leur emplacement par défaut dans le dossier ``.kolibri/content`` du répertoire d'accueil de votre appareil, vers le nouvel emplacement spécifié dans la commande.

source: Change the Location of ALL Kolibri Files
fr: Changer l'emplacement de TOUS les fichiers Kolibri

source: If you want to change the directory where all of Kolibri's runtime files are located, together with the imported content channels, you need to change the environment variable called ``KOLIBRI_HOME`` to the path of your choice.
fr: Si vous voulez souhaitez déplacer tous les fichiers d'exécution de Kolibri, ainsi que les chaînes de contenu importées, vous devez remplacer la variable d'environnement appelée ``KOLIBRI_HOME`` par le chemin de votre choix.

source: If the variable is left unset, by default, Kolibri's runtime files and content will be placed in your user’s home folder, under the ``.kolibri`` subfolder.
fr: Si la variable n'est pas définie, par défaut, les fichiers d'exécution et le contenu de Kolibri seront placés dans le dossier personnel de votre utilisateur, au sein du sous-dossier " .kolibri ".

source: Adjusting this environment variable behaves differently than the ``movedirectory`` command above:
fr: L'ajustement de cette variable d'environnement se comporte différemment de la commande ``movedirectory`` ci-dessus :

source: Adjusting the environment variable will not automatically migrate over data. You need to copy the ``.kolibri`` folder manually to the new location.
fr: Ajuster la variable d'environnement ne transfèrera pas automatiquement les données. Vous devrez copier le dossier ``.kolibri`` manuellement vers le nouvel emplacement.

source: If you do copy the ``.kolibri`` folder, the content will not be affected **if it had been previously set** using the ``movedirectory`` command.
fr: Si vous copiez le dossier ``.kolibri``, le contenu ne sera pas affecté **s'il avait été précédemment défini** en utilisant la commande ``movedirectory``.

source: There are many ways to set an environment variable either temporarily or permanently. To start Kolibri on **OSX or Linux** with a different home, follow these steps.
fr: Il existe de nombreuses façons de définir une variable d'environnement de façon temporaire ou permanente. Pour démarrer Kolibri dans **OSX ou Linux** avec un accueil différent, suivez les étapes suivantes.

source: Stop the server.
fr: Arrêtez le serveur.

source: Move the ``.kolibri`` folder to the new location.
fr: Déplacez le dossier ``.kolibri`` vers le nouvel emplacement.

source: Run the following in Terminal:
fr: Exécutez les opérations suivantes dans le Terminal :

source: When you start the server again, all your files should be seamlessly detected at that location.
fr: Lorsque vous redémarrez le serveur, tous vos fichiers devraient être détectés sans problème à cet endroit.

source: To change the environment variable ``KOLIBRI_HOME`` on **Windows**, follow these steps.
fr: Pour changer la variable d'environnement ``KOLIBRI_HOME`` dans **Windows**, suivez les étapes suivantes.

source: Run the following in Command Prompt:
fr: Lancez la commande suivante dans l'invite de commande :

source: Restart the server, and your files should be seamlessly detected at the new location.
fr: Redémarrez le serveur, et vos fichiers devraient être détectés sans problème dans le nouvel emplacement.

source: Alternatively, you can follow these steps in the GUI.
fr: Sinon, vous pouvez suivre les étapes suivantes dans l'interface graphique.

source: Go to **Computer > Advanced System Settings** and press the :guilabel:`Environment Variables` button.
fr: Allez dans **Ordinateur > Paramètres avancés du système** et appuyez sur le bouton :guilabel:`Variables d'environnement`.

source: Under **User Variables for...** press the :guilabel:`New...` button.
fr: Dans la section **Variables utilisateur pour...**, appuyez sur le bouton :guilabel:`Nouveau...`.

source: Input ``KOLIBRI_HOME`` in the **Variable name** field, and your new path in the **Variable value** field, and press :guilabel:`OK` on both open windows.
fr: Saisissez ``KOLIBRI_HOME`` dans le champ **Nom de la variable**, et votre nouveau chemin dans le champ **Valeur de la variable**, et appuyez sur :guilabel:`OK` dans les deux fenêtres ouvertes.

source: Customize Kolibri Settings with the OPTIONS.INI File
fr: Personnaliser les paramètres de Kolibri avec le fichier OPTIONS.INI

source: For certain configuration settings you need to use the ``options.ini`` file. Installing Kolibri does not generate this file by default, but you can easily add one yourself. Follow these steps.
fr: Pour certains paramètres de configuration, vous devez utiliser le fichier ``options.ini``. L'installation de Kolibri ne génère pas ce fichier par défaut, mais vous pouvez facilement en ajouter un vous-même. Suivez les étapes suivantes.

source: Open the preferred text editor on your computer (eg. Notepad on Windows).
fr: Ouvrez l'éditeur de texte de votre choix sur votre ordinateur (p. ex. Bloc-notes sur Windows).

source: Write the required *sections* and *keys* (see details for available settings below) in the following format:
fr: Saisissez les *sections* et *clés* exigées (voir détails pour les paramètres disponibles ci-dessous) dans le format suivant :

source: Save the resulting ``options.ini`` file in the ``.kolibri`` folder inside the :ref:`Home <home>` folder.
fr: Enregistrez le fichier ``options.ini`` obtenu du dossier ``.kolibri`` dans le dossier :ref:`Accueil <home>`.

source: ``options.ini`` file can contain several sections with one or more associated keys, depending on the requirements of your installation.
fr: Le fichier ``options.ini`` peut contenir plusieurs sections avec une ou plusieurs clés associées, selon les exigences de votre installation.

source: Run Kolibri from a Different Port
fr: Exécuter Kolibri à partir d'un port différent

source: If you need Kolibri to start and run from a port different than the default ``8080``, add the section ``[Deployment]``, and the key ``HTTP_PORT`` with the value of your desired port, to the ``options.ini`` file.
fr: Si vous avez besoin que Kolibri démarre et fonctionne à partir d'un port autre que le port par défaut ``8080``, ajoutez la section ``[Deployment]``, et la clé ``HTTP_PORT`` avec la valeur du port en question dans le fichier ``options.ini``.

source: If after setting the desired port in the ``options.ini`` file you still see Kolibri running from a different one, you probably have the environment variable ``KOLIBRI_HTTP_PORT`` from a previous installation, which takes precedence. Check the ``.bashrc`` file on Linux, or run the ``set`` command in Windows command prompt, to verify and correct if necessary.
fr: Si après avoir défini le port de votre choix dans le fichier ``options.ini``, Kolibri fonctionne encore à partir d'un autre port, la variable d'environnement ``KOLIBRI_HTTP_PORT`` d'une installation précédente est probablement prioritaire. Vérifiez le fichier ``.bashrc`` sur Linux, ou lancez la commande ``set`` dans l'invite de commande dans Windows, pour le vérifier et le corriger si nécessaire.

source: Allow Profiling of Requests
fr: Autoriser le profilage des requêtes

source: If you need to :ref:`profile server requests <profile_requests>` to get a more detailed information about the Kolibri performance, add the following to the ``options.ini`` file.
fr: Si vous avez besoin de :ref:`profiler les requêtes du serveur <profile_requests>` pour obtenir des informations plus détaillées sur la performance de Kolibri, ajoutez les éléments suivants au fichier ``options.ini``.

source: Test Kolibri Server Performance
fr: Tester la performance du serveur Kolibri

source: Benchmark
fr: Test d'évaluation de la performance

source: You can use the following command to collect information about the device where Kolibri server is running, and details about how much of its resources it is using. This command displays a snapshot of the server state at the time the command is executed, and its output will vary depending on the current server load. In case you suspect performance problems, type this in the Terminal or Command prompt.
fr: Vous pouvez utiliser la commande suivante pour obtenir des informations relatives à l'appareil sur lequel le serveur Kolibri est exécuté, et des détails sur la quantité de ressources qu'il utilise. Cette commande affiche une vue instantanée de l'état du serveur au moment où la commande est exécutée, et sa sortie variera en fonction de la charge actuelle du serveur. Si vous soupçonnez des problèmes de performances, saisissez cette commande dans le Terminal ou dans l'invite de commande.

source: The command will have an output similar to this:
fr: La commande aura une sortie similaire à celle-ci :

source: Command line output of the 'kolibri manage benchmark' command
fr: La sortie de la ligne de commande 'kolibri manage benchmark'
