Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/advanced.po
Languages: fr

source: Take a screenshot of the Terminal or Command prompt, or copy and paste the output in the community forum post.
fr: Faites une capture d'écran du Terminal ou de la ligne de commande, ou copiez et collez la sortie dans le forum communautaire.

source: Profile
fr: Profilage

source: In order to collect more than a current snapshot of Kolibri server performance, you can use the profiling command. When executed, the command will collect a series of performance indicators every 10 seconds and save them in a CSV file. Type this in the Terminal or Command prompt.
fr: Pour obtenir plus qu'un instantané des performances actuelles du serveur Kolibri, vous pouvez utiliser la commande de profilage. Une fois exécutée, la commande collectera une série d'indicateurs de performance toutes les 10 secondes et les enregistrera dans un fichier CSV. Saisissez cette commande dans le Terminal ou l'invite de commande.

source: Command collects and saves the information 60 times by default. If you want to change this value, add the ``--num-samples`` flag with the desired number at the end.
fr: La commande recueille et enregistre les informations 60 fois par défaut. Si vous voulez changer cette valeur, ajoutez l'option ``--num-samples`` suivi du nombre souhaité.

source: Each log line contains this information:
fr: Chaque ligne du journal contient les informations suivantes :

source: Date and time of each command execution
fr: La date et l'heure de l'exécution de chaque commande

source: Number of Kolibri active sessions (including guest sessions)
fr: Le nombre de sessions actives de Kolibri (y compris les sessions d'invités)

source: Number of Kolibri logged users
fr: Le nombre d'utilisateurs connectés à Kolibri

source: Number of Kolibri user interactions during the last minute
fr: Le nombre d'interactions des utilisateurs de Kolibri au cours de la minute écoulée

source: Total percentage of CPU use
fr: Le pourcentage total d'utilisation du processeur

source: Total memory use
fr: L'espace total de la mémoire utilisé

source: Total available memory
fr: Le total de la mémoire disponible

source: Number of processes executed in the server
fr: Le nombre de traitements en cours d'exécution dans le serveur

source: Percentage of CPU used by Kolibri
fr: Le pourcentage de processeur utilisé par Kolibri

source: Percentage of memory used by Kolibri
fr: Le pourcentage de mémoire utilisée par Kolibri

source: To help us troubleshoot potential problems on your Kolibri server, locate and send us the ``KOLIBRI_HOME/performance/date_time_performance.csv`` file.
fr: Afin de nous aider à résoudre les problèmes potentiels sur votre serveur Kolibri, situez et envoyez-nous le fichier ``KOLIBRI_HOME/performance/date_time_performance.csv``.

source: Profile Server Requests
fr: Profilage des requêtes du serveur

source: If you have the ``[Server]`` section of the :ref:`OPTIONS.INI <profile_requests_ini>` file configured with ``PROFILE = 1``, the above command will additionally perform a profiling of every request made by Kolibri server, and save the results in a second log file as ``KOLIBRI_HOME/performance/date_time_requests_performance.csv``
fr: Si vous avez configuré la section ``[Server]`` du fichier :ref:`OPTIONS.INI <profile_requests_ini>` avec ``PROFILE = 1``, la commande ci-dessus effectuera également un profilage de chaque requête faite par le serveur Kolibri, et enregistrera les résultats dans un second fichier journal sous le nom ``KOLIBRI_HOME/performance/date_time_requests_performance.csv``

source: Timestamp
fr: L'horodatage

source: Request path
fr: Le chemin de la requête

source: Time spent processing the request
fr: Le temps de traitement de la requête

source: Memory (in KB) used by the Kolibri process when the request came in
fr: La mémoire (en Ko) utilisée par Kolibri à réception de la requête

source: Memory (in KB) used by the Kolibri process when the response was sent
fr: La mémoire (en Ko) utilisée par Kolibri lors de l'envoi de la réponse

source: CPU percentage used by the Kolibri process when the request came in
fr: Le pourcentage de processeur utilisé par Kolibri à réception de la requête

source: CPU percentage used by the Kolibri process when the request was sent
fr: Le pourcentage de processeur utilisé par Kolibri lors de l'envoi de la requête

source: Flag indicating if the request is the slowest one since the analysis started
fr: Un indicateur signalant si la requête est la plus lente depuis le début de l'analyse

source: Profiling server requests can consume a lot of computer resources, and potentially slow it down. For this reason you need to explicitly allow it in the ``options.ini`` file. Without the ``PROFILE = 1`` key, command will not profile server requests (but just the current server state), and it will not create the second CSV file.
fr: Le profilage des requêtes du serveur peut consommer beaucoup de ressources de l'appareil, et potentiellement le ralentir. Pour cette raison, vous devez l'autoriser explicitement dans le fichier ``options.ini``. Sans la clé ``PROFILE = 1``, la commande ne profilera pas les requêtes du serveur (mais seulement l'état actuel du serveur), et ne génèrera pas le second fichier CSV.

source: Hard drive provisioning for multiple Kolibri servers
fr: Provisionner les disques durs pour plusieurs serveurs Kolibri

source: For the recommended procedure to install and provision several Kolibri server devices, refer to our :ref:`hard drive provisioning tutorial <provision>`.
fr: Pour la procédure d'installation et de provisionnement recommandée de plusieurs appareils serveur Kolibri, référez-vous à notre didacticiel sur le :ref:`provisionnement de disques durs <provision>`.
