Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/coach.po
Languages: fr

source: Coach your Learners in Kolibri
fr: Éduquer vos élèves avec Kolibri

source: You can track progress of the **Learners**, create and assign **Lessons** and **Quizzes** to classes or learner groups from the **Coach** dashboard. The default view of the **Coach** dashboard presents the list of **Classes** with their assigned coaches, and the number of learners enrolled in each class.
fr: Vous pouvez suivre le progrès des **élèves**, créer et assigner des **leçons** et des **quiz** à des classes ou à des groupes d'élèves à partir du tableau de bord **Éducateur**. Par défaut, le tableau de bord **Éducateur** présente la liste des **Classes** avec leurs éducateurs assignés, et le nombre d'élèves inscrits pour chaque classe.

source: Click on a class to access the progress-tracking features and create lessons, quizzes and groups.
fr: Cliquez sur une classe pour accéder aux fonctionnalités de suivi des progrès et créer des leçons, des quiz et des groupes.

source: Choose one of the classes from this view to access the Kolibri coach features.
fr: Choisissez l'une des classes de cette vue pour accéder aux fonctions d'éducateur de Kolibri.

source: Class Home
fr: Accueil de la classe

source: On the **Class Home** tab (|class-home| icon) you can see the overview of the class activity and track progress of the learners on lessons and quizzes assigned to them.
fr: Dans l'onglet **Accueil de la classe** (l'icône |class-home|), vous pourrez accéder à un aperçu de l'activité de la classe et suivre le progrès des élèves par rapport aux leçons et aux quiz qui leur ont été assignés.

source: Class Home presents an overview of learner progress and activity.
fr: L'onglet Accueil de la classe présente un aperçu du progrès et des activités des élèves.

source: Quizzes
fr: Les quiz

source: You can review the progress of learners on the assigned quizzes in the **Quizzes** |exams| block.
fr: Vous pouvez vérifier le progrès des élèves par rapport aux quiz assignés dans le bloc **Quiz** |exams|.

source: Progress bar will indicate how many learners have started |started| and completed |completed-small| the quiz.
fr: La barre de progression indiquera combien d'élèves ont démarré |started| et complété |completed-small| le quiz.

source: You can click on the progress bar to open the complete quiz data in the **Reports** tab.
fr: Vous pouvez cliquer sur la barre de progression pour ouvrir les données complètes du quiz dans l'onglet **Rapports**.

source: Click :guilabel:`VIEW ALL` to access the full list of notifications about quizzes (only the 3 most recent are displayed in the block).
fr: Cliquez sur :guilabel:`AFFICHER TOUT` pour accéder à la liste complète des notifications relatives aux quiz (seules les 3 plus récentes sont affichées dans le bloc).

source: **Quizzes** were known as **Exams** in Kolibri versions prior to 0.12.
fr: Les **Quiz** étaient connus sous le nom d'**Examens** dans les versions de Kolibri antérieures à 0.12.

source: Lessons
fr: Les leçons

source: You can review the progress of learners on the assigned lessons in the **Lessons** |lessons| block.
fr: Vous pouvez suivre le progrès des élèves par rapport aux leçons assignées dans le bloc **Leçons** |lessons|.

source: Progress bar will indicate how many learners have started |started| and completed |completed-small| the lesson, and if they need help |need-help| with some of the resources in it.
fr: La barre de progression indiquera combien d'élèves ont commencé |started| et complété |completed-small| la leçon, et s'ils ont besoin d'aide |need-help| avec certaines des ressources qu'elle comprend.

source: You can click on the progress bar to open the complete lesson data in the **Reports** tab.
fr: Vous pouvez cliquer sur la barre de progression pour ouvrir l'ensemble des données relatives à la leçon dans l'onglet **Rapports**.

source: Click :guilabel:`VIEW ALL` to access the full list of notification about lessons (only the 3 most recent are displayed in the block).
fr: Cliquez sur :guilabel:`AFFICHER TOUT` pour accéder à la liste complète des notifications portant sur les leçons (seules les 3 plus récentes sont affichées dans le bloc).

source: Class Activity
fr: Activité de la classe

source: As learners interact with lessons and quizzes, you can track their progress in the **Class activity** block.
fr: Lorsque les élèves interagissent avec les leçons et les quiz, vous pouvez suivre leurs progrès dans le bloc **Activité de la classe**.

source: When learners start or complete lessons, you will see one notification displaying the title of the lesson they started |started| or completed |completed-small|, and another displaying the title of the specific resource in the lesson they interacted with. In case of quizzes, you will see only the quiz title notification.
fr: Lorsque les élèves démarrent ou terminent des leçons, une notification affichera le titre de la leçon commencée |started| ou achevée |completed-small|, et une autre le titre de la ressource spécifique de la leçon avec laquelle ils ont interagi. Dans le cas des quiz, vous ne verrez que la notification du titre du quiz.

source: When multiple learners are working on the same lesson or quiz, you will see a notification like *Learner1 and 3 other have started...*
fr: Lorsque plusieurs élèves travaillent sur la même leçon ou le même quiz, une notification du type *Élève1 et 3 autres ont commencé...* s'affichera.

source: When learners input multiple incorrect answers to a question in a lesson, the notification in the **Class activity** block will display that one or more learners need help |need-help| with a specific resource.
fr: Lorsque les élèves donnent plusieurs réponses incorrectes à une question dans une leçon, une notification dans le bloc **Activité de la classe** vous avertira qu'un ou plusieurs élèves ont besoin d'aide |need-help| sur une ressource spécifique.

source: You can click each notification link to review the complete resource data in the **Reports** tab.
fr: Vous pouvez cliquer sur chaque notification pour ouvrir les données complètes sur la ressource dans l'onglet **Rapports**.

source: Click :guilabel:`VIEW ALL` to access the full list of activity notifications (only the 5 most recent are displayed in the block).
fr: Cliquez sur :guilabel:`AFFICHER TOUT` pour accéder à la liste complète des notifications d'activité (seules les 5 plus récentes sont affichées dans le bloc).

source: Reports
fr: Les rapports

source: **Reports** tab (|reports| icon) allows you to gain insight into detailed real-time progress of the learners for single resources in lessons and quizzes assigned to them.
fr: L'onglet **Rapports** (l'icône |reports|) fournit une vue détaillée de la progression en temps réel des élèves sur les ressources spécifiques des leçons et des quiz qui leur ont été assignés.

source: Kolibri presents actionable reports for each lesson and quiz the class learners have been assigned, together with the possibility to observe the progress by groups and individual learners.
fr: Kolibri présente des rapports exploitables pour chaque leçon et quiz assignés aux élèves de la classe, ainsi que la possibilité d'observer leur progression par groupe et par élève individuel.

source: Open the **Lessons** sub-tab from the main **Reports** view to access the progress reports on resources included in each lesson.
fr: Ouvrez le sous-onglet **Leçons** de la vue principale **Rapports** pour accéder aux rapports de progrès sur les ressources incluses dans chaque leçon.

source: To review past lessons, use the filter to include only the *Inactive* lessons.
fr: Pour passer en revue les leçons passées, utilisez le filtre pour n'inclure que les leçons *Inactives*.

source: **Progress** column presents the summary of learners who *started* |started| and *completed* |completed-small| the lessons, or *need help* |need-help| with some of the included resources.
fr: La colonne **Progression** présente le résumé des élèves ayant *commencé* |started| et *achevé* |completed-small| les leçons, ou *besoin d'aide* |need-help| sur certaines de leurs ressources.

source: Click on the lesson title to view its list of resources.
fr: Cliquez sur le titre de la leçon pour afficher sa liste de ressources.

source: In the selected lesson **Report** sub-tab, you can see the clickable list of resources, with their own *progress* and the *average time spent* on.
fr: Dans le sous-onglet **Rapport** de la leçon sélectionnée, vous pouvez visualiser la liste cliquable des ressources, avec leur propre *progression* et le *temps moyen passé* dessus.

source: When you click to open the single resource, you can see the progress report for each learner (*started* |started|, *completed* |completed-small| or *need help* |need-help|), and the time spent on it.
fr: En cliquant sur une ressource en particulier, vous accéderez au rapport de progrès pour chaque élève (*commencé* |started|, *achevé* |completed-small| ou *besoin d'aide* |need-help|), et le temps passé sur cette ressource.

source: If the resource is an exercise, you can access the **Difficult questions** sub-tab and review each attempt with incorrect answers.
fr: Si la ressource est un exercice, vous pouvez accéder au sous-onglet **Questions difficiles** et passer en revue chaque tentative avec des réponses incorrectes.

source: Open the **Learners** sub-tab to access the progress report per each learner.
fr: Ouvrez le sous-onglet **Élèves** pour accéder au rapport de progrès par élève.

source: Click :guilabel:`OPTIONS` button and select **Edit details** or **Manage resources** option if you want to edit the lesson directly from its report. Editing the lesson details from here will have the same results as from the **Plan** tab (|edit| icon).
fr: Cliquez sur le bouton :guilabel:`OPTIONS` et sélectionnez l'option **Modifier les détails** ou **Gestions des ressources** si vous voulez modifier la leçon directement à partir de son rapport. Modifier les détails de la leçon ici aura les mêmes résultats qu'à partir de l'onglet **Planification** (icône |edit|).

source: Open the **Quizzes** sub-tab from the main **Reports** view to access the progress reports on resources included in each quiz.
fr: Ouvrez le sous-onglet **Quiz** à partir de la vue principale **Rapports** pour accéder aux rapports de progrès des ressources incluses dans chaque quiz.

source: To review past quizzes, use the filter to include only the *Inactive* ones.
fr: Pour revoir les quiz passés, utilisez le filtre pour n'inclure que les quiz *Inactifs*.

source: **Progress** column presents the summary of learners that *started* |started| and *completed* |completed-small| each quiz.
fr: La colonne **Progression** présente la synthèse des élèves qui ont *commencé* |started| et *achevé* |completed-small| chaque quiz.

source: Click on the quiz title to view its list of resources.
fr: Cliquez sur le titre du quiz pour afficher sa liste de ressources.

source: In the selected quiz **Report** sub-tab, you can see the list of learners, with columns for the *progress* and obtained *score*.
fr: Dans le sous-onglet **Rapport** du quiz sélectionné, vous verrez la liste des élèves, et des colonnes montrant leur *Progression* et la *Note* obtenue.

source: Open the **Difficult questions** sub-tab to view the list of questions learners gave incorrect answers to, and gain insight of how many *need help* |need-help| with the concept.
fr: Ouvrez le sous-onglet **Questions difficiles** pour afficher la liste des questions auxquelles les élèves ont donné des réponses incorrectes, et découvrir combien d'entre-eux ont *Besoin d'aide* |need-help| avec le concept.

source: Click a *difficult question* in the list to review each of the incorrect answers and attempts.
fr: Cliquez sur une *question difficile* dans la liste pour examiner chacune des réponses et tentatives incorrectes.

source: When you click a name of a single learner, you can see the full report for each answer. This can help you understand which questions learners had difficulties answering correctly, and how many attempts they used.
fr: Lorsque vous cliquez sur le nom d'un élève en particulier, vous accéderez à un rapport complet pour chaque réponse. Cela peut vous servir à comprendre quelles questions ont posé le plus de difficultés aux élèves, et combien de tentatives ils ont effectuées.

source: green check mark icon indicates the **correct** answer
fr: une coche verte indique une réponse **correcte**

source: red X mark icon indicates the **incorrect** answer
fr: une croix rouge indique une réponse **incorrecte**

source: gray X mark icon indicates an **unanswered** question
fr: une croix grise indique une question **non-répondue**

source: Click on the attempt icons to see the answers for each one. In the screenshot above learner **Abby L.** had 3 attempts on *Question 8*: the first one was incorrect, the second one (selected) was correct, but the third and finally submitted one was incorrect.
fr: Cliquez sur les icônes relatives à chaque tentative pour voir les réponses spécifiquement données. Dans la capture d'écran ci-dessus, l'élève **Abby L.** a tenté 3 fois de répondre à la *Question 8* : la première réponse était incorrecte, la deuxième (sélectionnée) était correcte, mais la troisième, celle qu'elle a finalement soumise, était incorrecte.

source: **Review Exercise Progress**
fr: **Suivre la progression de l’exercice**

source: When a learner completes the questions of an exercises, the progress bar below the exercise will show the most recent and correct answers. In order for the exercise to be considered completed, the learner must complete the required number of correct answers (*check marks*) **in the row**.
fr: Lorsqu'un élève répond aux questions d'un exercice, la barre de progrès sous l'exercice indiquera les réponses correctes les plus récentes. Pour que l'exercice soit considéré achevé, l'élève doit donner le nombre attendu de bonnes réponses (*coches*) **consécutives**.

source: The correct answers (green check marks) in the image above are not in a row; this exercise will be completed only after the learner gives 5 correct answers one after another.
fr: Les bonnes réponses (coche verte) dans l'image ci-dessus ne sont pas consécutives ; cet exercice ne sera achevé qu'après que l'élève ait donné 5 bonnes réponses l'une après l'autre.

source: Click the :guilabel:`OPTIONS` button and select **Preview** or **Edit details** option if you want to view or edit the quiz details directly from its report. Editing the quiz details from here will have the same results as from the **Plan** tab (|edit| icon).
fr: Cliquez sur le bouton :guilabel:`OPTIONS` et sélectionnez **Aperçu** ou **Modifier les détails** si vous voulez voir ou modifier les détails du quiz directement à partir de son rapport. L'édition des détails du quiz à partir d'ici aura les mêmes résultats qu'à partir de l'onglet **Planification** (icône |edit|).

source: Groups
fr: Les groupes

source: Open the **Groups** sub-tab from the main **Reports** view to access the reports about the progress in lessons and quizzes **per each group**. In the main view you can see the table with summary of lessons and quizzes assigned to each group, number of learners and the last activity.
fr: Ouvrez le sous-onglet **Groupes** de la vue principale **Rapports** pour accéder aux rapports sur le progrès des leçons et des quiz **pour chaque groupe**. Dans la vue principale, un tableau montre les leçons et quiz assignés à chaque groupe, le nombre d'élèves et la dernière activité.

source: Click on group name to view its detailed progress report.
fr: Cliquez sur le nom du groupe pour voir les détails de sa progression.

source: From the group **Reports** sub-tab you can click to access each lesson and quiz.
fr: Dans le sous-onglet **Rapports** du groupe, vous pouvez accéder en un clic à chaque leçon et quiz.

source: In the **Members** sub-tab you can view the summary of completed exercises, scores and viewed resources **for each group learner**, and click to access their full progress report.
fr: Dans le sous-onglet **Membres**, vous pouvez accéder au résumé des exercices terminés, les notes obtenues et les ressources consultées **pour chaque élève du groupe**, et cliquer sur leur nom pour accéder suivre leur progression complète.

source: Learners
fr: Les élèves

source: Open the **Learners** sub-tab from the main **Reports** view to access the progress report per each learner. In the main view you can see the table with summary of completed exercises, scores and viewed resources **for each learner**, and their last activity.
fr: Ouvrez le sous-onglet **Élèves** à partir de la vue principale **Rapports** pour accéder au rapport de progression de chaque élève. Dans la vue principale, un tableau résume les exercices complétés, les notes obtenues et ressources vues **pour chaque élève**, et leur dernière activité.

source: Click on learner name to view their detailed progress report.
fr: Cliquez sur le nom d'un élève pour voir son rapport de progrès détaillé.

source: From the learner **Reports** sub-tab you can click to access each lesson and quiz.
fr: Dans le sous-onglet **Rapports** de l'élève, vous pouvez accéder en un clic à chaque leçon et quiz.

source: In the **Activity** sub-tab you can review their activity on resources assigned.
fr: Dans le sous-onglet **Activité**, vous pouvez suivre leur activité sur les ressources assignées.

source: Plan
fr: Planification

source: Use the options in the **Plan** tab to create and manage the lessons, quizzes, and groups for the selected class.
fr: Utilisez les options de l'onglet **Planification** pour créer et gérer des leçons, quiz et groupes pour la classe sélectionnée.

source: Manage Lessons
fr: Gestion des leçons

source: Kolibri **Lessons** offer you the possibility to prepare smaller selections of available learning resources and assign them to learners on a temporary basis. You can select resources from multiple channels, and copy the created lessons to other classes or groups as needed.
fr: Les **leçons** de Kolibri vous offrent la possibilité de faire de plus petites sélections de ressources d'apprentissage disponibles et de les assigner aux élèves temporairement. Vous pouvez sélectionner des ressources à partir de plusieurs chaînes et copier les leçons créés dans d'autres classes ou groupes au besoin.

source: To view, create or delete lessons, as well as assign them to learners, use the **Lessons** sub-tab in the **Plan** tab (|edit| icon) of your **Coach** dashboard. Default view displays the list of all lessons created for the selected class, the number of resources they contain, groups they are assigned to, and their status indicator. You can filter the lessons in order to see all, or just active/inactive ones.
fr: Pour visualiser, créer ou supprimer des leçons, ainsi que pour les assigner aux élèves, utilisez le sous-onglet **Leçons** dans l'onglet **Planification** (l'icône |edit|) de votre tableau de bord **Éducateur**. La vue par défaut affiche la liste de toutes les leçons créées pour la classe sélectionnée, le nombre de ressources qu'elles contiennent, les groupes auxquels elles sont assignées et leur indicateur de statut. Vous pouvez filtrer les leçons afin de les voir toutes, ou seulement celles actives/inactives.

source: To manage |lessons| **Lessons** in Kolibri classes and groups, you must sign in as **coach**, **admin** or **super admin**.
fr: Pour gérer les |lessons| **leçons** dans les classes et groupes Kolibri, vous devez être connecté en tant qu' **éducateur**, **admin** ou **super admin**.

source: Create New Lesson
fr: Créer une nouvelle leçon

source: To create a new lesson |lessons|, follow these steps.
fr: Pour créer une nouvelle leçon |lessons|, suivez les étapes suivantes.

source: Click the :guilabel:`NEW LESSON` button.
fr: Cliquez sur le bouton :guilabel:`NOUVELLE LEÇON`.

source: Fill in the field for the lesson title, description and choose the group(s) or the entire class as the recipients.
fr: Saisissez le titre de la leçon, la description et choisissez le(s) groupe(s) ou la classe toute entière comme destinataires.

source: Click :guilabel:`CONTINUE`. In this step, the lesson does not have any learning resources yet, but you can see and edit some options.
fr: Cliquez sur :guilabel:`CONTINUER`. À ce stade, la leçon ne contient pas encore de ressources pédagogiques, mais vous pouvez voir et modifier certaines options.

source: Click :guilabel:`MANAGE RESOURCES` and select the content channel from which you wish to select resources for the lesson.
fr: Cliquez sur :guilabel:`GESTION DES RESSOURCES` et sélectionnez la chaîne de contenu dans laquelle vous souhaitez puiser des ressources pour la leçon.

source: Keep navigating the topic tree of the selected content channel until you arrive to single content items. Use the checkboxes to select the resources you want to include in the lesson, and you will see a notification at the bottom of the page that the resource has been added.
fr: Continuez à naviguer dans l'arborescence de la chaîne de contenu sélectionnée jusqu'à ce que vous arriviez à des éléments de contenu uniques. Utilisez les cases à cocher pour sélectionner les ressources que vous voulez inclure dans la leçon. Une notification apparaîtra en bas de la page pour indiquer que la ressource a été ajoutée.

source: Use the **Search** feature to look for resources about a specific subject. Write the search term in the field, and press the :guilabel:`ENTER` key or click the |search| button to display the results. When you finish, press the :guilabel:`EXIT SEARCH` button to return to the list of selected resources.
fr: Utilisez la fonction **Rechercher** pour localiser des ressources sur un sujet particulier. Saisissez le terme recherché dans le cadre, et appuyez sur la touche :guilabel:`ENTRÉE` ou cliquez sur le bouton |search| pour afficher les résultats. Lorsque vous avez terminé, appuyez sur le bouton :guilabel:`QUITTER LA RECHERCHE` pour retourner à la liste des ressources sélectionnées.

source: You can filter the search results by *type* of resource (video, document, exercise...), include only those from a specific *channel*, or exclude :ref:`resources for coaches <coach_resource>`.
fr: Vous pouvez filtrer les résultats de la recherche par *catégorie* de ressource (vidéo, document, exercice...), n'inclure que les ressources d'une *chaine* spécifique, ou exclure les :ref:`ressources pour les éducateurs <coach_resource>`.

source: Press the :guilabel:`FINISH` button to close the **Manage resources** window and return to the main view of the lesson.
fr: Cliquez sur :guilabel:`TERMINER` pour fermer la fenêtre **Gestion des ressources** et retourner à la vue principale de la leçon.

source: After you've selected the resources for the lesson, you can:
fr: Après avoir sélectionné les ressources pour la leçon, vous pouvez :

source: Grab the |drag| button to reorder lesson resources with the mouse (drag and drop)
fr: Utiliser le bouton |drag| pour réorganiser les ressources de la leçon avec la souris (glisser-déposer)

source: Use the |arrow-up| and |arrow-down| buttons to reorder by keyboard navigation
fr: Utiliser les boutons |arrow-up| et |arrow-down| pour les réorganiser à l'aide de la navigation clavier

source: Click the :guilabel:`REMOVE` button to delete a resource
fr: Cliquer sur le bouton :guilabel:`SUPPRIMER` pour retirer une ressource

source: You will see a confirmation notification at the bottom every time you change something in the lesson.
fr: A chaque fois que vous modifierez quelque chose dans la leçon, une notification de confirmation apparaîtra en bas de l'écran.
