Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/coach.po
Languages: fr

source: To add more resources to the same lesson and keep editing if needed, follow the steps 4 to 9 again.
fr: Pour ajouter plus de ressources à la même leçon et continuer à les modifier si nécessaire, suivez à nouveau les étapes 4 à 9.

source: Change Lesson Status
fr: Changer le statut d'une leçon

source: A newly created lesson is *Inactive* by default, meaning that learners will not see it in their **Learn** view. To change the lesson status, follow these steps.
fr: Une leçon nouvellement créée est *Inactive* par défaut, ce qui signifie que les élèves ne la verront pas dans leur vue **Apprendre**. Pour changer le statut de la leçon, suivez ces étapes.

source: Select the desired lesson from the list in the **Lessons** tab.
fr: Sélectionnez la leçon de votre choix dans la liste de l'onglet **Leçons**.

source: Click :guilabel:`OPTIONS` button and select **Edit details**.
fr: Cliquez sur :guilabel:`OPTIONS` et sélectionnez **Modifier les détails**.

source: Select **Active** or **Inactive** under the *Status* heading.
fr: Dans la rubrique *Statut*, choisissez **Actif** ou **Inactif**.

source: Click :guilabel:`SAVE CHANGES` to confirm, or :guilabel:`CANCEL` to exit without change.
fr: Cliquez sur :guilabel:`ENREGISTRER LES MODIFICATIONS` pour confirmer, ou sur :guilabel:`ANNULLER` pour quitter sans sauvegarder les changements.

source: Change Lesson Recipients
fr: Changer les destinataires d'une leçon

source: You can change the recipients of the lesson, reassigning the lesson to a different group or the entire class. Follow these steps.
fr: Vous pouvez changer les destinataires d'une leçon, en la réassignant à un autre groupe ou à la classe toute entière. Suivez les étapes suivantes.

source: Select **Entire class** or the group(s) of learners to whom you wish to assign the lesson under the *Recipients* heading.
fr: Dans la rubrique *Destinataires*, sélectionnez **Toute la classe** ou le(s) groupe(s) d'élèves à qui vous souhaitez assigner la leçon.

source: Copy Lesson
fr: Copier une leçon

source: To copy a lesson to a different group or another class of your facility, follow these steps.
fr: Pour copier une leçon vers un groupe différent ou une autre classe de votre établissement, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` and select **Copy lesson**.
fr: Cliquez sur :guilabel:`OPTIONS` et sélectionnez **Copier la leçon**.

source: Select the class to which you wish to copy the lesson to.
fr: Sélectionnez la classe dans laquelle vous souhaitez copier la leçon.

source: If the destination class has more than one group, select **Entire class** or the group(s) of learners to whom you wish to assign the lesson.
fr: Si la leçon de destination a plus d'un groupe, sélectionnez **Classe toute entière** ou le(s) groupe(s) d'élèves auquel/auxquels vous souhaitez assigner la leçon.

source: Click :guilabel:`COPY` to confirm, or :guilabel:`CANCEL` to exit without change.
fr: Cliquez sur :guilabel:`COPIER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans effectuer de changement.

source: If the lesson is copied to another group in the same class, it will appear in the **Lessons** tab as the *Copy of...*. Follow the steps in the next heading to rename it.
fr: Si la leçon est copiée dans un autre groupe de la même classe, elle apparaîtra dans l'onglet **Leçons** comme la *Copie de...*. Suivez les étapes de la rubrique suivante pour la renommer.

source: Rename Lesson
fr: Renommer une leçon

source: To rename a lesson, follow these steps.
fr: Pour renommer une leçon, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` and select **Edit details**.
fr: Cliquez sur :guilabel:`OPTIONS` et sélectionnez **Modifier les détails**.

source: Change the lesson title in the confirmation window.
fr: Modifiez le titre de la leçon dans la fenêtre de confirmation.

source: Click :guilabel:`SAVE` to confirm, or :guilabel:`CANCEL` to exit without renaming the lesson.
fr: Cliquez sur :guilabel:`ENREGISTRER LES MODIFICATIONS` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans renommer la leçon.

source: Delete Lesson
fr: Supprimer une leçon

source: To delete a lesson, follow these steps.
fr: Pour supprimer une leçon, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` and select **Delete**.
fr: Cliquez sur :guilabel:`OPTIONS` et sélectionnez **Supprimer**.

source: Click :guilabel:`DELETE` in the confirmation window to proceed, or :guilabel:`CANCEL` to exit without deleting the lesson.
fr: Cliquez sur :guilabel:`SUPPRIMER` dans la fenêtre de confirmation pour continuer, ou sur :guilabel:`ANNULER` pour quitter sans la supprimer.

source: Manage Quizzes
fr: Gérer les quiz

source: You can view, create and delete quizzes, as well as assign them to learners, using the **Quizzes** sub-tab in the **Plan** tab (|edit| icon) of your **Coach** dashboard. The default view displays the list of all quizzes in a selected class, with indicators of their visibility status and groups they are assigned to.
fr: Vous pouvez afficher, créer et supprimer des quiz, ainsi que les assigner aux élèves, à partir du sous-onglet **Quiz** de l'onglet **Planification** (icône |edit|) de votre tableau de bord **Éducateur**. La vue par défaut affiche la liste de tous les quiz d'une classe sélectionnée, avec leur statut de visibilité et les groupes auxquels ils sont assignés.

source: To manage **Quizzes** |exams| in Kolibri classes and groups you must sign in as **coach**, **admin** or **super admin**.
fr: Pour gérer les **Quiz** |exams| dans les classes et groupes de Kolibri vous devez être connecté en tant qu'**éducateur**, **admin** ou **super admin**.

source: Create New Quiz
fr: Créer un nouveau quiz

source: To create a new quiz |exams|, click the :guilabel:`NEW QUIZ` button.
fr: Pour créer un nouveau quiz |exams|, cliquez sur le bouton :guilabel:`NOUVEAU QUIZ`.

source: Fill in the field for the quiz title in the *Create new quiz* page.
fr: Saisissez le titre du quiz dans le champ prévu à cet effet de la page *Créer un nouveau quiz*.

source: Adjust the number of questions you want the quiz to contain. You can use the arrow field value modifiers with the mouse, or :guilabel:`-` and :guilabel:`+` buttons if you are using the keyboard.
fr: Ajustez le nombre de questions que vous voulez que le quiz contienne. Vous pouvez utiliser les flèches à l'aide de la souris pour modifier leur nombre, ou :guilabel:`-` et :guilabel:`+` sur votre clavier.

source: Navigate through the topic tree and activate checkboxes of those exercises you want to include in the quiz.
fr: Naviguez dans l'arborescence des sujets et cochez les exercices que vous souhaitez inclure au quiz.

source: As you keep adding and removing the exercises you will see confirmation messages at the bottom.
fr: Au fur et à mesure que vous ajoutez et supprimez des exercices, des messages de confirmation apparaîtront en bas de la page.

source: Use the **Search** feature to look for topics and exercises about a specific subject. Write the search term in the field, press the :guilabel:`ENTER` key or click the |search| button to display the results.
fr: Utilisez la fonction **Rechercher** pour localiser des ressources sur un sujet particulier. Saisissez le terme de recherche dans le champ, et appuyez sur la touche :guilabel:`ENTRÉE` ou cliquez sur le bouton |search| pour afficher les résultats.

source: You can filter the search results by *type* of resource (exercise or topic), include only those from a specific *channel*, or exclude :ref:`resources for coaches <coach_resource>`. Click :guilabel:`EXIT SEARCH` button to return to main quiz view.
fr: Vous pouvez filtrer les résultats de la recherche par *catégorie* de ressource (exercice ou sujet), inclure seulement ceux d'une *chaine* spécifique, ou exclure les :ref:`ressources des éducateurs <coach_resource>`. Cliquez sur le bouton :guilabel:`QUITTER LA RECHERCHE` pour retourner à la vue principale du quiz.

source: When you finish selecting resources, click :guilabel:`CONTINUE` button to preview the quiz.
fr: Une fois la sélection des ressources terminée, cliquez sur le bouton :guilabel:`CONTINUER` pour prévisualiser le quiz.

source: Beware that if you click the :guilabel:`GO BACK` button, you will exit the quiz builder and loose the resource selection.
fr: Attention, si vous cliquez sur le bouton :guilabel:`RETOUR`, vous quitterez le module de création du quiz et perdrez votre sélection de ressources.

source: You can choose between **Randomized** and **Fixed** question order.
fr: Les questions peuvent être posées en ordre **Aléatoire** ou **Fixe**.

source: To present the questions in a different (*random*) order to each learner, select :guilabel:`Randomized`.
fr: Pour présenter les questions dans un ordre différent (*aléatoire*) pour chaque élève, sélectionnez :guilabel:`Aléatoire`.

source: To present the same (*fixed*) question order to all learners, select :guilabel:`Fixed`. You can reorder the questions by using the |drag| button with the mouse (drag and drop), or with |arrow-up| and |arrow-down| buttons if you navigate by keyboard.
fr: Pour présenter les questions dans le même ordre (*fixe*)pour tous les élèves, sélectionnez :guilabel:`Fixe`. Vous pouvez réorganiser les questions au moyen du bouton |drag| avec la souris (glisser-déposer), ou avec les boutons |arrow-up| et |arrow-down| si vous utilisez votre clavier.

source: Use the option *Choose a different set of questions* to obtain an alternative selection of questions to display.
fr: Utilisez l'option *Choisissez une autre série de questions* pour charger une autre sélection de questions.

source: When you are satisfied with the question order click the :guilabel:`FINISH` button, and you will see a confirmation notification at the bottom.
fr: Lorsque vous êtes satisfait de l'ordre des questions, cliquez sur le bouton :guilabel:`TERMINER`, et une notification de confirmation apparaîtra en bas de l'écran.

source: Change Quiz Recipients
fr: Changer les destinataires du quiz

source: Newly created quiz is by default visible to entire class. To change quiz *Recipients*, that is select group(s) of learners instead of the whole class, follow these steps.
fr: Le quiz nouvellement créé est par défaut visible par toute la classe. Pour modifier les *Destinataires* du quiz , c'est-à-dire sélectionner un ou plusieurs groupes d'élèves au lieu de la classe entière, suivez les étapes suivantes.

source: Select the desired quiz from the list in the **Quizzes** subtab.
fr: Sélectionnez le quiz concerné dans la liste du sous-onglet **Quiz**.

source: Click :guilabel:`OPTIONS` button and select the **Edit details** option.
fr: Cliquez sur le bouton :guilabel:`OPTIONS` et sélectionnez l'option **Modifier les détails**.

source: Select the group(s) of learners to whom you wish to assign the quiz under the *Recipients* heading.
fr: Sélectionnez le(s) groupe(s) d'élèves auquel/auxquels vous souhaitez assigner le quiz sous la rubrique *Destinataires*.

source: Change Quiz Status
fr: Changer le statut du quiz

source: Newly created quiz is by default not active. Once you set the visibility of quiz to the chosen group(s) of learners, you need to **Activate** it so it can appear in the **Learn** view of the learners it is assigned to.
fr: Par défaut, les nouveaux quiz sont inactifs. Une fois définis les groupe(s) d'élèves destinataires d'un quiz, vous devez l'**activer** pour qu'il puisse apparaître dans la vue **Apprendre** des élèves auxquels il est assigné.

source: Select **Active** at the start of the quiz period. When the quiz period concludes, select the **Inactive** option.
fr: Sélectionnez **Actif** au moment où vous souhaitez le soumettre aux élèves. Une fois la période de tests terminée, déactivez le quiz en sélectionnant l'option **Inactif**.

source: Copy Quiz
fr: Copier un quiz

source: To copy a quiz to a different group or another class, follow these steps.
fr: Pour copier un quiz dans un autre groupe ou une autre classe, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` and select **Copy quiz**.
fr: Cliquez sur :guilabel:`OPTIONS` et sélectionnez **Copier le quiz**.

source: Select the class to which you wish to copy the quiz to and click :guilabel:`CONTINUE`.
fr: Sélectionnez la classe vers laquelle vous souhaitez copier le quiz et cliquez sur :guilabel:`CONTINUER`.

source: If the quiz is copied to another group in the same class, it will appear in the **Quizzes** tab as the *Copy of...*. Follow the steps in the next section to rename it.
fr: Si le quiz est copié dans un autre groupe de la même classe, il apparaîtra dans l'onglet **Quiz** sous le nom de *Copie de...*. Suivez les étapes de la section suivante pour le renommer.

source: Rename quiz
fr: Renommer un quiz

source: To rename quiz, follow these steps.
fr: Pour renommer un quiz, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` for the desired quiz and select **Edit details** option.
fr: Cliquez sur :guilabel:`OPTIONS` pour le quiz concerné et sélectionnez l'option **Modifier les détails**.

source: Change the quiz title in the confirmation window.
fr: Changez le titre du quiz dans la fenêtre de confirmation.

source: Click :guilabel:`SAVE CHANGES` to confirm, or :guilabel:`CANCEL` to exit without renaming the quiz.
fr: Cliquez sur :guilabel:`ENREGISTRER LES MODIFICATIONS` pour confirmer ou :guilabel:`ANNULER` pour quitter sans renommer le quiz.

source: Delete Quiz
fr: Supprimer un quiz

source: To delete quiz, follow these steps.
fr: Pour supprimer un quiz, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` for the desired quiz and select **Delete** option.
fr: Cliquez sur :guilabel:`OPTIONS` pour le quiz concerné et sélectionnez l'option **Supprimer** .

source: Click :guilabel:`DELETE` in the confirmation window to proceed, or :guilabel:`CANCEL` to exit without deleting the quiz.
fr: Cliquez sur :guilabel:`SUPPRIMER` dans la fenêtre de confirmation pour continuer, ou sur :guilabel:`ANNULER` pour quitter sans supprimer le quiz.

source: All data from the quiz you are deleting will be lost.
fr: Toutes les données du quiz supprimé seront perdues.

source: Manage Groups
fr: Gérer les groupes

source: In case you need to further divide learners inside classes, for example to address the different progress needs, you can use the **Groups** feature. Create and delete groups, as well as assign learners to them from the **Groups** sub-tab in the **Plan** tab (|edit| icon) of your **Coach** dashboard. Default view displays the list of all groups for the selected class, with the number of assigned learners for each group.
fr: Dans le cas où vous auriez besoin de diviser davantage les élèves d'une même classe, par exemple pour répondre à différents besoins d'évolution, vous pouvez utiliser la fonctionnalité **Groupes**. Elle permet de créer et de supprimer des groupes, ainsi que d'y assigner des élèves à partir du sous-onglet **Groupes** de l'onglet **Planification** (icône |edit|) de votre tableau de bord **Éducateur**. Par défaut, cette vue affiche la liste de tous les groupes pour la classe sélectionnée, avec le nombre d'élèves assignés à chaque groupe.

source: To manage Kolibri groups you must sign in as **coach**, **admin** or **super admin**.
fr: Pour gérer les groupes Kolibri vous devez être connecté en tant qu'**éducateur**, **admin** ou **super admin**.

source: Create a New Group
fr: Créer un nouveau groupe

source: To create a new learner group, follow these steps.
fr: Pour créer un nouveau groupe d'élèves, suivez les étapes suivantes.

source: Click the :guilabel:`NEW GROUP` button.
fr: Cliquez sur le bouton :guilabel:`NOUVEAU GROUPE`.

source: Give group a desired name.
fr: Donnez au groupe le nom de votre choix.

source: Click :guilabel:`SAVE` to confirm, or :guilabel:`CANCEL` to exit without creating a group.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter le module sans créer de groupe.

source: Enroll Learners in a Group
fr: Inscrire des élèves dans un groupe

source: Click to open the desired group in the **Groups** sub-tab.
fr: Ouvrez le groupe en question en cliquant dessus dans le sous-onglet **Groupes**.

source: Click the :guilabel:`ENROLL LEARNERS` button.
fr: Cliquez sur le bouton :guilabel:`INSCRIRE LES ÉLÈVES`.

source: List in this view contains all the learners currently **not** enrolled in the selected group.
fr: Tous les élèves actuellement **non** inscrits dans le groupe sélectionné apparaîtront.

source: You can search for a specific learner by name.
fr: Vous pouvez rechercher un élève particulier par son nom.

source: Use checkboxes to select all the learners in the list, or the search field for specific learners you want to enroll in the group.
fr: Utilisez les cases à cocher ou la fonction de recherche pour sélectionner tous les élèves de la liste ou spécifiques que vous souhaitez inscrire dans le groupe.

source: Click :guilabel:`CONFIRM` to finish enrolling the selected learners and return to the group page.
fr: Cliquez sur :guilabel:`CONFIRMER` pour terminer l'inscription des élèves sélectionnés et retourner à la page du groupe.

source: Remove Learners from Group
fr: Retirer des élèves d'un groupe

source: Click :guilabel:`REMOVE` for the chosen learner.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour l'élève en question.

source: Click :guilabel:`REMOVE` to confirm, or :guilabel:`CANCEL` to exit without removing the learner.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter le module sans retirer l'élève du groupe.

source: Rename Group
fr: Renommer un groupe

source: To rename group, follow these steps.
fr: Pour renommer un groupe, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` button on the right edge of the desired group.
fr: Cliquez sur le bouton :guilabel:`OPTIONS` à la droite du groupe en question.

source: Select the **Rename** option.
fr: Sélectionnez l'option **Renommer** .

source: Input the new name for the group in the confirmation window.
fr: Saisissez le nouveau nom du groupe dans la fenêtre de confirmation.

source: Click :guilabel:`SAVE` button to proceed, or :guilabel:`CANCEL` to exit without renaming the group.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour continuer, ou sur :guilabel:`ANNULER` pour quitter le module sans renommer le groupe.

source: Delete Group
fr: Supprimer un groupe

source: To delete a group, follow these steps.
fr: Pour supprimer un groupe, suivez les étapes suivantes.

source: Select the **Delete** option.
fr: Sélectionnez l'option **Supprimer**.

source: Click :guilabel:`DELETE` button in the confirmation window to proceed, or :guilabel:`CANCEL` to exit without deleting the group.
fr: Cliquez sur :guilabel:`SUPPRIMER` dans la fenêtre de confirmation pour continuer, ou sur :guilabel:`ANNULER` pour quitter le module sans supprimer le groupe.

source: Coach Support Resources
fr: Ressources de soutien aux éducateurs

source: `Kolibri Studio <https://studio.learningequality.org/>`_ supports the option to set visibility for any resource added to content channels as a **Coach resource**. These materials can be lesson plans, professional development readings, training materials, etc. only viewable by coaches and not learners. When content curators set the visibility this way, the resource will not be visible by learners while browsing Kolibri **Channels**, but only to admins, facility coaches, or other users assigned to coach classes.
fr: `Kolibri Studio <https://studio.learningequality.org/>`_ permet de classifier toute ressource ajoutée aux chaînes de contenu comme une **Ressource pour les éducateurs**. Il peut s'agir de plans de leçons, de lectures de développement professionnel, de supports de formation, etc., que seuls les éducateurs, et non pas les élèves, pourront visualiser. Lorsque les curateurs de contenu choisissent cette option, la ressource ne sera pas visible aux élèves pendant leur navigation dans les **Chaînes** de Kolibri, mais seulement aux administrateurs, aux éducateurs d'établissements ou autres utilisateurs désignés éducateurs de classes.

source: However, coach can decide to include any of these resources in :ref:`lessons <manage_lessons>` or :ref:`quizzes <manage_quizzes>`, in which case they will be visible to learners in the context of that lesson or a quiz.
fr: Cependant, l'éducateur peut décider d'inclure l'une de ces ressources dans une :ref:`leçon <manage_lessons>` ou dans un :ref:`quiz <manage_quizzes>`, de sorte qu'elles seront visibles aux élèves dans le contexte de la leçon ou du quiz en question.

source: Setting the visibility of content in Kolibri Studio.
fr: Définir la visibilité du contenu dans Kolibri Studio.

source: Coach resources and content channels that contain them are marked with the |coach-resource| icon in Kolibri.
fr: Les ressources des éducateurs et les chaines de contenu qui en contiennent sont identifiées par l'icône |coach-resource| dans Kolibri.

source: Content channel with 4 support resources for coaches in Kolibri.
fr: Chaîne de contenu contenant 4 ressources de soutien aux éducateurs dans Kolibri.
