Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/contact.po
Languages: fr

source: Get in touch
fr: Nous contacter

source: Getting support from Learning Equality and our community
fr: Faire appel au soutien de Learning Equality et de notre communauté

source: Due to the open-source nature of our work, we encourage that all inquiries, inputs, contributions and feedback are openly shared in our `Community Forums <https://community.learningequality.org/>`_, so that any user with similar questions to yours can benefit from the answer, and have a centralized place to search for it. *Please consider supporting others whenever you can. Your goals are likely overlapping with other users of Kolibri, so you may consider yourself as part of a community of like-minded practitioners!*
fr: Compte tenu de la nature open source de notre travail, nous vous encourageons à partager toutes vos demandes, contributions et commentaires ouvertement sur nos `Forums communautaires <https://community.learningequality.org/>`_, de sorte que tout utilisateur ayant des questions similaires aux vôtres puisse bénéficier de la réponse, et d'un espace centralisé sur lequel effectuer des recherches. *Merci d'apporter votre soutien aux autres chaque fois que vous le pouvez. Vos objectifs se recoupent sans doute avec ceux d'autres utilisateurs de Kolibri, vous pouvez donc vous considérer comme faisant partie d'une communauté de praticiens partageant les mêmes idées !*

source: The first thing you need to do is register on the forum. Once registered, please read the the first two pinned topics (*Welcome to LE’s Support Community* and *How do I post to this forum?* )
fr: La première chose à faire est de vous inscrire sur le forum. Une fois inscrit, veuillez lire les deux premiers sujets épinglés (*Bienvenue à la communauté de soutien de LE* et *Comment poster sur ce forum ?* )

source: You can add a new topic with the :guilabel:`+ New Topic` button on the right. Make sure to select the appropriate category in the **Create a New Topic** window to facilitate the triage and response processes.
fr: Vous pouvez ajouter un nouveau sujet avec le bouton :guilabel:`+ Nouveau sujet` à droite. Assurez-vous de sélectionner la catégorie appropriée dans la fenêtre **Créer un nouveau sujet** pour faciliter les processus de triage et de réponse.

source: Feedback
fr: Vos retours

source: New ideas
fr: Nouvelles idées

source: Until we can present a proper feedback platform, we encourage you to post any new ideas to the `Community Forums <https://community.learningequality.org/>`_.
fr: Jusqu'à ce que nous puissions lancer une plateforme de feedback appropriée, nous vous encourageons à poster toute nouvelle idée sur les `Forums communautaires <https://community.learningequality.org/>`_.

source: Technical issues
fr: Problèmes techniques

source: Try reading the :ref:`Troubleshooting <support>` section of this guide first.
fr: Référez-vous d'abord à la section :ref:`Dépannage <support>` de ce guide.

source: In order to report a technical issue, you can either use the *Support* category in our forum, or open up an issue report in our public software repository, following the guidelines:
fr: Pour signaler un problème technique, vous pouvez soit utiliser la catégorie *Support* de notre forum, soit ouvrir un ticket dans notre dépôt de logiciel public, en suivant les directives suivants :

source: Contributions and development
fr: Contributions et développement

source: Kolibri is an open-source project, and as such, contributions from the tech community are welcomed, encouraged and appreciated. If you'd like to contribute to Kolibri, please refer to our developer docs:
fr: Kolibri est un projet open source, et en tant que tel, des contributions de la communauté technologique sont les bienvenues, encouragées et appréciées. Si vous souhaitez contribuer à Kolibri, veuillez vous référer à notre documentation dédiée aux développeurs :
