Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/faq.po
Languages: fr

source: Frequently Asked Questions
fr: Foire aux questions

source: How much does Kolibri cost to install?
fr: Combien coûte l'installation de Kolibri ?

source: Kolibri is **free and open source** software! To learn more about free software, see this `Free Software Foundation article <https://www.fsf.org/about/what-is-free-software>`_.
fr: Kolibri est un logiciel **gratuit et open source** ! Pour en savoir plus sur les logiciels gratuits, consultez cet article de la `Free Software Foundation <https://www.fsf.org/about/what-is-free-software>`_.

source: Do I need the internet to run Kolibri?
fr: Ai-je besoin d'Internet pour exécuter Kolibri ?

source: Short answer: **No!** You can bring or send a storage device (USB or HDD unit) with Kolibri installer and content channels downloaded somewhere with available internet connection, and install everything on an completely offline device.
fr: La réponse est **Non !** Vous pouvez utiliser un périphérique de stockage (USB ou disque dur) sur lequel l'installateur Kolibri et les chaînes de contenu auront été téléchargés à partir d'une connexion Internet disponible, et installer le tout sur un appareil complètement hors ligne.

source: In a nutshell, Kolibri can run independently of internet availability, but you need to procure the installer and content channels from somewhere for the initial installation and for subsequent upgrades.
fr: En bref, Kolibri peut fonctionner indépendamment de la disponibilité d'Internet, mais vous devez vous procurer l'installateur et les chaînes de contenu quelque part pour l'installation initiale et pour les mises à niveau ultérieures.

source: One possibility is to have Kolibri installed in one location with internet connection, where you can import content channels from `Kolibri Studio <https://studio.learningequality.org/>`_ (curriculum tool and content curation server), and then export them to removable USB drives that you bring or send to offline locations (rural schools, refugee camps, etc.) to import locally.
fr: Une possibilité consiste à installer Kolibri sur un système disposant d'une connexion Internet sur lequel vous pouvez importer des chaînes de contenu à partir de `Kolibri Studio <https://studio.learningequality.org/>`_ (outil de programme d'études et serveur de gestion de contenu), puis à les exporter sur des supports USB amovibles que vous apporterez ou enverrez aux sites hors ligne (écoles rurales, camps de réfugiés, etc.) pour les importer localement.

source: What languages is Kolibri available in?
fr: Dans quelles langues Kolibri est-il disponible ?

source: Both Kolibri and `Kolibri Studio <https://studio.learningequality.org/>`_ are translation-ready and currently available in these languages:
fr: Kolibri et `Kolibri Studio <https://studio.learningequality.org/>`_ sont tous deux prêts à être traduits et sont actuellement disponibles dans les langues suivantes :

source: Language
fr: Langue

source: English
fr: Anglais

source: Arabic
fr: Arabe

source: Bulgarian
fr: Bulgare

source: Burmese
fr: Birman

source: French
fr: Français

source: Hindi (India)
fr: Hindi (Inde)

source: Portuguese (Brazil)
fr: Portugais (Brésil)

source: Spanish (Latin America)
fr: Espagnol (Amérique Latine)

source: Spanish (Spain)
fr: Espagnol (Espagne)

source: Swahili (Tanzania)
fr: Swahili (Tanzanie)

source: Telugu
fr: Télougou

source: Urdu (Pakistan)
fr: Ourdou (Pakistan)

source: Vietnamese
fr: Vietnamien

source: To contribute to Kolibri and Kolibri Studio as a translator, you can get started over on our `translations and internationalization page <https://learningequality.org/translate/>`_.
fr: Pour apporter votre contribution à Kolibri et Kolibri Studio en tant que traducteur, vous pouvez vous lancer sur notre page `traductions et internationalisation <https://learningequality.org/translate/>`_.

source: What are the typical deployment scenarios?
fr: Quels sont les scénarios de déploiement les plus courants ?

source: There is no typical implementation setting. However, we can share with you what we’ve learned from our community of KA Lite and Kolibri users. Some example implementation settings are provided below based on the presence of a coach and whether the settings allows for formal, non-formal, and informal learning.
fr: Il n'y a pas de cadre de mise en œuvre type. Cependant, nous pouvons partager avec vous ce que nous avons appris de notre communauté d'utilisateurs de KA Lite et Kolibri. Quelques exemples de cadres de mise en œuvre sont fournis ci-dessous en fonction de la présence ou non d'un éducateur et d'un environnement permettant un apprentissage formel, non formel ou informel.

source: Coach
fr: Avec un éducateur

source: No Coach
fr: Sans éducateur

source: Formal and Non-Formal
fr: Formel et non formel

source: School classroom
fr: Classe d'école

source: Home schooling
fr: Éducation à domicile

source: Supplementary education setting
fr: Enseignement complémentaire

source: After school program
fr: Programme après la classe

source: Supplementary education setting (computer labs model)
fr: Enseignement complémentaire (modèle de labo informatique)

source: Use in classroom that has teacher, but without coach engagement or monitoring
fr: Utilisation dans une salle classe où il y a un enseignant, mais sans l'engagement ni la surveillance d'un éducateur

source: Informal
fr: Informel

source: Tutoring session
fr: Séance de tutorat

source: Mobile school vans
fr: Camionnettes d'école mobile

source: Use for homework only
fr: Uniquement pour les devoirs à la maison

source: What are some possible hardware configurations for deploying Kolibri?
fr: Quelles sont les configurations matérielles possibles pour le déploiement de Kolibri ?

source: To deploy Kolibri for multiple users you will need:
fr: Pour mettre en place Kolibri pour plusieurs utilisateurs, il vous faudra :

source: **Server device**: a computer that is running the Kolibri software (e.g. a desktop computer, laptop, or Raspberry Pi).
fr: **Un appareil serveur** : un ordinateur qui exécute le logiciel Kolibri (par exemple un ordinateur de bureau, un ordinateur portable ou un Raspberry Pi).

source: One or more **client devices** that have web browsers (laptops, tablets, desktop computers, etc)
fr: Un ou plusieurs **appareils clients** dotés de navigateurs Web (ordinateurs portables, tablettes, ordinateurs de bureau, etc)

source: For a single-device deployment (1) and (2) can be the same computer, with the browser connecting to the locally running Kolibri server. To make the software accessible to multiple client devices, you will need to put them on the same local network as the Kolibri server device (1), e.g. through a WIFI access point.
fr: Pour un déploiement sur un seul appareil, (1) et (2) peuvent être le même ordinateur, le navigateur se connectant au serveur Kolibri éxécuté localement. Pour rendre le logiciel accessible à plusieurs appareils clients, vous devrez les placer sur le même réseau local que l'appareil serveur Kolibri (1), par exemple par un point d'accès WIFI.

source: To read more details, see the full `Kolibri Hardware Guide <https://learningequality.org/r/hardware-guide>`_ and examples of `Hardware Configurations for Kolibri <https://learningequality.org/r/hardware>`_ (PDF documents).
fr: Pour plus de détails, référez-vous au `Guide matériel Kolibri complet <https://learningequality.org/r/hardware-guide>`_ et aux exemples de `Configurations matérielles pour Kolibri <https://learningequality.org/r/hardware>`_ (documents PDF).

source: How can I generate content aligned to local curriculum?
fr: Comment puis-je créer un contenu conforme au programme d'études local ?

source: Use `Kolibri Studio <https://studio.learningequality.org/>`_ curriculum tool to curate content channels aligned to your local requirements. Once you finish creating the channels on Studio, you can import them on all your Kolibri deployments for use in learning environments.
fr: Utilisez l'outil de programme d'études `Kolibri Studio <https://studio.learningequality.org/>`_ pour créer des chaînes de contenu conformes aux exigences locales vous concernant. Une fois les chaînes créées sur Studio, vous pouvez les importer sur tous vos déploiements Kolibri afin de les utiliser dans des situations d'apprentissage.

source: Bulk Downloads of Content Channels
fr: Téléchargement en masse des chaînes de contenu

source: ``Coming soon!``
fr: « Bientôt disponible ! »

source: At this time we do not support bulk downloads of content channel outside the Kolibri platform. In the near future, we will consider offering bit torrents for certain global content channels.
fr: Pour l'instant, nous ne supportons pas les téléchargements en masse de chaînes de contenu en dehors de la plateforme Kolibri. Très bientôt, nous réfléchirons à la possibilité d'offrir des bit torrents pour certaines chaînes de contenu mondiales.

source: Something isn’t working!
fr: Quelque chose ne marche pas !

source: Refer to the :ref:`Troubleshoot and Support <support>` section of this guide.
fr: Merci de vous référer à la section :ref:`Dépannage et support <support>` de ce guide.

source: Who maintains the Kolibri project?
fr: Qui maintient le projet Kolibri ?

source: Kolibri is created, maintained, and operated by `Learning Equality <https://learningequality.org/about/>`_.
fr: Kolibri est créé, maintenu et géré par `Learning Equality <https://learningequality.org/about/>`_.

source: How do you operate in the field?
fr: Quelle est votre action sur le terrain ?

source: The Learning Equality team primarily works in our San Diego offices, building software and shaping our road map based on our interactions with our partners around the world. We work with individual humanitarians and NGOs of all sizes to help them distribute Kolibri to offline communities around the world, and will work on site for research and training purposes.
fr: L'équipe de Learning Equality travaille principalement dans nos bureaux de San Diego, où elle développe des logiciels et établit une feuille de route en fonction de nos interactions avec nos partenaires du monde entier. Nous travaillons avec des activistes humanitaires individuels et des ONG de toutes tailles pour les aider à distribuer Kolibri à des communautés hors ligne dans le monde entier, et nous travaillerons sur place à des fins de recherche et de formation.

source: What is Kolibri’s affiliation with Khan Academy?
fr: Quelle est la relation entre Kolibri et la Khan Academy ?

source: Kolibri is an independent, open-source project maintained by `Learning Equality <https://learningequality.org/about/>`_, and is not officially affiliated with Khan Academy, although they are very supportive of the Kolibri project.
fr: Kolibri est un projet indépendant et open source maintenu par `Learning Equality <https://learningequality.org/about/>`_, et n'est pas officiellement affilié à la Khan Academy, bien qu'elle soit très favorable au projet Kolibri.

source: Can I contribute to Kolibri as a developer?
fr: Puis-je contribuer à Kolibri en tant que développeur ?

source: Yes! Kolibri is an `open source project <https://github.com/learningequality/>`_, and developers are encouraged to contribute!
fr: Oui ! Kolibri est un projet `open source <https://github.com/learningequality/>`_, et les développeurs sont invités à y contribuer !

source: Can I contribute to Kolibri as a translator?
fr: Puis-je contribuer à Kolibri en tant que traducteur ?

source: Yes, absolutely! To contribute to Kolibri and Kolibri Studio as a translator, you can get started over on our `translations and internationalization page <https://learningequality.org/translate/>`_.
fr: Oui, absolument ! Pour contribuer à Kolibri et à Kolibri Studio en tant que traducteur, vous pouvez vous lancer sur notre page `traductions et internationalisation <https://learningequality.org/translate/>`_.

source: How do I find out more about Learning Equality and Kolibri?
fr: Comment puis-je me renseigner davantage sur Learning Equality et Kolibri ?

source: To stay up-to-date on all our activities, follow our `blog <https://blog.learningequality.org/>`_, `Twitter <https://twitter.com/LearnEQ/>`_, and `Facebook <https://www.facebook.com/learningequality>`_!
fr: Pour rester informé de toutes nos activités, suivez notre `blog <https://blog.learningequality.org/>`_, sur `Twitter <https://twitter.com/LearnEQ/>`_, et sur `Facebook <https://www.facebook.com/learningequality>`_ !
