Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/index.po
Languages: fr

source: Kolibri User Guide
fr: Guide de l'utilisateur Kolibri

source: **Kolibri** is an open-source educational platform specially designed to provide offline access to a wide range of quality, openly licensed educational contents in low-resource contexts like rural schools, refugee camps, orphanages, and also in non-formal school programs.
fr: **Kolibri** est une plateforme éducative open source spécifiquement conçue pour permettre l'accès hors ligne à un large éventail de contenus pédagogiques de qualité libres de tous droits, dans des contextes à faibles ressources comme les écoles rurales, les camps de réfugiés, les orphelinats, ainsi que dans des environnements scolaires non formels.

source: Kolibri can serve high quality education content from several publicly available **content channels**, collections of educational resources (exercises, videos, audio or document files) and associated metadata, prepared and organized for their use in Kolibri. It works in conjunction with `Kolibri Studio <https://studio.learningequality.org>`_, the curriculum tool used to organize content and build custom content channels, aligned to the local curricula, or according to specific learning needs.
fr: Kolibri peut distribuer ces contenus éducatifs de haute qualité à partir de plusieurs **chaînes de contenus**, c'est-à-dire des collections de ressources éducatives (exercices, vidéos, fichiers audio ou documents) et leurs métadonnées accessibles au public, préparées et organisées pour leur utilisation dans Kolibri. Le logiciel fonctionne de pair avec `Kolibri Studio <https://studio.learningequality.org>`_, l'outil de programmation scolaire utilisé pour organiser le contenu et construire des chaînes de contenu sur mesure, conformes aux programmes scolaires locaux, ou à des besoins pédagogiques spécifiques.

source: Some of the publicly available learning content that you can use with Kolibri.
fr: Quelques-uns des contenus pédagogiques accessibles au public que vous pouvez utiliser avec Kolibri.

source: :ref:`Learners - start here <learn>`
fr: :ref:`Élèves - commencez ici <learn>`

source: Whether you are using Kolibri at your school, in a training center or at home, learn how to :ref:`open <access_learner>` it on your device, what kind of :ref:`content and activities <content_types>` can you work with, and how to submit :ref:`quizzes <quizzes>` created by your coaches or tutors.
fr: Que vous utilisiez Kolibri dans votre école, dans un centre de formation ou à la maison, apprenez comment l':ref:`ouvrir <access_learner>` sur votre appareil, avec quel type de :ref:`contenu et d'activités <content_types>` vous pouvez travailler, et comment répondre aux :ref:`quiz <quizzes>` créés par vos éducateurs ou tuteurs.

source: For :ref:`Coaches <coach>` using Kolibri
fr: Pour les :ref:`éducateurs <coach>` utilisant Kolibri

source: Read how to :ref:`monitor activity and track the progress <track_progress>` of your learners all the way to single answers to particular questions. Create and :ref:`manage different learner groups <manage_groups>`, :ref:`assign lessons <manage_lessons>`, administer :ref:`quizzes <manage_quizzes>` and view reports.
fr: Découvrez comment :ref:`suivre l'activité et suivre le progrès <track_progress>` de vos élèves jusqu'aux réponses individuelles à des questions spécifiques. Créez et :ref:`gérez différents groupes d'élèves <manage_groups>`, :ref:`assignez des leçons <manage_lessons>`, administrez des :ref:`quiz <manage_quizzes>` et consultez des rapports.

source: For :ref:`Admins and Super admins <manage>` of Kolibri
fr: Pour les :ref:`administrateurs et super administrateurs <manage>` de Kolibri

source: Begin by reading how to :ref:`install <install>` and :ref:`start <access>` Kolibri server on the supported platforms, and :ref:`configure other devices <access_LAN>` in the local network to access its content. Proceed on how to :ref:`import content channels <manage_content_ref>`, create and manage :ref:`users <manage_users_ref>` and :ref:`classes <manage_classes_ref>`. Configure the :ref:`settings for your facility <manage_facility_ref>`, and assign or edit :ref:`permissions <permissions>` for other users. Learn how to work with Kolibri from :ref:`the command line <command_line>`, :ref:`troubleshoot network issues <network>`, and ask for support on our :ref:`Community Forums <support>`.
fr: Commencez par découvrir comment :ref:`installer <install>` et :ref:`démarrer <access>` le serveur Kolibri sur les plateformes compatibles, et :ref:`configurer d'autres appareils <access_LAN>` du le réseau local pour qu'ils puissent accéder à son contenu. Continuez en lisant comment :ref:`importer des chaînes de contenu <manage_content_ref>`, créer et gérer des :ref:`utilisateurs <manage_users_ref>` et les :ref:`classes <manage_classes_ref>`. Configurez les paramètres de :ref:`votre établissement <manage_facility_ref>`, et assignez ou modifier les :ref:`autorisations <permissions>` des autres utilisateurs. Puis apprenez à travailler avec Kolibri à partir de la :ref:`ligne de commande <command_line>`, à :ref:`résoudre des problèmes de réseau <network>`, et à demander de l'aide sur nos :ref:`Forums communautaires <support>`.

source: Happy learning with Kolibri!
fr: Bon apprentissage sur Kolibri !
