Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/install.po
Languages: fr

source: Many people have a 4 GB or 16 GB MicroSD card that came along with the Raspberry Pi. In order to have more content, such as the full Khan Academy, you may want to attach a USB storage media -- a flash device or a hard drive.
fr: Beaucoup de gens conservent la carte MicroSD de 4 Go ou 16 Go fournie avec le Raspberry Pi. Pour accéder à davantage de contenu, tel que l'ensemble de la Khan Academy, vous pouvez utiliser un support de stockage USB -- une clé ou un disque dur.

source: Moving content: If you have a USB source for additional storage, you can use the ``kolibri manage movedirectory`` command or create your own symbolic links to have the data folder located elsewhere.
fr: Déplacer le contenu : Si vous avez une source USB de stockage supplémentaire, vous pouvez utiliser la commande ``kolibri manage movedirectory`` ou créer vos propres liens symboliques pour placer ailleurs le dossier de données.

source: **Or** using symbolic links, you need to start and stop Kolibri and to set the permissions correctly:
fr: **Ou** en utilisant des liens symboliques, vous devez démarrer et arrêter Kolibri et définir correctement les permissions :

source: Other tips
fr: Autres conseils

source: Locale warnings
fr: Avertissements relatifs aux locales

source: You may encounter warnings like ``Can't set locale; make sure $LC_* and $LANG are correct!`` while installing software about the system locale. Typically, these are missing UTF-8 locales for your chosen system locale. These can be fixed by running this from command line:
fr: Lors de l'installation du logiciel, vous pourriez rencontrer des avertissements relatifs à la locale du système tels que ``Can't set locale; make sure $LC_* and $LANG are correct!``. En général, c'est parce qu'il manque des locales UTF-8 pour la locale système choisie. Vous pouvez y remédier en exécutant ceci à partir de la ligne de commande :

source: Disabling the graphical desktop
fr: Désactivation du bureau graphique

source: Once the Pi device is deployed, the desktop environment may no longer serve a purpose. It can safely be disabled. This saves computer resources and electricity. Use the following steps to disable or enable the desktop:
fr: Une fois que l'appareil Pi est déployé, l'environnement de bureau peut ne plus avoir d'utilité. Il peut être désactivé en toute sécurité. Cela permet d'économiser les ressources informatiques et l'électricité. Suivez les étapes suivantes pour désactiver ou activer le bureau :

source: Remote access
fr: Accès à distance

source: For remote access, you should consider adding SSH (Secure Shell). Once installed and enabled, you can manage the Raspberry Pi without connecting a screen and keyboard and instead logging in from a computer connected to the device through LAN or Wi-Fi. You can use ``sudo raspi-config`` to enable the SSH system service. Read more in the `official Raspberry Pi docs <https://www.raspberrypi.org/documentation/remote-access/ssh/>`_.
fr: Pour l'accès à distance, nous recommandons le protocole SSH (Secure Shell). Une fois installé et activé, vous pouvez gérer le Raspberry Pi sans y connecter d'écran et de clavier, mais à partir d'un ordinateur connecté à l'appareil par réseau local ou Wi-Fi. Vous pouvez utiliser ``sudo raspi-config`` pour activer le service système SSH. Pour en savoir plus, consultez la `documentation officielle de Raspberry Pi <https://www.raspberrypi.org/documentation/remote-access/ssh/>`_.

source: Saving your image for replication
fr: Enregistrement de votre image pour la réplication

source: Once you like the setup and you may want to deploy several Raspberry Pis to different schools, classrooms etc.
fr: Une fois satisfait de votre configuration, vous souhaiterez peut-être déployer plusieurs Raspberry Pis dans différentes écoles, salles de classe, etc.

source: Using the same Wi-Fi SSID (in this tutorial, we called it ``Offline Library``) is recommended if you are setting up several Raspberry Pis in the same area. But you should configure them on different Wi-Fi channels. Separate them by a count of 2, this will avoid radio frequency overlaps.
fr: Il est recommandé d'utiliser le même SSID Wi-Fi (que nous avons appelé ``Offline Library`` dans ce didacticiel) si vous installez plusieurs Raspberry Pis dans la même zone. Il faudra cependant les configurer sur des canaux Wi-Fi différents. Séparez-les par un comptage de 2, cela évitera les chevauchements de fréquences radio.

source: Replicating the Kolibri device registration will make online synchronization unpredictable (fail).
fr: La réplication de l'enregistrement du dispositif Kolibri rendra la synchronisation en ligne imprévisible (échec).

source: Kolibri has a sync'ing mechanism whereby user data can synchronize from device to device through an online service. This happens automatically when Kolibri detects an internet connection. You need to unregister (deprovision) your device before copying the SD card and external storage:
fr: Le mécanisme de synchronisation de Kolibri permet la synchronisation des données utilisateurs d'un appareil à l'autre par le biais d'un service en ligne. Celle-ci s'effectue automatiquement lorsque Kolibri détecte une connexion Internet. Vous devez désenregistrer (déprovisionner) votre appareil avant de copier la carte SD et le périphérique de stockage externe :

source: After replicating your SD card and external storage device, you need re-register the Kolibri installation on each device. This can be done without removing the installed data:
fr: Après avoir répliqué votre carte SD et votre périphérique de stockage externe, vous devez réenregistrer l'installation Kolibri sur chaque appareil. Ceci peut être fait sans supprimer les données installées :

source: How many clients are supported?
fr: Combien de clients sont supportés ?

source: We recommend that you do your own benchmarking and share experiences in our `Community Forums <https://community.learningequality.org/>`_. See especially this thread about `choosing a MicroSD card <https://community.learningequality.org/t/microsd-cards-picking-the-right-one-experiences-and-benchmarks/935>`_.
fr: Nous vous recommandons de faire votre propre analyse comparative et de partager vos expériences dans nos `Forums communautaires <https://community.learningequality.org/>`_. Consultez en particulier ce fil de discussion sur le `choix d'une carte MicroSD <https://community.learningequality.org/t/microsd-cards-picking-the-right-one-experiences-and-benchmarks/935>`_.

source: It can be hard to predict how many students will be able to use Kolibri on a Raspberry Pi at the same time. A major bottleneck will be the Raspberry Pi's built-in Wi-Fi, which might support 5-10 devices in a radius confined by the limited broadcasting power of said Wi-Fi.
fr: Il peut être difficile de prédire combien d'élèves pourront utiliser Kolibri sur un Raspberry Pi au même moment. Un obstacle majeur sera le Wi-Fi intégré au Raspberry Pi, qui pourrait supporter entre 5 et 10 appareils dans un rayon limité par la puissance de diffusion restreinte dudit Wi-Fi.

source: The Wi-Fi antenna and chip in the Raspberry Pi do not have capacity for many clients. Thus, you may also want to connect a stronger Access Point. If you intend to do this, you should modify the DHCP server (dnsmasq) to listen to the ``eth0`` device instead of ``wlan0``, switching off the Wi-Fi by removing ``hostapd``.
fr: L'antenne Wi-Fi et la carte du Raspberry Pi n'ont pas la capacité de servir de nombreux clients. Par conséquent, il pourrait vous être utile de connecter un point d'accès plus puissant. Dans ce cas, modifiez le serveur DHCP (dnsmasq) pour qu'il écoute le périphérique ``eth0`` au lieu de ``wlan0``, en désactivant le Wi-Fi par la suppression de ``hostapd``.

source: A Raspberry Pi with 1 GB of RAM may support 10 clients when run behind an access point, but you will likely need a newer Raspberry Pi 4 device if you want to support more than 10 clients.
fr: Un Raspberry Pi avec 1 Go de RAM peut supporter 10 clients lorsqu'il est exécuté derrière un point d'accès, mais vous aurez probablement besoin d'un appareil Raspberry Pi 4 plus récent si vous souhaitez en supporter plus de 10.

source: Next steps
fr: Étapes suivantes

source: You may also want to install other services such as `Kiwix <https://www.kiwix.org>`_. If you have followed this tutorial, you can install Kiwix alongside Kolibri by downloading the ``kiwix-serve`` package and adding an Nginx configuration similar to :ref:`the one we added for Kolibri <nginx_custom_domain>`.
fr: Il est possible que vous souhaitiez installer d'autres services comme `Kiwix <https://www.kiwix.org>`_. Si vous avez suivi ce didacticiel, vous pouvez installer Kiwix en même temps que Kolibri en téléchargeant le paquet ``kiwix-serve`` et en ajoutant une configuration Nginx similaire à :ref:`celle que nous avons ajoutée pour Kolibri <nginx_custom_domain>`.

source: The Raspberry Pi has the advantages of being low-cost and energy efficient: You can connect it to solar power; you can also implement a good system for distributing software updates and replacement parts through SD Cards and external USB media. Not least, you can make the Raspberry Pi itself a hot-swap element in a setup, such that the whole device is collected and replaced during upgrades. We leave these steps up to you, but please feel free to share your ideas in the `Community Forum <https://community.learningequality.org/>`__.
fr: Le Raspberry Pi a l'avantage d'être peu coûteux et économe en énergie : Vous pouvez le connecter à l'énergie solaire ; vous pouvez également mettre en place un bon système de distribution de mises à jour de logiciels et de pièces de rechange par le biais de cartes SD et de supports USB externes. Vous pouvez également faire du Raspberry Pi lui-même un élément hot-swap dans un montage, de sorte que l'ensemble de l'appareil soit recueilli et remplacé lors des mises à jour. À vous de définir ces prochaines étapes, mais n'hésitez pas à partager vos idées dans notre `Forum communautaire <https://community.learningequality.org/>`__.
