Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/install.po
Languages: fr

source: Install Kolibri
fr: Installation de Kolibri

source: See the `Kolibri changelog here <https://learningequality.org/r/kolibri-changes>`_ to review specific changes in each version of Kolibri. Documentation for `previous Kolibri versions are available here <https://readthedocs.org/projects/kolibri/>`_.
fr: Accédez `ici au changelog de Kolibri <https://learningequality.org/r/kolibri-changes>`_ pour visualiser les modifications spécifiques à chaque version de Kolibri. La documentation relative aux `versions précédentes de Kolibri est disponible ici <https://readthedocs.org/projects/kolibri/>`_.

source: Hardware requirements
fr: Configuration matérielle requise

source: To install **Kolibri** on a device that will act as a server, check the hardware requirements first, and then follow the procedure for the operating system on your device.
fr: Pour installer **Kolibri** sur un appareil qui fera office de serveur, vérifiez d'abord la configuration matérielle requise, puis suivez la procédure relative au système d'exploitation de votre appareil.

source: Below you will find general recommendations regarding hardware requirements to run Kolibri. To read more detailed information and find out examples of hardware setups that have been implemented by our users, download the full `Kolibri Hardware Guide <https://learningequality.org/r/hardware-guide>`_ and examples of `Hardware Configurations for Kolibri <https://learningequality.org/r/hardware>`_ (PDF documents).
fr: Vous trouverez ci-dessous des recommandations générales concernant les exigences matérielles nécessaires au fonctionnement de Kolibri. Pour des informations plus détaillées et des exemples de configurations matérielles mises en œuvre par nos utilisateurs, téléchargez le `Guide matériel complet de Kolibri <https://learningequality.org/r/hardware-guide>`_ et des exemples de `Configurations matérielles pour Kolibri <https://learningequality.org/r/hardware>`_ (documents PDF).

source: Servers
fr: Les serveurs

source: Minimum hardware requirements to run Kolibri as a server:
fr: Configuration matérielle minimale des appareils chargés d'exécuter Kolibri en tant que serveurs :

source: 500 MB RAM (1 GB recommended on Linux, 2GB or more on Windows devices)
fr: 500 Mo de RAM (1 Go recommandé pour Linux ou 2 Go ou plus pour les appareils Windows)

source: 500 MHz CPU (1 GHz recommended)
fr: Processeur de 500 MHz (1 GHz recommandé)

source: Hard drive space depends on the size of the content channels you intend to import from `Kolibri Studio <https://studio.learningequality.org/>`_ or a local storage device.
fr: L'espace requis sur le disque dur dépend du volume des chaînes de contenu que vous avez l'intention d'importer à partir de `Kolibri Studio <https://studio.learningequality.org/>`_ ou d'un périphérique de stockage local.

source: If you have a facility with less than 30 computers, a device as simple as a `Raspberry Pi <https://www.raspberrypi.org/>`_ is known to work fine as a server.
fr: Si vous avez une installation de moins de 30 ordinateurs, un appareil aussi simple qu'un `Raspberry Pi <https://www.raspberrypi.org/>`_ est censé fonctionner parfaitement en tant que serveur.

source: Clients
fr: Les clients

source: Very old desktops and very low-power computers can be used as client devices to access Kolibri. For instance, some implementations are known to use first-gen Raspberry Pi as desktop computers.
fr: De très vieux ordinateurs de bureau et des ordinateurs à très faible consommation d'énergie peuvent être utilisés comme dispositifs clients pour accéder à Kolibri. Nous savons par exemple que la première génération de Raspberry Pi est déployée par certains comme ordinateurs de bureau.

source: It is always a good idea to do a practical test, but when you want to implement Kolibri, usually it's not necessary to scale your hardware. The main requirement is that your system needs a video card and driver that can play the videos.
fr: C'est toujours une bonne idée de faire un test pratique, mais la mise en place de Kolibri ne nécessite généralement pas le renouvellement de votre matériel. Les principales exigences sont en effet une carte vidéo et un pilote permettant à votre système de lire les vidéos.

source: Compatibility
fr: Compatibilité

source: Supported: Windows 7, 8.1 and 10, with IE 11+, Chrome or Firefox
fr: Compatible avec : Windows 7, 8.1 et 10, avec Chrome, Firefox ou la version 11+ de IE

source: **Not supported:** Windows XP cannot be used to install Kolibri server, but could potentially work as a client device if the browsers are `as up-to-date as possible <https://support.mozilla.org/en-US/questions/1173904>`_.
fr: **Non compatible :** Windows XP ne peut pas être utilisé pour installer le serveur Kolibri, mais pourrait potentiellement fonctionner sur un périphérique client si les navigateurs sont `les plus à jour possible <https://support.mozilla.org/en-US/questions/1173904>`_.

source: Install
fr: Installation

source: Download the `Windows installer <https://learningequality.org/download/>`_ for Kolibri **version 0.12**.
fr: Téléchargez l'`installateur Windows <https://learningequality.org/download/>`_ pour la **version 0.12** de Kolibri.

source: Double-click the downloaded ``.exe`` file.
fr: Double-cliquez sur le fichier ``.exe`` téléchargé.

source: Select the language for the installation.
fr: Sélectionnez la langue d'installation.

source: Python 3 installer is included, confirm the installation or the upgrade to proceed.
fr: L'installateur Python 3 y est inclus, confirmez l'installation ou la mise-à-niveau pour continuer.

source: Follow the rest of the instructions in the Kolibri installation setup wizard.
fr: Suivez le reste des instructions de l'assistant d'installation de Kolibri.

source: Once the installation finishes, Kolibri will auto-start and open in the default browser on your computer at http://127.0.0.1:8080. This may take a moment, so please be patient.
fr: Une fois l'installation terminée, Kolibri démarre automatiquement et s'ouvre dans le navigateur par défaut de votre ordinateur sur http://127.0.0.1:8080. Cela peut prendre quelques instants, donc soyez patient.

source: Proceed with the :ref:`setup_initial` of your facility.
fr: Procédez à la :ref:`setup_initial` de votre installation.

source: Windows firewall will prompt you to allow the Python process needed to run Kolibri. Click **Allow access** to accept and proceed.
fr: Le pare-feu de Windows vous demandera d'autoriser le processus Python indispensable à l'exécution de Kolibri. Cliquez sur **Autoriser l'accès** pour accepter et continuer.

source: Allow the Python process needed to run Kolibri.
fr: Autorisez le processus Python nécessaire à l'exécution de Kolibri.

source: Uninstall
fr: Désinstallation

source: Open the Windows Control Panel.
fr: Ouvrez le panneau de configuration de Windows.

source: Select **Programs and Features** option.
fr: Sélectionnez l'option **Programmes et fonctionnalités**.

source: Select Kolibri from the list of programs.
fr: Sélectionnez Kolibri dans la liste des programmes.

source: Click the button :guilabel:`Uninstall/Change` and follow the instructions.
fr: Cliquez sur le bouton :guilabel:`Désinstaller/Modifier` et suivez les instructions.

source: Upgrade
fr: Mise à jour

source: To upgrade Kolibri, follow these steps.
fr: Pour mettre Kolibri à niveau, suivez les étapes suivantes.

source: Download the new version of Kolibri `Windows installer <https://learningequality.org/download/>`_.
fr: Téléchargez la nouvelle version de `l'installateur Windows <https://learningequality.org/download/>`_ pour Kolibri.

source: Follow the instructions in the installation wizard window.
fr: Suivez les instructions dans la fenêtre de l'assistant d'installation.

source: Once the installation of the upgrade is finished, Kolibri will auto-start and open in the default browser on your computer.
fr: Une fois la mise à jour terminée, Kolibri démarrera automatiquement et s'ouvrira dans le navigateur par défaut de votre ordinateur.

source: Go explore the new and improved Kolibri features!
fr: Profitez-en pour découvrir les toutes nouvelles améliorations de Kolibri !

source: Debian 8 (Jessie), Debian 9 (Stretch), Ubuntu 16.04+ and up - anything that's *not* end-of-life. Ubuntu-based distributions count a number of flavors, for instance Xubuntu and Mint.
fr: Debian 8 (Jessie), Debian 9 (Stretch), Ubuntu 16.04+ et plus - tout ce qui *n'est pas* en fin de vie. Les distributions basées sur Ubuntu comptent un certain nombre de variantes, par exemple Xubuntu et Mint.

source: Install from PPA repository
fr: Installation à partir du dépôt PPA

source: **In Ubuntu-based distributions**, use the following commands in `Terminal <https://help.ubuntu.com/community/UsingTheTerminal>`_ to add the PPA and install Kolibri:
fr: Pour ajouter le PPA et installer Kolibri **dans les distributions basées sur Ubuntu**, utilisez les commandes suivantes dans le `Terminal <https://help.ubuntu.com/community/UsingTheTerminal>`_ :

source: **In Debian-based distributions** you need to use these commands to point to our Launchpad PPA:
fr: **Dans les distributions basées sur Debian**, il vous faudra utiliser les commandes suivantes pour pointer vers le PPA sur Launchpad :

source: From the command line: ``sudo apt-get remove kolibri``.
fr: Avec la ligne de commande : ``sudo apt-get remove kolibri``.

source: When you use the PPA installation method, upgrades to newer versions will be automatic, provided there is internet access available.
fr: Lorsque vous utilisez la méthode d'installation PPA, les mises à niveau vers des versions plus récentes seront automatiques, à condition qu'un accès Internet soit disponible.

source: Install from a .deb file
fr: Installation à partir d'un fichier .deb

source: The advantages of downloading a ``.deb`` file is the portability: you can copy the file from device to device and install Kolibri without internet access.
fr: L'avantage de télécharger un fichier ``.deb`` est celui de la portabilité : vous pouvez copier le fichier d'un appareil à l'autre et installer Kolibri sans accès à Internet.

source: Download the latest `.deb installer <https://learningequality.org/download/>`_ for Kolibri **version 0.12**, or have it copied to your local drive.
fr: Téléchargez l'`installateur .deb <https://learningequality.org/download/>`_ le plus récent pour la **version 0.12** de Kolibri , ou copiez-le sur votre disque local.

source: Run this command from the location where you downloaded the ``DEB`` file:
fr: Exécutez la commande suivante à partir de l'endroit où vous avez téléchargé le fichier ``DEB`` :

source: Wait for the installation to finish and run this command to start Kolibri:
fr: Attendez que l'installation soit terminée et lancez la commande ci-dessous pour démarrer Kolibri :

source: If you choose to install Kolibri as a system service, you will not need to start it manually.
fr: Si vous choisissez d'installer Kolibri comme un service système, il ne sera pas nécessaire de le démarrer manuellement.

source: When the command finishes, open the default browser at http://127.0.0.1:8080 and proceed with the :ref:`setup_initial` of your facility.
fr: Une fois la commande terminée, ouvrez le navigateur par défaut à http://127.0.0.1:8080 et procédez à la :ref:`setup_initial` de votre installation.

source: Open **Software** on Ubuntu and locate the Kolibri. Press **Remove**.
fr: Ouvrez **Logiciel** sur Ubuntu et localisez Kolibri. Appuyez sur **Supprimer**.

source: Or from the command line: ``sudo apt-get remove kolibri``.
fr: Ou utilisez la ligne de commande: ``sudo apt-get remove kolibri``.

source: To upgrade Kolibri on a Debian device without internet access, bring the updated ``.deb`` file and follow the same steps as in :ref:`lin_deb`.
fr: Pour mettre Kolibri à niveau sur un dispositif Debian sans accès à Internet, munissez-vous du dernier fichier ``.deb`` et suivez les mêmes étapes que pour l':ref:`lin_deb`.

source: Changing the owner of Kolibri system service
fr: Changement du propriétaire du service système Kolibri

source: The *system service* is the script that runs Kolibri in the background when your system boots on Debian-based distributions.
fr: Le *service système* est le script qui lance Kolibri en arrière-plan lorsque votre système démarre sur des distributions basées sur Debian.

source: You may need to change the system service to run with the permissions of a different user account. Prior to v0.10, ``kolibri`` user account was the owner of the system service, while from v0.10 and later, desktop user's account is preferred, in order for Kolibri to access the local USB storage.
fr: Vous devrez peut-être modifier le service système pour qu'il s'exécute avec les autorisations d'un autre compte utilisateur. Avant la version 0.10, le compte utilisateur ``kolibri`` était le propriétaire du service système. À partir de la version 0.10 en revanche, c'est le compte de l'utilisateur du bureau qui est privilégié, afin que Kolibri puisse accéder au stockage USB local.

source: To change the system service owner, you need to change the configuration of the system service: move the ``.kolibri`` data folder (containing channels, databases etc.), and assign owner permissions to the new user. Follow these steps.
fr: Pour changer le propriétaire du service système, il est nécessaire de modifier la configuration du service système en déplaçant le dossier de données ``.kolibri`` (contenant les chaînes, les bases de données etc.), et en attribuant au nouvel utilisateur les permissions du propriétaire. Pour ce faire, suivez les étapes suivantes.

source: Replace the ``$USER`` in commands above with the name of the user you wish to be the new Kolibri system service owner.
fr: Remplacez le ``$USER`` des commandes ci-dessus par le nom de l'utilisateur que vous voulez désigner nouveau propriétaire du service système Kolibri.

source: Higher Performance with the ``kolibri-server`` package
fr: De meilleures performances avec le paquet ``kolibri-server``

source: We have of a higher-performance wrapper around the ``kolibri`` package for Ubuntu and Debian systems called ``kolibri-server``.
fr: Nous proposons un wrapper plus performant autour du paquet ``kolibri`` pour les systèmes Ubuntu et Debian appelé ``kolibri-server``.

source: ``kolibri-server`` has some specific features like **static content cache** and **optimized usage of the CPU processing power** in multi core devices. For example, a *Raspberry Pi 3+* device has 4 CPU cores, and with ``kolibri-server`` it will likely be able to serve 2-3 times more client devices compared to base Kolibri.
fr: Le ``kolibri-server`` présente des caractéristiques spécifiques comme un **cache de contenu statique** et une **utilisation optimisée de la puissance de traitement du processeur** pour les appareils multi-cœurs. Par exemple, un appareil *Raspberry Pi 3+* possède 4 cœurs de processeur, et avec ``kolibri-server`` il pourra probablement servir de 2 à 3 fois plus d'appareils clients par rapport au paquet Kolibri de base.

source: To install ``kolibri-server`` follow these steps.
fr: Pour installer ``kolibri-server``, suivez les étapes suivantes.

source: Run these commands in the Terminal:
fr: Exécutez les commandes suivantes dans le Terminal :

source: During the installation you will be offered the option to choose the port (8000, 80 or leave the default 8080).
fr: Pendant l'installation, vous aurez la possibilité de choisir le port (8000, 80 ou garder 8080 par défaut).

source: Restart the system.
fr: Redémarrez le système.

source: Keep in mind that the ``kolibri-server`` system performance will depend not only on server device features, but on local Wi-Fi access point characteristics.
fr: N'oubliez pas que les performances du système ``kolibri-server`` ne dépendent pas seulement des fonctionnalités des appareils serveurs, mais aussi de celles du point d'accès Wi-Fi local.

source: Kolibri is tested to work on Raspberry Pi Models **3, 3+, 4 and Zero W**. For installation instructions, please refer to our :ref:`Raspberry Pi Tutorial for Kolibri <tutorial_rpi>`.
fr: Le fonctionnement de Kolibri est éprouvé sur les modèles Raspberry Pi **3, 3+, 4 et Zero W**. Pour les instructions d'installation, veuillez vous référer à notre :ref:`Didacticiel Raspberry Pi pour Kolibri <tutorial_rpi>`.

source: Kolibri may also run on Raspberry Pi Model 2, but the above tutorial was not fully intended for that model, since it does not have onboard Wi-Fi.
fr: Bien que Kolibri puisse aussi fonctionner avec le modèle 2 de Raspberry Pi, le didacticiel mentionné ci-dessus ne lui est pas entièrement destiné, car il n'a pas de Wi-Fi intégré.

source: Other Linux & MacOS
fr: Autres Linux & MacOS

source: MacOS: 10.6+, all browsers supported
fr: MacOS : 10.6+, compatible avec tous les navigateurs

source: Linux: Any system with Python 2.7, all browsers supported
fr: Linux : n'importe quel système avec Python 2.7, compatible avec tous les navigateurs

source: To install Kolibri on Linux distributions other than Debian, as well as on MacOS, you can use :ref:`generic installation <pip-installation>` with ``pip install`` command, or follow these steps to run Kolibri with the ``PEX`` package.
fr: Pour installer Kolibri sur des distributions Linux autres que Debian, ainsi que sur MacOS, vous pouvez effectuer une :ref:`installation générique <pip-installation>` à l'aide de la commande ``pip install``, ou suivre les étapes suivantes pour lancer Kolibri avec le paquet ``PEX``.

source: Download the `PEX installer <https://learningequality.org/download/>`_ for Kolibri **version 0.12**.
fr: Téléchargez l'`installateur PEX <https://learningequality.org/download/>`_ pour la **version 0.12** de Kolibri.

source: Make sure to **open the Terminal where you downloaded** the ``PEX`` file. For example, if you saved it in the *Downloads* folder, type this when you open the Terminal, and press Enter:
fr: Assurez-vous d'**ouvrir le Terminal dans lequel vous avez téléchargé** le fichier ``PEX``. Par exemple, si vous l'avez enregistré dans le dossier *Téléchargements*, tapez la commande suivante lorsque vous ouvrez le Terminal, et appuyez sur Entrée :

source: Type the following commands next (press Enter after each one).
fr: Saisissez ensuite les commandes suivantes (appuyez sur la touche Entrée après chacune d'elles).

source: Make sure to **substitute the** ``kolibri-installer-filename.pex`` **with the exact name of the file you downloaded** in both commands. For example, if the name of the downloaded file is ``kolibri-v0.12.0.pex``, type that instead of ``kolibri-installer-filename.pex``.
fr: Assurez-vous de **remplacer** ``kolibri-installer-filename.pex`` **avec le nom exact du fichier que vous avez téléchargé** dans les deux commandes. Par exemple, si le fichier téléchargé s'intitule ``kolibri-v0.12.0.pex``, saisissez ce nom au lieu de ``kolibri-installer-filename.pex``.

source: Remember that **PEX** package allows you to run Kolibri on your system **only while the process is active in the Terminal window**. If that process is stopped (by either pressing :guilabel:`Ctrl` + :guilabel:`C`, closing the Terminal, or restarting your system), you will need to repeat the above steps to start Kolibri again. User accounts, classes and groups you create, as well as the content channels you download, will be available every time you restart Kolibri.
fr: N'oubliez pas que le paquet **PEX** vous permet d'exécuter Kolibri sur votre système **seulement lorsque le processus est actif dans la fenêtre du Terminal**. Si vous arrêtez ce processus (soit en appuyant sur :guilabel:`Ctrl` + :guilabel:`C`, soit en fermant le Terminal, soit en redémarrant votre système), il vous faudra répéter les étapes ci-dessus pour relancer Kolibri. Les comptes utilisateurs, les classes et les groupes que vous créez, ainsi que les chaînes de contenu que vous téléchargez, seront disponibles à chaque fois que vous redémarrerez Kolibri.

source: Delete the ``PEX`` file.
fr: Supprimez le fichier ``PEX``.

source: Delete the ``./kolibri`` folder in your user's Home directory if you want to completely remove all the Kolibri files and content channels you imported.
fr: Supprimez le dossier ``./kolibri`` dans le répertoire personnel de votre utilisateur si vous voulez supprimer complètement tous les fichiers Kolibri et les chaines de contenu que vous avez importées.

source: Download the new version of `Kolibri PEX installer <https://learningequality.org/download/>`_.
fr: Téléchargez la nouvelle version de l'`installateur PEX <https://learningequality.org/download/>`_ pour Kolibri.

source: Start Kolibri as during the first install.
fr: Démarrez Kolibri comme lors de la première installation.

source: Python pip package
fr: Paquet Python

source: You can install Kolibri as a standard package from PyPi (works on Mac, Windows, and Linux) using this command::
fr: Vous pouvez installer Kolibri comme un paquet standard venant de PyPi (fonctionne sur Mac, Windows, et Linux) avec pip en utilisant cette commande :

source: Initial Setup
fr: Configuration initiale

source: To do the initial setup of your Kolibri facility after the installation, follow these steps.
fr: Pour effectuer la configuration initiale de votre système Kolibri après l'installation, suivez les étapes suivantes.

source: You need to do the initial setup only once, the first time you start Kolibri after the installation. You can change all the settings later, *except the type and the name of the facility*.
fr: Vous ne devez effectuer la configuration initiale qu'une seule fois, la première fois que vous démarrez Kolibri après l'installation. Tous les paramètres, *à l'exception du type et du nom de l'institut*, sont modifiables ultérieurement.

source: **Select the default language for Kolibri.**
fr: **Sélection de la langue par défaut de Kolibri.**

source: Select the default Kolibri language.
fr: Sélectionnez la langue par défaut de Kolibri.

source: The default language configured for content in your browser preferences might override the language you choose in this step. To ensure that Kolibri displays in the desired language, make sure to configure it as default in the browsers of all the devices that will be used to view Kolibri content.
fr: La langue par défaut indiquée dans les préférences de votre navigateur peut l'emporter sur la langue choisie à cette étape. Pour que Kolibri s'affiche bien dans la langue souhaitée, assurez-vous de la sélectionner comme langue par défaut dans les navigateurs de tous les appareils qui seront utilisés pour accéder au contenu de Kolibri.

source: **Facility name and type.** A "Facility" is the location where you are installing Kolibri, such as a school, training center, or even your home.
fr: **Nom et type d'établissement .** Un "établissement" est l'endroit où vous installez Kolibri, tels qu'une école, un centre de formation ou même votre maison.

source: **Non-formal** type can be used in libraries, orphanages, correctional facilities, youth centers, computer labs and similar, **Formal** one in schools and other formal learning contexts, and **Personal** should work best for parent-child or supplementary individual learning.
fr: Le type **Non formel** s'applique aux bibliothèques, orphelinats, établissements pénitentiaires, centres de jeunesse, laboratoires informatiques et similaires, le type **Formel** aux écoles et autres environnements d'apprentissage formel, tandis que le type **Personnel** convient à l'apprentissage parent-enfant ou individuel complémentaire.

source: Formal and non-formal facilities require a name, while personal ones do not.
fr: Les instituts formels et non formels doivent être obligatoirement nommés, ce qui n'est pas le cas des instituts personnels.
