Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/install.po
Languages: fr

source: This guide provides a step-by-step setup of Kolibri but does not try to explain basic concepts for your Raspberry Pi. If you are new to the system, you are encouraged to read the official `Getting Started <https://projects.raspberrypi.org/en/projects/raspberry-pi-getting-started>`__ guide for basic knowledge about setting up your device.
fr: Ce guide détaille comment configurer Kolibri étape par étape, mais n'explique pas les concepts de base à propos de votre Raspberry Pi. Si vous débutez sur ce système, nous vous encourageons à lire le guide officiel `Premiers pas avec le Raspberry Pi <https://projects.raspberrypi.org/fr-FR/projects/raspberry-pi-getting-started>`__ pour acquérir les connaissances de base sur la configuration de votre appareil.

source: In doubt about which Raspbian to choose? We recommend using Raspbian Lite if you are comfortable with an environment that only has a terminal and no graphical user interface. Using the desktop version will consume more CPU, memory and electricity. Finally, you do have the option to :ref:`switch off the desktop environment <rpi_tip_desktop_disable>` once you have finished setting up the device.
fr: Vous ne savez pas quel Raspbian choisir ? Nous vous recommandons d'opter pour Raspbian Lite si vous êtes à l'aise avec un environnement qui ne dispose que d'un terminal et d'aucune interface d'utilisateur graphique. La version de bureau sollicite davantage le processeur, et consomme plus de mémoire et d'électricité. Sachez en outre qu'il est possible de :ref:`désactiver l'environnement de bureau <rpi_tip_desktop_disable>` une fois la configuration de l'appareil terminée.

source: We install Kolibri as one of the very final step. But please read and complete the prior steps.
fr: L'installation de Kolibri est l'une des toutes dernières étapes. Assurez-vous de bien lire et compléter les étapes précédentes.

source: Setting up the SD card
fr: Configuration de la carte SD

source: The following commands work on Linux/macOS for setting up the .img files provided. You will also need to know the *device node* for the SD Card reader. On Linux, this is typically ``/dev/mmcblk0`` for the 0th card in your card reader.
fr: Les commandes suivantes fonctionnent sous Linux/macOS pour configurer les fichiers .img mis à disposition. Vous devrez également connaître le **nœud de périphérique** pour le lecteur de carte SD. Sous Linux, c'est typiquement ``/dev/mmcblk0`` pour la 0ème carte de votre lecteur de carte.

source: Read the official guides for setting up your card: `Copying .img files <https://www.raspberrypi.org/documentation/installation/installing-images/>`__
fr: Lisez les guides officiels pour la mise en place de votre carte : `Copier des fichiers .img <https://www.raspberrypi.org/documentation/installation/installing-images/>`__

source: Select your MicroSD card based on other people's experiences and technical benchmarks. For more information, read `this Community Forums thread <https://community.learningequality.org/t/microsd-cards-picking-the-right-one-experiences-and-benchmarks/935>`__.
fr: Choisissez votre carte MicroSD en fonction de l'expérience d'autres personnes et des références techniques. Pour plus d'informations, consultez ce `thread sur notre Forum communautaire <https://community.learningequality.org/t/microsd-cards-picking-the-right-one-experiences-and-benchmarks/935>`__.

source: Updating the software
fr: Mise à jour du logiciel

source: After installing and starting up your Raspberry Pi, it is recommended that you upgrade all the software on the device:
fr: Après avoir installé et démarré votre Raspberry Pi, il est recommandé de mettre à jour tous les logiciels de l'appareil :

source: Updating the firmware
fr: Mise à jour du micrologiciel

source: Run ``sudo rpi-update`` to update the firmware. Nothing in this tutorial necessitates this, but it's always recommended because hardware issues may be solved over time and performance improved. You cannot replicate this by copying MicroSD cards, you would have to repeat this step for every new Raspberry Pi device that you are installing.
fr: Exécutez la commande "sudo rpi-update" pour mettre à jour le micrologiciel. Cette opération n'est nécessaire à aucune des étapes de ce didacticiel, mais est toujours recommandée car les problèmes matériels peuvent être résolus avec le temps et les performances améliorées. Il est impossible d'y procéder en copiant des cartes MicroSD, il vous faudra donc répéter l'opération pour chaque nouveau périphérique Raspberry Pi que vous installez.

source: General system configuration
fr: Configuration générale du système

source: Run ``sudo raspi-config`` for the general setup options such as password change, keyboard layout, timezone etc.
fr: Lancez ``sudo raspi-config`` pour accéder aux options de configuration générales telles que le changement de mot de passe, la disposition du clavier, le fuseau horaire, etc.

source: Always change your password after setting up device. The default password for the user ``pi`` is ``raspberry``.
fr: Changez toujours votre mot de passe après avoir configuré l'appareil. Le mot de passe par défaut pour l'utilisateur ``pi`` est ``raspberry`` .

source: Setting up a hotspot
fr: Configuration d'un hotspot

source: Raspberry Pi 3 and 4 have an internal Wi-Fi adapter which can serve as an access point, thus giving other devices the ability to connect to the Raspberry Pi through Wi-Fi. In this case, we call the Raspberry Pi a *hotspot*.
fr: Les Raspberry Pis 3 et 4 ont un adaptateur Wi-Fi interne qui peut servir de point d'accès, donnant ainsi à d'autres appareils la possibilité de se connecter au Raspberry Pi par Wi-Fi. Dans ce cas, nous appelons le Raspberry Pi un *hotspot*.

source: We assume that you will need to connect the Raspberry Pi to the internet both before and after setting up the hotspot. The easiest way to achieve this is through the Raspberry Pi's Ethernet cable connection. In this way, you don't have to disable and enable the Wi-Fi configuration each time.
fr: Nous supposons que vous aurez besoin de connecter le Raspberry Pi à Internet avant et après la configuration du hotspot. La façon la plus simple d'y parvenir est de connecter le Raspberry Pi par câble Ethernet. De cette façon, il ne sera pas nécessaire de désactiver et d'activer la configuration Wi-Fi à chaque fois.

source: The device can be set up such that it automatically uses the Ethernet interface as a *gateway* to the internet when a cable is connected.
fr: L'appareil peut être configuré de telle sorte qu'il utilise automatiquement l'interface Ethernet comme une *passerelle* vers Internet lorsqu'un câble est connecté.

source: If you need to connect to the internet through Wi-Fi, you will have to disable the hotspot and connect through the normal network management.
fr: Si vous avez besoin d'accéder à Internet via le Wi-Fi, vous devrez désactiver le hotspot et vous connecter via les outils standards de gestion du réseau.

source: Installing hostapd and dnsmasq
fr: Installation de hostapd et dnsmasq

source: In order to serve clients on a local Wi-Fi hotspot, you need the Raspberry Pi to act as:
fr: Pour servir des clients sur un hotspot Wi-Fi local, il faut que le Raspberry Pi fonctionne comme :

source: an access point
fr: un point d'accès

source: a DHCP server
fr: un serveur DHCP

source: a DNS server
fr: un serveur DNS

source: The access point is handled by the package ``hostapd`` and the DHCP and DNS server are both available through the ``dnsmasq`` package. We will install and configure both in this section. For more detailed information, see `the online Raspberry Pi docs <https://www.raspberrypi.org/documentation/configuration/wireless/access-point.md>`__.
fr: Le point d'accès est géré par le paquet ``hostapd``,tandis que les serveurs DHCP et DNS sont inclus dans le paquet ``dnsmasq``. Cette section explique comment les installer et les configurer tous les deux. Pour des informations plus détaillées, référez-vous à `la documentation en ligne sur Raspberry Pi <https://www.raspberrypi.org/documentation/configuration/wireless/access-point.md>`__.

source: Setting a static IP
fr: Configuration d'une IP statique

source: Firstly, the server's Wi-Fi interface ``wlan0`` needs to have a predictable IP address and not try to obtain it from another server. We call this a *static IP*.
fr: Tout d'abord, l'interface Wi-Fi du serveur ``wlan0`` doit avoir une adresse IP constante et ne pas essayer de l'obtenir d'un autre serveur. C'est ce que l'on appelle une *IP statique*.

source: It is defined in the configuration file ``/etc/dhcpcd.conf``, which you can edit through the below command.
fr: Elle est définie dans le fichier de configuration ``/etc/dhcpcd.conf``, que vous pouvez éditer avec la commande ci-dessous.

source: Use the arrow keys to navigate to the end of the file, then copy and paste the following text and press :guilabel:`CTRL` + :guilabel:`X` to save and exit. This configuration sets ``192.168.4.1`` as the IP address of the server on the configured Wi-Fi network. If you want to change this, you will have to be aware of other consequential changes necessary in the remaining part of this tutorial.
fr: Utilisez les flèches pour naviguer jusqu'à la fin du fichier, puis copiez et collez le texte suivant et appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour enregistrer et quitter. Dans cette configuration, l'adresse IP du serveur sur le réseai Wi-Fi est ``192.168.4.1``. Si vous voulez la modifier, sachez que d'autres modifications conséquentes détaillées dans la suite de ce didacticiel seront nécessaires.

source: After installing the new ``hostapd`` and ``dnsmasq`` packages and setting a static IP, you should reboot the system.
fr: Après avoir installé les nouveaux paquets ``hostapd`` et ``dnsmasq`` et configuré une IP statique, redémarrez le système.

source: Configure DHCP and DNS
fr: Configuration des services DHCP et DNS

source: We create a new configuration file for ``dnsmasq`` in the appropriate location and start editing it:
fr: Commencez par créer un nouveau fichier de configuration pour ``dnsmasq`` à l'endroit approprié et par l'éditer :

source: Copy and paste the following text, then press :guilabel:`CTRL` + :guilabel:`X` to save and exit.
fr: Copiez et collez le texte suivant, puis appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour enregistrer et quitter.

source: Next, we need to make sure dnsmasq doesn't interfere with local DNS requests made from the Pi:
fr: Ensuite, assurez-vous que dnsmasq n'interfère pas avec les requêtes DNS locales faites à partir du Pi :

source: Copy and paste the following text at the end of the file, then press :guilabel:`CTRL` + :guilabel:`X` to save and exit.
fr: Copiez et collez le texte suivant à la fin du fichier, puis appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour enregistrer et quitter.

source: Configure the access point
fr: Configuration du point d'accès

source: This will activate a new network configuration and override the possibility to connect to an online source using the Wi-Fi. Connecting to the internet remains possible **through the cabled network**. The tutorial has a few steps left that require connectivity for downloading and setting up Nginx and Kolibri. If the Pi is online through the Wi-Fi, do not reboot the device or execute the ``systemctl`` commands found at the end of this section until at the very end of the tutorial. You should also download and install all necessary software and Kolibri channels.
fr: Cela activera une nouvelle configuration réseau et annulera la possibilité de se connecter à une source en ligne en utilisant le Wi-Fi. La connexion à internet reste possible **par le réseau câblé**. Ce didacticiel comporte encore quelques étapes qui nécessitent une connectivité pour le téléchargement et la configuration de Nginx et Kolibri. Si le Pi est en ligne via le Wi-Fi, ne redémarrez pas l'appareil et n'exécutez pas les commandes ``systemctl`` qui se trouvent à la fin de cette section avant la toute fin du didacticiel. Vous devriez également télécharger et installer tous les logiciels et toutes les chaînes Kolibri nécessaires.

source: We recommend connecting the device to an internet connection through cable (ethernet), such that you have a reliable way of downloading content and software at all times.
fr: Nous recommandons de connecter l'appareil à Internet par câble (Ethernet), afin que vous puissiez télécharger des contenus et des logiciels de manière fiable à tout moment.

source: You will need to write a configuration file with information about your local Wi-Fi network.
fr: Il vous faudra écrire un fichier de configuration avec des informations concernant votre réseau Wi-Fi local.

source: In the file, copy in the following configuration to specify the name of the network, its Wi-Fi channel (frequency) and bandwidth mode (we recommend 2.4 GHz 'g' mode). Set ``hw_mode=a`` to use 5 GHz. Press :guilabel:`CTRL` + :guilabel:`X` to save and exit.
fr: Dans le fichier, copiez-collez la configuration suivante pour spécifier le nom du réseau, son canal Wi-Fi (fréquence) et le mode de bande passante (nous recommandons le mode 'g' à 2,4 GHz). Pour utiliser 5 GHz, indiquez ``hw_mode=a``. Appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour enregistrer et quitter.

source: Next, edit ``/etc/default/hostapd`` to enable the configuration file that we have just written:
fr: Ensuite, éditez ``/etc/default/hostapd`` pour activer le fichier de configuration que vous venez d'écrire :

source: At the bottom of the file, add the following text and press :guilabel:`CTRL` + :guilabel:`X` to exit and save.
fr: En bas du fichier, ajoutez le texte suivant et appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour quitter et enregistrer.

source: Finally, start the access point system service ``hostapd`` and the DHCP and DNS server ``dnsmasq``:
fr: Enfin, démarrez le système service de points d'accès ``hostapd`` et le serveur DHCP et DNS ``dnsmasq`` :

source: Setting up a "Captive portal"
fr: Établir un « portail captif »

source: You don't have to set up a "Captive Portal", but it's a good idea, since the behavior will make the user experience better. Users won't have to guess the location (hostname / domain) of services on the Raspberry Pi, and many devices support displaying your welcome page automatically upon connecting to the Wi-Fi.
fr: Il n'est pas nécessaire de mettre en place un « portail captif », mais c'est une bonne idée, puisque son fonctionnement améliorera l'expérience des utilisateurs, qui n'auront pas à deviner l'emplacement (nom d'hôte / domaine) des services sur le Raspberry Pi. En outre, de nombreux appareils supportent l'affichage automatique de votre page d'accueil lors de la connexion au Wi-Fi.

source: This type of dialog will appear on many devices when they detect a successful Wi-Fi connection without an internet connection.
fr: Des boîtes de dialogue de ce type apparaîtront sur de nombreux appareils lorsqu'ils détecteront une connexion Wi-Fi efficace sans connexion Internet.

source: In the previous step, we have configured the Raspberry Pi to tell devices on the local offline hotspot that whatever resource they request such as ``http://domain.com``, it should resolve to the Raspberry Pi's static IP address ``192.168.4.1``.
fr: À l'étape précédente, nous avons configuré le Raspberry Pi pour indiquer aux appareils sur le hotspot local hors ligne que toute ressource qu'ils demandent, telle que ``http://domain.com``, doit se résoudre à l'adresse IP statique du Raspberry Pi ``192.168.4.1``.

source: Firstly, install the HTTP server nginx:
fr: Tout d'abord, installez le serveur HTTP nginx :

source: Then, you need to edit and adapt your default Captive Portal page. You can use :download:`this template </data/captive_portal_index.html>` (displayed in the previous screenshot). Copy-paste the contents of the template by editing ``/var/www/html/index.html``:
fr: Ensuite, il vous faudra modifier et adapter votre page de portail captif par défaut. Vous pouvez utiliser :download:`ce modèle </data/captive_portal_index.html>` (affiché dans la capture d'écran précédente). Copiez-collez le contenu du template en éditant ``/var/www/html/index.html``:

source: You can use :guilabel:`CTRL` + :guilabel:`SHIFT` + :guilabel:`V` to paste text in the terminal. Press :guilabel:`CTRL` + :guilabel:`X` to exit and save.
fr: Vous pouvez utiliser :guilabel:`CTRL` + :guilabel:`MAJ` + :guilabel:`V` pour coller du texte dans le terminal. Appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour quitter et enregistrer.

source: Installing Kolibri
fr: Installation de Kolibri

source: First we need to upgrade the ``python3-cffi`` library, which is outdated on Raspbian. Upgrade it like this:
fr: Tout d'abord, il faut mettre à niveau la bibliothèque ``python3-cffi``, car elle est obsolète sur Raspbian. Mettez-la à jour comme ceci :

source: Add our Ubuntu PPA with these special instructions:
fr: Ajoutez notre PPA Ubuntu avec ces instructions spéciales :

source: Install ``kolibri`` and ``kolibri-server``:
fr: Installez ``kolibri`` et ``kolibri-server`` :

source: During the installation, make the following choices if prompted: Use the default TCP port ``8080`` for Kolibri because port ``80`` will be used by Nginx :ref:`later in this tutorial <nginx_custom_domain>`. Enable the Kolibri system service by selecting ``Yes`` when prompted to run Kolibri on start-up. Use the default ``pi`` user so that it will have access to USB devices.
fr: Pendant l'installation, faites les choix suivants si vous y êtes invité : Utilisez le port TCP par défaut ``8080`` pour Kolibri car le port ``80`` sera utilisé par Nginx :ref:`plus tard dans ce didacticiel <nginx_custom_domain>`. Activez le service système Kolibri en sélectionnant ``Yes`` lorsque vous êtes invité à lancer Kolibri au démarrage. Utilisez l'utilisateur par défaut ``pi`` pour qu'il ait accès aux périphériques USB.

source: The regular Kolibri system service will run background tasks, but its HTTP server is disabled, as all this is handled by the Nginx and UWSGI configuration.
fr: Le service normal du système Kolibri exécutera des tâches en arrière-plan, mais son serveur HTTP est désactivé, car tout cela est géré par la configuration Nginx et UWSGI.

source: The following issues are quite common on a Raspberry Pi:
fr: Les problèmes suivants sont assez courants avec les Raspberry Pi :

source: **System time** isn't set properly or resets during power-off. This causes errors while downloading software. For instance, SSL certificates for online sources will fail to validate. Ensure that you have the right timezone in ``/etc/timezone`` and that the clock is set properly by running ``sudo ntpd -gq``.
fr: **L'heure du système** n'est pas réglée correctement ou se réinitialise lors qu'on l'éteint. Cela entraîne des erreurs lors du téléchargement du logiciel. Par exemple, les certificats SSL pour les sources en ligne ne seront pas validés. Assurez-vous que le bon fuseau horaire figure bien dans ``/etc/fuseau horaire`` et que l'horloge est correctement réglée en exécutant ``sudo ntpd -gq``.

source: **Storage space** is often scarce. If you have a USB source for additional storage, you can use the ``kolibri manage movedirectory`` command or create your own symbolic links to have the data folder located elsewhere.
fr: **L'espace de stockage** est souvent limité. Si vous avez une source de stockage USB supplémentaire, vous pouvez utiliser la commande ``kolibri manage movedirectory`` ou créer vos propres liens symboliques pour stocker ailleurs le dossier de données.

source: Using the built-in management command:
fr: Avec la fonction de gestion intégrée :

source: **I/O operations are slow**: This means that a typical bottleneck on a Raspberry Pi is file transfer to/from MicroSD card or USB attached storage. Once Kolibri is up and running, this will not be a bottleneck, but while copying initial contents of several gigabytes, you will experience this. Both the SD card reader and the USB ports will limit you at 50-80MB/sec. From our experience, it doesn't matter much whether you are using the main SD card reader for storage or some media connected to your USB, as in principle they both reach about the same maximum speeds. However, you may find significant differences in the speeds of individual SD Cards.
fr: **Les opérations d'E/S sont lentes**: Typiquement, le transfert de fichiers de/vers une carte MicroSD ou un périphérique de stockage USB sur un Raspberry Pi forme un goulot d'étrangement. Une fois Kolibri opérationnel, ce ne sera plus le cas, mais vous en ferez l'expérience lorsque vous copierez le contenu initial de plusieurs gigaoctets. Tant le lecteur de carte SD que les ports USB vous limiteront à 50-80Mo/sec. D'après notre expérience, il importe peu que vous utilisiez le lecteur de carte SD principal pour le stockage ou d'autres médias connectés à votre port USB, car en principe, ils atteignent tous deux à peu près la même vitesse maximale. Cependant, vous constaterez peut-être des différences significatives dans la vitesse de chaque carte SD.

source: When replicating installations, you can save time if you connect the SD card of USB storage to another device with faster transfer speeds. Replication will be described in future guides.
fr: Lors de la réplication d'installations, vous pouvez gagner du temps en connectant la carte SD ou le périphérique de stockage USB à un autre appareil à plus grande vitesse de transfert. Le processus de réplication sera décrit dans un guide à venir.

source: Set up Kolibri local domain
fr: Configuration du domaine local Kolibri

source: After completing the installation, you can make kolibri available on port ``:80`` in addition to ``:8080``. This will make it possible to type, for example, a domain ``kolibri.library`` in the browser location bar, and because of our captive portal, it will display.
fr: Une fois l'installation terminée, vous pouvez rendre kolibri disponible au port ``:80``, en plus du port ``:8080``. Cela permettra de saisir, par exemple, un domaine ``kolibri.library`` dans la barre de localisation du navigateur, qui s'affichera grâce au portail captif.

source: To enable your Nginx web server to serve Kolibri, edit ``/etc/nginx/sites-available/kolibri`` and add a so-called *virtual host*:
fr: Pour activer votre serveur web Nginx pour servir Kolibri, éditez ``/etc/nginx/sites-available/kolibri`` et ajoutez un *hôte virtuel*:

source: You can use another domain name instead of ``kolibri.library``. This is configured in the below configuration.
fr: Vous pouvez utiliser un autre nom de domaine au lieu de ``kolibri.library``. C'est le nom utilisé dans la configuration ci-dessous.

source: Copy and paste the following into the configuration file:
fr: Copiez et collez les éléments suivants dans le fichier de configuration :

source: Press :guilabel:`CTRL` + :guilabel:`X` to exit and save. Then enable the new configuration by linking it into the directory of enabled virtual hosts:
fr: Appuyez sur :guilabel:`CTRL` + :guilabel:`X` pour quitter et enregistrer. Activez ensuite la nouvelle configuration en la reliant au répertoire des hôtes virtuels activés :

source: Finally, reload Nginx for the new site to be available:
fr: Enfin, rechargez Nginx pour que le nouveau site soit disponible :

source: Attaching USB storage
fr: Rattachement d'un support de stockage USB
