Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/install.po
Languages: fr

source: Choose the type of facility.
fr: Choisissez le type d'institut.

source: **Guest access.**
fr: **Accès d'invités.**

source: Select if guests can access Kolibri content without the need to create an account.
fr: Choisissez d'autoriser ou non l'accès au contenu de Kolibri sans compte utilisateur.

source: **User account creation.**
fr: **Création de comptes utilisateurs.**

source: Select if anyone can create a user account for themselves, or if user accounts must be created by Kolibri admins.
fr: Choisissez soit de permettre à quiconque de créer son propre compte utilisateur, soit de confier la création des comptes utilisateurs aux administrateurs de Kolibri uniquement.

source: **Enable passwords for learners.** Simplified sign-in, without the password requirement, allows easier access for younger learners.
fr: **Activation des mots de passe pour les élèves.** Une connexion simplifiée, sans mot de passe, permet un accès plus facile pour les plus jeunes élèves.

source: Select if learners must type in their passwords to sign-in to Kolibri.
fr: Déterminez si les élèves doivent saisir un mot de passe pour se connecter à Kolibri.

source: **Create super admin account.** This admin user will be a **super admin**, able to manage all the device content, and all the rest of the facility users and their permissions.
fr: **Création d'un compte super administrateur.** Cet utilisateur admin sera un **super administrateur**, capable de gérer tout le contenu de l'appareil, et tous les autres utilisateurs de l'institut et leurs permissions.

source: Select the username and password for the facility super admin.
fr: Sélectionnez le nom d'utilisateur et le mot de passe du super administrateur de l'institut.

source: Make sure to save these super admin credentials in a safe place!
fr: Assurez-vous de bien enregistrer les identifiants du super administrateur dans un endroit sécurisé !

source: **Data usage and privacy - responsibilities of the administrator.** When you are setting up a Kolibri facility, especially in formal contexts, you need to take into consideration the relevant privacy laws and regulations. You as the **super admin**, or someone you delegate, will be responsible for protecting and managing the user accounts and personal information stored on the device. Review the data usage and privacy statement before finishing the facility setup.
fr: **Utilisation et confidentialité des données - les responsabilités de l'administrateur.** Lors de la mise en place d'un système Kolibri, en particulier dans un contexte formel, il est impératif de prendre en compte les lois et réglementations applicables en matière de confidentialité des données. En tant que **super administrateur**, c'est à vous ou à votre éventuel délégué que revient la responsabilité de protéger et de gérer les comptes utilisateurs et les informations personnelles stockées sur l'appareil. Avant de terminer la configuration du système, passez en revue la déclaration relative à l'utilisation et à la confidentialité des données.

source: Review the super admin responsibilities regarding the data usage and privacy.
fr: Passez en revue les responsabilités du super administrateur relatives à l'utilisation et à la confidentialité des données.

source: Once you finish the initial setup, proceed to :ref:`import some content <manage_content_ref>`, and :ref:`create users <manage_users_ref>` (if you chose the Admin-managed facility setup). Make sure to check how to :ref:`configure other computers <access_LAN>` in the network to access Kolibri.
fr: Une fois la configuration initiale terminée, commencez à :ref:`importer du contenu <manage_content_ref>`, et à :ref:`créer des utilisateurs <manage_users_ref>` (si le système est configuré pour que la gestion de l'institut revienne à l'administrateur ). Assurez-vous de vérifier comment :ref:`configurer les autres ordinateurs <access_LAN>` du réseau pour qu'ils puissent accéder à Kolibri.

source: Tutorials
fr: Didacticiels

source: Step-by-step guides with more details.
fr: Des guides étape par étape avec plus de détails.

source: Hard drive provisioning of multiple Kolibri servers
fr: Provisionnement des disques durs de plusieurs serveurs Kolibri

source: This tutorial will help you to prepare for the Kolibri implementation where you need to install and provision several Kolibri server devices with the same content channels.
fr: Ce didacticiel est conçu pour vous accompagner dans la mise en place de Kolibri impliquant l'installation et le provisionnement de plusieurs appareils serveurs Kolibri avec les mêmes chaînes de contenu.

source: Provisioning multiple servers with software and content is **going to take some time** irregardless of the chosen procedure.
fr: Le provisionnement de plusieurs serveurs en logiciels et en contenu va **prendre un certain temps**, quelle que soit la procédure choisie.

source: You will need an **active Internet connection only to preload content channels on the first server device**. Provisioning the rest of the servers can be accomplished offline, or just within the working local network.
fr: Vous aurez besoin d'une **connexion Internet active uniquement pour précharger les chaînes de contenu sur le premier appareil serveur**. Le provisionnement des autres serveurs peut être effectué hors ligne ou simplement au sein du réseau local.

source: Required hardware
fr: Matériel requis

source: Laptops and/or other devices to host Kolibri servers.
fr: Des ordinateurs portables et/ou autres appareils pour héberger les serveurs Kolibri.

source: For provisioning you have the option to use:
fr: Pour le provisionnement, il est possible d'utiliser :

source: Fast USB 3 external drive(s). USB 2 can work too, but we recommend using more than one USB 3 drives for fastest results.
fr: De(s) support(s) de stockage externe(s) rapide(s) USB 3.0. L'USB 2.0 peut aussi fonctionner, mais nous recommandons l'usage de plus d'un support USB 3.0 pour obtenir des résultats plus rapides.

source: **OR**
fr: **OU**

source: Working LAN (cabled is preferable to wireless, and ideally via a router that supports Gigabit Ethernet).
fr: Un réseau local opérationnel (il est préférable d'utiliser un câble plutôt que du sans fil, idéalement via un routeur supportant l'Ethernet Gigabit).

source: Active Internet connection to download the installer and preload content channels on the first (“master”) server.
fr: Une connexion Internet active pour télécharger l'installateur et précharger les chaînes de contenu sur le premier serveur ( dit « maître »).

source: We recommend you install and preload content channels on one server (referring to it as the *master* for the purpose of this procedure), and then copy the required folder structure to the rest of the devices.
fr: Nous vous recommandons d'installer et de précharger les chaînes de contenu sur un serveur (appelé *maître* pour les besoins de cette procédure), puis de copier la structure de dossiers requise sur les autres appareils.

source: Copying the folders with content from the master server hard drive to others via the USB 3 external drive might be faster, but copying via the cabled LAN connection may be done in parallel (from master to several others at the same time). You can combine these two options for the fastest results, if you have access to both cabled LAN and the USB external drives.
fr: Bien qu'il soit plus rapide de copier les dossiers de contenu du disque dur du serveur maître vers d'autres dossiers au moyen d'un support USB 3.0, il est possible de copier les dossiers (du maître vers plusieurs autres serveurs en même temps) via le réseau local en parallèle. Si vous avez accès tant à une connexion câblée au réseau local et qu'à des supports externes USB, vous pouvez combiner ces deux options pour accélérer au maximum la procédure.

source: Provision the master server
fr: Provisionner le serveur maître

source: Install Kolibri on the master server by following the steps for your :ref:`chosen platform <install>`.
fr: Installez Kolibri sur le serveur maître en suivant les étapes correspondant à la :ref:`plateforme sélectionnée <install>`.

source: Proceed with the :ref:`setup_initial` of the facility on the master server.
fr: Procédez à la :ref:`setup_initial` de l'institut sur le serveur maître.

source: :ref:`Import the desired content <import_studio>` to preload it on the master server.
fr: :ref:`Importez le contenu souhaité <import_studio>` pour le précharger sur le serveur maître.

source: Kolibri folder structure
fr: Arborescence des dossiers Kolibri

source: At this point you have the master server set-up and preloaded with content. Before you proceed to copy the content and the database to the rest of the server devices, let’s get familiar with the Kolibri folder structure.
fr: À ce stade de la procédure, le serveur maître est configuré et préchargé avec du contenu. Avant de copier le contenu et la base de données sur les autres appareils serveurs, familiarisez-vous avec l'arborescence des dossiers Kolibri.

source: On Windows, the main server database and all the files related to the content are stored in the folder named ``.kolibri``, located in ``C:/Users/<username>/.kolibri/`` (if your main hard drive is ``C:``).
fr: Sous Windows, la base de données du serveur principal et tous les fichiers liés au contenu sont stockés dans le dossier nommé ``.kolibri``, situé dans ``C:/Users/<username>/.kolibri/`` (si votre disque dur principal est ``C:``).

source: ``<username>`` refers to the user you were logged in as when you installed Kolibri as explained above. In the image below for example, you can see that the user who installed Kolibri is called **IEUser**.
fr: ``<username>`` correspond au nom d'utilisateur sous lequel vous avez installé Kolibri tel qu'expliqué ci-dessus. Dans l'exemple ci-dessous, l'utilisateur ayant installé Kolibri se nomme **IEUser**.

source: Find the `.kolibri` folder on Windows.
fr: Trouvez le dossier `.kolibri` sous Windows.

source: On Linux the ``.kolibri`` folder is located inside your user home folder.
fr: Avec Linux, le dossier ``.kolibri`` est situé dans votre répertoire utilisateur personnel.

source: Find the `.kolibri` folder on Linux.
fr: Trouvez le dossier `.kolibri` sous Linux.

source: The content of the ``.kolibri`` folder is the same for all platforms. Inside you can see the main database file ``db.sqlite3``, and the subfolder named ``content`` which contains 2 subfolders: ``databases`` with the separate database for each of the content channels imported into Kolibri, and the ``storage`` folder with all the content files and resources.
fr: Le contenu du dossier ``.kolibri`` est le même pour toutes les plateformes. Vous y trouverez le fichier de base de données principal ``db.sqlite3``, et le sous-dossier nommé ``content``, qui renferme 2 sous-dossiers : ``databases``, qui contient les bases de données spécifiques à chacune des chaînes de contenu importées dans Kolibri, et ``storage``, qui regroupe tous les fichiers de contenu et les ressources.

source: Find the channel's databases and content folder.
fr: Trouvez les bases de données et le dossier de contenu de la chaîne.

source: Prepare the ``.kolibri`` folder for copying
fr: Préparer le dossier ``.kolibri`` afin de le copier

source: Before you proceed to copy the ``.kolibri`` folder from the master server hard drive (which already contains content channels), to the rest of the server devices for your deployment, you need to **deprovision** (that is, empty out) the user database.
fr: Avant de copier le dossier ``.kolibri`` du disque dur du serveur maître (qui contient déjà des chaînes de contenu), vers les autres appareils serveurs pour le déploiement, il est nécessaire de **déprovisionner** (c'est-à-dire vider) la base de données utilisateurs.

source: This is a critical step, to ensure that each destination server has a unique **Facility ID** (and name) associated with it.
fr: Ceci est une étape critique afin de s'assurer qu'un **ID d'établissement** (et un nom) unique est associé à chaque serveur de destination.

source: Open the Terminal on Linux or the :ref:`command prompt on Windows <command_line>`.
fr: Ouvrez le Terminal sur Linux ou :ref:`l'invite de commande sur Windows <command_line>`.

source: Stop Kolibri server with the following command
fr: Arrêtez le serveur Kolibri avec la commande suivante

source: Follow that with the command to empty the user database.
fr: Exécutez ensuite la commande pour vider la base de données utilisateurs.

source: You will have to confirm twice by typing ``yes`` and pressing the :guilabel:`Enter` key.
fr: Vous devrez confirmer deux fois en saisissant ``yes`` et en appuyant sur la touche :guilabel:`Entrée`.

source: Copy the content to other server devices
fr: Copier le contenu sur d'autres appareils serveurs

source: Independent from the copying procedure you decide to use, you should first proceed to :ref:`install Kolibri <install>` on each of the destination devices, following the same steps as for the master server, **but you don’t need to go through the Initial Setup**.
fr: Indépendamment de la procédure de copie que vous décidez d'utiliser, il est essentiel de procéder d'abord à :ref:`l'installation de Kolibri <install>` sur chacun des appareils de destination, en suivant les mêmes étapes que pour le serveur maître, **sans toutefois devoir effectuer la configuration initiale**.

source: After the installation you must **stop Kolibri** on the destination device, before you proceed to copy the content.
fr: Après l'installation, il vous faudra **arrêter Kolibri** sur l'appareil de destination, avant de procéder à la copie du contenu.

source: On Windows you need to right-click the Kolibri icon in the Windows taskbar (usually at bottom right, near the clock), and select ``Exit``. You will be prompted to confirm the selection, after which Kolibri will stop.
fr: Sous Windows, faites un clic droit sur l'icône de Kolibri dans la barre des tâches (située généralement en bas à droite, près de l'horloge), et sélectionner ``Quitter``. Vous serez invité à confirmer votre choix, suite à quoi Kolibri s'arrêtera.

source: Stop Kolibri from the taskbar options.
fr: Arrêtez Kolibri à partir des options de la barre des tâches.

source: On Linux you need to run ``kolibri stop`` or ``sudo service kolibri stop`` (if you installed Kolibri to run as the system service).
fr: Sous Linux, exécutez ``kolibri stop`` ou ``sudo service kolibri stop`` (si vous avez installé Kolibri pour qu'il fonctionne comme service système).

source: Use the external USB drive to copy content
fr: Copier le contenu à l'aide d'un support externe USB

source: Copy the ``.kolibri`` folder from the master server hard drive, and paste it on the external USB drive.
fr: Copiez-collez le dossier ``.kolibri`` du disque dur du serveur maître au support externe USB.

source: Copy the ``.kolibri`` folder from the USB drive, and paste it inside the destination device hard drive.
fr: Copiez-collez le dossier ``.kolibri`` du support externe USB au disque dur de l'appareil de destination.

source: On Windows you need to copy the ``.kolibri`` folder into the ``C:/Users/<username>/`` folder, where the ``<username>`` is the account you were logged in as when you installed Kolibri on that destination device (it may be different from the account on the master server). On Linux you need to copy inside the home folder of the user who installed Kolibri, or is the owner of the Kolibri system service.
fr: Sous Windows, il vous faudra copier le dossier ``.kolibri`` vers le dossier ``C:/Users/<username>/``, où le ``<username>`` correspond au nom du compte sous lequel vous avez installé Kolibri sur l'appareil de destination (il peut être différent du compte sur le serveur maître). Sous Linux, copiez le dossier dans le répertoire personnel de l'utilisateur qui a installé Kolibri, ou qui est le propriétaire du service système Kolibri.

source: You should see an alert message that there is already a ``.kolibri`` folder on the destination device: choose the option to overwrite it.
fr: Un message d'alerte devrait apparaître pour indiquer qu'un dossier ``.kolibri`` existe déjà sur l'appareil de destination : sélectionnez l'option pour l'écraser.

source: Use the cabled LAN connection to copy content
fr: Copier le contenu à l'aide d'une connexion câblée à un réseau local

source: Connect all the devices, master server and the others where you need to copy the content on, to the same local area network (LAN).
fr: Connectez tous les appareils, le serveur maître et les autres sur lesquels vous devez copier le contenu, au même réseau local (LAN).

source: Configure the network access on the master server, so the rest of the devices can:
fr: Configurez les paramètres réseau du serveur maître pour que les autres appareils puissent :

source: See it among their Network locations in the Windows Explorer
fr: Le voir dans la liste des emplacements réseau de l'Explorateur Windows

source: Open it and freely browse its shared folders (``.kolibri`` folder should be shared)
fr: L'ouvrir et parcourir librement ses dossiers partagés (le dossier ``.kolibri`` doit être partagé)

source: Use the Windows or File Explorer on each destination device to copy the ``.kolibri`` folder from the master server hard drive, and paste it inside the destination device hard drive.
fr: Utilisez l'Explorateur Windows ou de fichiers sur chaque appareil de destination pour copier-coller le dossier " .kolibri " du disque dur du serveur maître au disque dur de l'appareil de destination.

source: You should be able to access the master server from several other destination servers through the LAN, and copy the ``.kolibri`` folder at the same time.
fr: Vous devriez pouvoir accéder au serveur maître à partir de plusieurs autres serveurs de destination via le réseau local, et y copier en même temps le dossier ``.kolibri``.

source: Restart Kolibri servers on destination devices
fr: Redémarrer les serveurs Kolibri sur les appareils de destination

source: On Windows double-click the desktop shortcut to start Kolibri after copying content. You will see the notification message *Kolibri is starting, please wait…*. When you see the next notification that *Kolibri is running…*, Kolibri will open in the browser with the URL ``http://127.0.0.1:8080``.
fr: Sous Windows, double-cliquez sur le raccourci du bureau pour démarrer Kolibri après avoir copié le contenu. Vous verrez s'afficher le message *Kolibri démarre, veuillez patienter...*. Une fois la notification suivante *Kolibri est en cours d'exécution...* apparue, Kolibri s'ouvrira dans le navigateur à l'URL ``http://127.0.0.1:8080``.

source: On Linux open the Terminal and run ``kolibri start`` or ``sudo service kolibri start`` (if you installed Kolibri to run as the system service).
fr: Sous Linux, ouvrez le Terminal et lancez ``kolibri start`` ou ``sudo service kolibri start`` (si vous avez installé Kolibri pour qu'il s'exécute en tant que service système).

source: Since the deprovision command emptied the user database on the master server, you will need to perform the :ref:`setup_initial` on each destination device to set their **Facility** name and the super admin account. The Facility name could be the name of the learning center or school in which the respective server will be deployed.
fr: Puisque la commande de déprovision a vidé la base de données utilisateurs sur le serveur maître, vous devrez procéder à la :ref:`setup_initial` de chaque appareil de destination pour définir leur nom d'**établissement** et le compte super admin. Le nom d'établissement pourrait être le nom du centre d'apprentissage ou de l'école dans lequel le serveur respectif sera déployé.

source: An offline Raspberry Pi server
fr: Un serveur Raspberry Pi hors ligne

source: This guide shows you how to configure a Raspberry Pi as a local Wi-Fi hotspot serving Kolibri.
fr: Ce guide vous indique comment configurer un Raspberry Pi sous forme de hotspot Wi-Fi local au service de Kolibri.

source: There are several varieties of operating systems for Raspberry Pi. This guide is intended for and tested on `Raspbian <https://www.raspberrypi.org/>`__, the most popular choice of OS, based on Debian.
fr: Il existe plusieurs variétés de systèmes d'exploitation pour le Raspberry Pi. Ce guide est conçu pour et testé sur `Raspbian <https://www.raspberrypi.org/>`__, le choix d'OS le plus populaire, basé sur Debian.

source: These steps require an internet connection during the installation. After completing the installation, it's possible :ref:`to replicate an image <rpi_replication>` for offline installation.
fr: Les étapes ci-dessous nécessitent une connexion Internet lors de l'installation. Une fois l'installation terminée, il est possible :ref:`de répliquer une image <rpi_replication>` pour une installation hors ligne.

source: Prerequisites
fr: Prérequis

source: Kolibri runs on both Raspberry Pi 3 and 4
fr: Kolibri fonctionne tant sur Raspberry Pi 3 que 4

source: Raspberry Pi Model 3, 3+, 4 and Zero W - or: Raspberry Pi versions that support Raspbian Stretch or Buster and has onboard Wi-Fi
fr: Les modèles 3, 3+, 4 et Zero W de Raspberry Pi - ou : les versions de Raspberry Pi prenant en charge Raspbian Stretch ou Buster et disposant du Wi-Fi intégré

source: Formatted MicroSD Card > 4GB (64 GB recommended or attached USB storage)
fr: Carte MicroSD formatée > 4 Go (64 Go recommandé ou stockage USB connecté)

source: Card reader for a laptop or computer to write to the MicroSD card
fr: Un lecteur de carte pour un ordinateur portable ou un ordinateur pour enregistrer sur la carte MicroSD

source: Latest Raspbian Stretch OS .img file
fr: Le fichier Raspbian Stretch OS .img le plus récent

source: `Raspbian Desktop <http://downloads.raspberrypi.org/raspbian/>`__
fr: `Le bureau Raspbian <http://downloads.raspberrypi.org/raspbian/>`__

source: **Or** `Installation of Raspbian via NOOBS <https://www.raspberrypi.org/documentation/installation/noobs.md>`__
fr: **Ou** `Installation de Raspbian via NOOBS <https://www.raspberrypi.org/documentation/installation/noobs.md>`__

source: Internet connectivity (for setting up the device)
fr: Connexion Internet (pour la configuration de l'appareil)

source: An internal MicroSD card is used for the base system, and an external storage media for contents (for instance a 64 GB USB flash). We recommend that you have an Ethernet cable for online connectivity while installing and fetching contents for Kolibri.
fr: Une carte MicroSD interne est utilisée pour le système de base, et un support de stockage externe pour les contenus (par exemple une clé USB de 64 Go). Nous vous recommandons de disposer d'un câble Ethernet pour la connectivité Internet lors de l'installation et de la récupération de contenus pour Kolibri.

source: The standard Raspbian OS has a graphical desktop. You can also install Raspbian Lite which uses fewer resources, but only has a command line interface. The instructions in this documentation work seamlessly on both.
fr: L'OS standard Raspbian a un bureau graphique. Vous pouvez également installer Raspbian Lite qui utilise moins de ressources, mais qui n'a qu'une interface de ligne de commande. Les instructions de cette documentation fonctionnent aussi bien sur l'un que sur l'autre.

source: Getting started guides
fr: Guides de démarrage
