Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/learn.po
Languages: fr

source: Learn with Kolibri
fr: Apprendre avec Kolibri

source: Access Kolibri
fr: Accéder à Kolibri

source: If you are using Kolibri in your school, education center or facility, your coach or administrator will provide the instructions how to open the sign-in page, and username and password if necessary.
fr: Si vous utilisez Kolibri dans votre école, centre éducatif ou établissement, votre éducateur ou administrateur vous fournira les instructions pour ouvrir la page de connexion, ainsi que votre nom d'utilisateur et votre mot de passe si nécessaire.

source: If you are using Kolibri on your own, outside an education center or facility, follow the instructions how to :doc:`access` according to your operating system.
fr: Si vous utilisez Kolibri en autonomie, en dehors d'un centre éducatif ou d'un établissement, suivez les instructions d':doc:`accès <access>` en fonction de votre système d'exploitation.

source: If you don't have an account, but Kolibri at your facility or home is set up to allow learners to create their own, follow the steps to :ref:`create one for yourself <create_account>`.
fr: Si vous n'avez pas de compte, mais que Kolibri est configuré dans votre établissement ou votre domicile pour permettre aux élèves de créer le leur, suivez les étapes pour :ref:`créer votre propre compte <create_account>`.

source: Sign in to Kolibri
fr: Se connecter à Kolibri

source: To sign in to **Kolibri** and start learning, follow these steps:
fr: Pour vous connecter à **Kolibri** et commencer à apprendre, suivez les étapes suivantes :

source: Type your username and password (may be optional).
fr: Saisissez votre nom d'utilisateur et mot de passe (peut être facultatif).

source: Click the :guilabel:`SIGN IN` button.
fr: Cliquez sur le bouton :guilabel:`SE CONNECTER`.

source: Main Kolibri sign in page.
fr: Page principale de connexion à Kolibri.

source: If you start browsing Kolibri as a guest, you need either to select **Sign in** option from the **Guest** menu in the upper right corner, or from the sidebar menu (left or bottom) to open the sign-in page.
fr: Si vous commencez à naviguer sur Kolibri en tant qu'invité, il vous faudra sélectionner l'option **Se connecter** soit à partir du menu **Invité** dans le coin supérieur droit, soit du menu de la barre latérale (à gauche ou en bas) pour ouvrir la page de connexion.

source: "Sign in" link in the sidebar.
fr: Le lien de connexion dans la barre latérale.

source: "Sign in" link in the user menu.
fr: Le lien de connexion dans le menu utilisateur.

source: Once you have signed in to Kolibri, you can see and edit your user data from the **Profile** option: access it from the main sidebar menu (below **Learn**), or from the user menu.
fr: Une fois connecté à Kolibri, vous pourrez voir et modifier vos données utilisateur à partir de l'option **Profil**, accessible à partir du menu latéral principal (sous **Apprendre**), ou à partir du menu utilisateur.

source: To sign out from Kolibri you can either:
fr: Pour vous déconnecter de Kolibri vous pouvez soit :

source: Click the user icon in the upper right corner and select **Sign out** option, **OR**
fr: Cliquer sur l'icône utilisateur dans le coin supérieur droit et sélectionner l'option **Se déconnecter**, **OU**

source: Select **Sign out** option in the main sidebar menu.
fr: Sélectionner l'option **Se déconnecter** dans le menu latéral principal.

source: Create an account
fr: Créer un compte

source: To create your own account on a **Kolibri** facility and start learning, follow these steps:
fr: Pour créer votre propre compte pour un établissement **Kolibri** et commencer à apprendre, suivez les étapes suivantes :

source: Click :guilabel:`CREATE AN ACCOUNT` button on :ref:`Kolibri sign in page <sign_in_page>`.
fr: Cliquez sur le bouton :guilabel:`CRÉER UN COMPTE` sur :ref:`la page de connexion à Kolibri <sign_in_page>`.

source: Type in your chosen username and password (twice).
fr: Saisissez le nom d'utilisateur et le mot de passe que vous avez choisis (deux fois).

source: Click the :guilabel:`FINISH` button.
fr: Cliquez sur le bouton :guilabel:`TERMINER`.

source: When page reloads you will see the Learn page with Kolibri channels.
fr: Suite au rechargement de la page, vous verrez apparaître la page Apprendre avec les chaînes Kolibri.

source: Make sure to remember your username and password, or save them in a safe place!
fr: Assurez-vous de vous souvenir de votre nom d'utilisateur et de votre mot de passe, ou gardez-les dans un endroit sûr !

source: Classes
fr: Les classes

source: Each time you login into **Kolibri**, the first thing you will see is the **Learn** page with the list of all the classes you are enrolled to.
fr: Chaque fois que vous vous connectez à **Kolibri**, la première chose que vous verrez est la page **Apprendre** qui comprend la liste de toutes les classes auxquelles vous êtes inscrit.

source: Select one of your classes to access :ref:`Lessons` and :ref:`Quizzes` teachers or coaches prepared for your class.
fr: Sélectionnez une de vos classes pour accéder aux :ref:`Leçons <Lessons>` et aux :ref:`Quiz <Quizzes>` que les professeurs ou éducateurs ont préparés pour la classe en question.

source: Channels
fr: Les chaînes

source: Use this tab (|channels| icon) to navigate through the complete set of learning topics and materials available in Kolibri. You can browse it as you wish, or according to indications from your teachers and coaches.
fr: Utilisez cet onglet (icône |channels|) pour naviguer dans l'ensemble des sujets et supports pédagogiques disponibles dans Kolibri. Vous pouvez le parcourir à votre guise, ou selon les indications de vos enseignants et éducateurs.

source: Depending on how your school and teachers or coaches decided to organize the content, you may have one or more channels available here. Follow the indications by your teachers or coaches on how to use the content from each available channel.
fr: En fonction de la façon dont votre école et vos enseignants ou éducateurs ont décidé d'organiser le contenu, vous pourriez ici avoir accès à une ou plusieurs chaînes. Suivez les indications de vos enseignants ou de vos éducateurs sur la façon d'utiliser le contenu de chaque chaîne disponible.

source: Recommended
fr: Contenu recommandé

source: In this tab (|recommended| icon) you can see various sections:
fr: Dans cet onglet (icône |recommended|), vous verrez différentes sections :

source: **Most popular** displays the most frequently used materials in your school or facility.
fr: La rubrique **Les plus populaires** affiche les supports les plus fréquemment utilisés dans votre école ou établissement.

source: **Resume** displays activities that you started but haven't finished yet.
fr: La rubrique **Recommencer** affiche les activités que vous avez commencées mais que vous n'avez pas encore terminées.

source: These learning topics and materials are either related to what you were doing the last time you used Kolibri. or recommended by your teachers and coaches.
fr: Ces sujets et supports d'apprentissage sont soit liés à ce que vous faisiez la dernière fois que vous avez utilisé Kolibri ou ont été recommandés par vos enseignants et éducateurs.

source: The number of displayed content items in each row will depend on the width of your display, and you can browse with the |arrow-left| and |arrow-right| icons at the beginning and the end of the section rows.
fr: Le nombre d'éléments de contenu affichés dans chaque section dépend de la largeur de votre affichage, et vous pouvez les faire défiler avec les icônes |arrow-left| et |arrow-right| de part et d'autre de chaque rangée.

source: **Next steps** and **Resume** are not visible if you are browsing as a guest.
fr: Les sections **Prochaines étapes** et **Reprendre** ne sont pas visibles si vous naviguez en tant qu'invité.

source: Navigate Kolibri topics with breadcrumb links
fr: Naviguer dans les sujets de Kolibri à l'aide du fil d'Ariane

source: When you are browsing a topic in Kolibri, the **Breadcrumb** links indicate previously visited, more general topics. Current topic is at the last position, and you can click any of the previous links in the breadcrumb to go back to a specific broader topic.
fr: Lorsque vous naviguez au sein d'un sujet dans Kolibri, les liens du **fil d'Ariane** indiquent les sujets plus généraux précédemment visités. Le sujet actuel se situe en dernière position, et vous pouvez cliquer sur n'importe lequel des liens précédents dans le fil d'Ariane pour revenir à un sujet plus général particulier.

source: If the full length of the breadcrumbs becomes too wide for the width of your display, the more general topics will be hidden. Click the leftmost down arrow button to access them.
fr: Si le fil d'Ariane devient trop long pour la largeur de votre écran, les sujets plus généraux seront cachés. Cliquez sur la flèche du menu déroulant tout à gauche pour y accéder.

source: Search
fr: Rechercher

source: If you are looking for a specific subject, topic, or term, use the **Search** feature:
fr: Si vous recherchez un sujet, une matière ou un terme spécifique, utilisez la fonctionnalité : **Rechercher**

source: Type the word or combination of words you are looking for in the search field located in the top bar.
fr: Saisissez le mot ou la combinaison de mots que vous recherchez dans le champ de recherche situé dans la barre supérieure.

source: Press :guilabel:`Enter` or click the |search| button to display the results.
fr: Appuyez sur :guilabel:`Entrée` ou cliquez sur le bouton |search| pour afficher les résultats.

source: Filter the search results by channel or type of content.
fr: Filtrer les résultats de la recherche par chaîne ou par type de contenu.

source: Some Kolibri resources may be duplicated in different topics and/or channels. Search results will indicate when a resource is duplicated, and you can click on the ``...locations`` link to discover the details for each location.
fr: Certaines ressources Kolibri peuvent être dupliquées dans différents sujets et/ou chaînes. Les résultats de la recherche indiqueront quand une ressource est dupliquée, et vous pourrez cliquer sur le lien ``...locations`` pour découvrir les détails de chaque emplacement.

source: Details for the duplicated resources in the search results.
fr: Détails des ressources dupliquées dans les résultats de recherche.

source: Content types
fr: Les types de contenu

source: You may see different types of content available in Kolibri channels, and you can easily distinguish them by their icons:
fr: Différents types de contenus pourraient être disponibles dans les chaînes Kolibri, et vous pourrez facilement les distinguer par leurs icônes :

source: Videos - |video-icon|
fr: Vidéos - |video-icon|

source: Exercises - |exercise-icon|
fr: Exercices - |exercise-icon|

source: Interactive HTML Apps - |html-icon|
fr: Applications interactives HTML - |html-icon|

source: Topics - |topic-icon|
fr: Sujets - |topic-icon|

source: When you start doing an exercise, viewing a video, or reading a document, it will be marked with the |in-progress| icon. Once you finish viewing a video or complete the exercise, they will be marked with the |completed| icon.
fr: Lorsque vous commencez à faire un exercice, à regarder une vidéo ou à lire un document, il sera marqué par l'icône, |in-progress|. Dès que vous finissez de visionner une vidéo ou de faire l'exercice, ils seront marqués par l'icône |completed|.

source: Progress indicator icons for learning resources.
fr: Icônes sur les ressources pédagogiques indiquant votre progression.

source: Exercises
fr: Les exercices

source: Kolibri **Exercises** can require you to do different things: fill in a missing number, write a formula, choose one of the available options, etc. Each correct answer gets you a check mark, and majority of exercises require 5 correct answers in a row to be completed. Some exercises can offer one or more hints, to help you solve the problem.
fr: Les **exercices** de Kolibri peuvent vous demander de faire de différentes choses : remplir un chiffre manquant, écrire une formule, choisir une des options disponibles, etc. Chaque bonne réponse vous donne droit à une coche, et la majorité des exercices nécessitent 5 bonnes réponses à la suite pour être complétés. Certains exercices peuvent vous proposer un ou plusieurs indices, pour vous aider à résoudre au problème.

source: Independent of the required action (writing an answer yourself or choosing one of the options), these are the steps to follow.
fr: Indépendamment de l'action requise (écrire une réponse soi-même ou choisir une des options), voici les étapes à suivre.

source: **Read the question carefully**.
fr: **Lisez attentivement la question**.

source: Write the answer or choose one of the provided options.
fr: Écrivez la réponse ou choisissez l'une des options proposées.

source: When you are ready to submit, click the :guilabel:`CHECK` button.
fr: Lorsque vous êtes prêt à soumettre l'exercice, cliquez sur le bouton :guilabel:`VÉRIFIER`.

source: When the answer is correct and a |green-check| icon appears in the progress bar below the exercise, click the :guilabel:`NEXT` button to proceed.
fr: Lorsque la réponse est correcte et qu'une icône |green-check| apparaît dans la barre de progrès en dessous de l'exercice, cliquez sur le bouton :guilabel:`SUIVANT` pour continuer.

source: If the answer is incorrect, read the question again, and try another answer. You can also click the :guilabel:`USE A HINT` link, read the suggestions, and try to answer again.
fr: Si la réponse est incorrecte, relisez la question et essayez une autre réponse. Vous pouvez aussi cliquer sur le lien :guilabel:`UTILISER UN INDICE`, lire les suggestions, et essayer de répondre à nouveau.

source: The progress bar below the exercise is taking into account only the most recent answers you give, which means that you need to have the required number of |green-check| icons **in the row** for the exercise to be considered completed.
fr: La barre de progrès sous l'exercice ne prend en compte que les réponses les plus récentes que vous donnez, ce qui signifie que vous devez avoir le nombre requis d'icônes |green-check| **consécutives** pour que l'exercice soit considéré terminé.

source: The correct answers in the image above are not in a row; this exercise will be completed only after you give 5 correct answers one after another.
fr: Les bonnes réponses dans l'image ci-dessus ne sont pas consécutives ; cet exercice ne sera complété qu'une fois 5 bonnes réponses données l'une après l'autre.

source: Once you have achieved the required number of correct answers in a row, you will be rewarded points, and see the suggestion to continue. Click the card under the **Next resource** heading below to continue learning with the rest of the material in that topic.
fr: Une fois que vous avez obtenu le nombre requis de bonnes réponses à la suite, vous gagnerez des points et serez invité à poursuivre votre apprentissage. Pour continuer à vous instruire grâce aux autres supports disponibles sur ce sujet, cliquez sur l'encadré situé sous le titre **Ressource suivante**.

source: If you are unable to solve some questions, try reviewing the videos in that same topic, or seek help from your peers or teacher/coach.
fr: Si vous n'arrivez pas à résoudre certaines questions, essayez de revisionner les vidéos sur le même sujet ou demandez l'aide de vos pairs ou de votre enseignant/éducateur.

source: Video and Audio Player options
fr: Les options du lecteur Vidéo et Audio

source: To play videos and listen to audio files in Kolibri you have several available control buttons at the bottom of the player screen. Move the cursor or tap on the player screen to make appear the control buttons while playing.
fr: Pour visionner des vidéos et écouter des fichiers audio dans Kolibri, plusieurs boutons de commande sont disponibles en bas de l'écran du lecteur. Déplacez le curseur ou tapez sur l'écran du lecteur pour faire apparaître les boutons de commande pendant la lecture.

source: Kolibri video and audio player.
fr: Lecteur audio et vidéo sur Kolibri.

source: (controls at the bottom of the player)
fr: (les commandes en bas du lecteur)

source: Play/Pause buttons
fr: Boutons de lecture/pause

source: Rewind/Fast forward buttons by +/- 10 seconds
fr: Boutons pour retourner en arrière ou avancer de 10 secondes

source: Time tracker indicator with progress bar
fr: Indicateur de suivi du temps avec barre de progrès

source: Video duration indicator
fr: Indicateur de durée de la vidéo

source: Volume scrollbar
fr: Barre de défilement du volume

source: Playback speed selector
fr: Sélecteur de vitesse de relecture

source: Display **closed captions** (subtitles)
fr: Affichage des sous-titres

source: Fullscreen button
fr: Bouton de plein écran

source: Use the :guilabel:`DOWNLOAD CONTENT` button below the player to download the video, audio and thumbnail files to your computer. Some videos will provide multiple resolution options.
fr: Utilisez le bouton :guilabel:`TÉLÉCHARGER LE CONTENU` en dessous du lecteur pour télécharger les fichiers vidéo, audio et les vignettes sur votre ordinateur. Certaines vidéos proposent plusieurs options de résolution.

source: PDF Viewer options
fr: Les options de la visionneuse PDF

source: Options for viewing PDF files will depend on the browser and operating system you are using to view Kolibri.
fr: Les options de visualisation des fichiers PDF dépendent du navigateur et du système d'exploitation que vous utilisez pour accéder à Kolibri.

source: Use the |fullscreen| button in the upper right corner to open the ebook in fullscreen view.
fr: Utilisez le bouton |fullscreen| dans le coin supérieur droit pour ouvrir le livre électronique en mode plein écran.

source: With the :guilabel:`+` and :guilabel:`-` buttons you can zoom the document in and out.
fr: Avec les boutons :guilabel:`+` et :guilabel:`-` vous pouvez zoomer en avant et en arrière dans le document.

source: Use the :guilabel:`Esc` key to close the fullscreen view and return.
fr: Utilisez la touche :guilabel:`Esc` pour fermer la vue plein écran et retourner en arrière.

source: Use the :guilabel:`DOWNLOAD CONTENT` button below the PDF viewer to download the PDF file to your computer.
fr: Utilisez le bouton :guilabel:`TÉLÉCHARGER LE CONTENU` sous la visionneuse PDF pour télécharger le fichier PDF sur votre ordinateur.

source: Ebook Viewer options
fr: Les options de la visionneuse de livres électroniques

source: To read digital books in Kolibri you have several available controls inside the reader.
fr: Pour lire des livres numériques dans Kolibri, plusieurs commandes sont disponibles à l'intérieur du lecteur.

source: Use the |toc| button in the upper left corner to view the table of content with all the book chapters.
fr: Utilisez le bouton |toc| dans le coin supérieur gauche pour afficher la table des matières comportant tous les chapitres du livre.

source: Click the |epub-settings| button to adjust the text size and the background color.
fr: Cliquez sur le bouton |epub-settings| pour ajuster la taille du texte et la couleur du fond.

source: If you want to search for a word or a phrase, use the |search| button.
fr: Si vous voulez rechercher un mot ou une phrase, utilisez le bouton |search|.

source: Close the fullscreen view with the :guilabel:`Esc` key.
fr: Fermez la vue plein écran avec la touche :guilabel:`Esc`.

source: Navigate through the book pages with |previous-page| and |next-page| buttons, or with the slider control at the bottom.
fr: Naviguez à travers les pages du livre avec les boutons |previous-page| et |next-page|, ou à l'aide du curseur en bas.

source: Use the :guilabel:`DOWNLOAD CONTENT` button below the viewer to download the ePub file to your computer.
fr: Utilisez le bouton :guilabel:`TÉLÉCHARGER LE CONTENU` sous la visionneuse pour télécharger le fichier ePub sur votre ordinateur.

source: Lessons
fr: Les leçons

source: Your teacher or coach may prepare a *lesson* (|lessons| icon), a recommended set of learning materials for you or your class to view. You may have more than one lesson available at the time in the **Classes** tab, below the **Lessons** heading.
fr: Votre professeur ou votre éducateur peut préparer une *leçon* (l'icône |lessons|), c'est-à-dire un ensemble de supports d'apprentissage recommandé que vous ou votre classe pourrez consulter. Il pourrait y avoir plus d'une leçon disponible à la fois dans l'onglet **Classes**, sous le titre **Leçons**.

source: Click on a lesson title to open its content, and follow the indications of your teachers or coaches on how to use it.
fr: Cliquez sur le titre d'une leçon pour ouvrir son contenu, et suivez les indications de vos professeurs ou de vos éducateurs sur la façon de l'utiliser.

source: Quizzes
fr: Les quiz

source: If your teacher or coach scheduled an *quiz* (|exams| icon) for you or your class, it will be available in the **Classes** tab, under the **Quizzes** heading. You may have more than one quiz available at the time.
fr: Si votre professeur ou votre éducateur a prévu un *quiz* (l'icône |exams|) pour vous ou votre classe, il sera disponible dans l'onglet **Classes**, sous la rubrique **Quiz**. Il pourrait y avoir plus qu'un quiz disponible à la fois.

source: If the quiz is listed as *Not started*, follow these steps.
fr: Si le quiz est listé comme *Pas commencé*, suivez les étapes suivantes.

source: Click on the quiz when you are ready to start taking it.
fr: Cliquez sur le quiz lorsque vous êtes prêt à le faire.

source: You can go on answering the questions in the order you prefer: move through questions with :guilabel:`PREVIOUS` and :guilabel:`NEXT` buttons, or click on the question number in the column on the left side.
fr: Vous pouvez répondre aux questions dans l'ordre de votre choix : faîtes défiler les questions avec les boutons :guilabel:`QUESTION PRÉCÉDENTE` et :guilabel:`QUESTION SUIVANTE`, ou cliquez sur le numéro de la question dans la colonne à gauche.

source: Each time you fill in the answer field, or select one of the available options, the question will be marked by a colored dot in the column on the left side.
fr: Chaque fois que vous saisissez une réponse ou que vous sélectionnez l'une des options disponibles, la question sera marquée par un point de couleur dans la colonne à gauche.

source: You can review and correct your answers to all questions as many times you need before submitting.
fr: Vous pouvez revoir et corriger vos réponses à toutes les questions autant de fois que vous le souhaitez avant de les soumettre.

source: Press the *Back to quiz list* if you want to pause the quiz and come back later.
fr: Appuyez sur *Retour à la liste des quiz* si vous voulez mettre le quiz en pause et y revenir plus tard.

source: Press the button :guilabel:`SUBMIT QUIZ` when you want to submit it for grading.
fr: Appuyez sur le bouton :guilabel:`SOUMETTRE LE QUIZ` quand vous êtes prêt à le soumettre et obtenir votre score.

source: A quiz that you did not yet submit will be marked with the |in-progress| icon, so you can easily recognize it, and click to resume when you are ready.
fr: Un quiz que vous n'avez pas encore soumis sera identifié par l'icône |in-progress|, afin que vous puissiez le reconnaître facilement, et reprendre en un clic lorsque vous serez prêt.

source: Once you complete and submit a quiz, it will be marked with the |completed| icon, but you can still click on it to see the score and review your answers.
fr: Une fois que vous aurez complété et soumis un quiz, il sera marqué de l'icône |completed|, mais vous pouvez encore cliquer dessus pour voir votre note et passer en revue vos réponses.
