Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/learn.po
Languages: fr

source: Use the **Show correct answer** checkbox to visualize the answer for the questions that you did not answer correctly.
fr: Utilisez la case à cocher **Montrer la bonne réponse** pour visualiser la réponse aux questions auxquelles vous n'avez pas répondu correctement.
