Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/manage.po
Languages: fr

source: You can view, create and delete classes, as well as search, filter and enroll Kolibri users in them, using the **Classes** tab in your **Facility** dashboard (|classes| icon). Default view displays the list of all classes in your facility, with the number of enrolled users for each class.
fr: Vous pouvez afficher, créer et supprimer des classes, ainsi que rechercher, filtrer et y inscrire des utilisateurs Kolibri, à partir de l'onglet **Classes** du tableau de bord **Institut** (icône |classes|). La vue par défaut affiche la liste de toutes les classes de votre établissement y compris le nombre d'utilisateurs inscrits pour chaque classe.

source: To manage Kolibri classes you must sign in as **admin** or **super admin**.
fr: Seuls les utilisateurs connectés en tant qu'**admin** ou **super admin** peuvent gérer les classes dans Kolibri.

source: Add New Class
fr: Ajouter une nouvelle classe

source: To add a new class, follow these steps.
fr: Pour ajouter une nouvelle classe, suivez les étapes suivantes.

source: Click :guilabel:`NEW CLASS`.
fr: Cliquez sur :guilabel:`NOUVELLE CLASSE`.

source: Fill in the class name.
fr: Saisissez le nom de la classe.

source: Click :guilabel:`SAVE` to add the new class, or :guilabel:`CANCEL` to exit.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour ajouter la nouvelle classe, ou sur :guilabel:`ANNULER` pour quitter.

source: Delete Class
fr: Supprimer une classe

source: To delete class, follow these steps.
fr: Pour supprimer une classe, suivez les étapes suivantes.

source: Click :guilabel:`DELETE CLASS` for the chosen class from the list.
fr: Cliquez sur :guilabel:`SUPPRIMER LA LEÇON` pour la classe en question dans la liste.

source: Click :guilabel:`DELETE` in the confirmation window to proceed, or :guilabel:`CANCEL` to exit without deleting the class.
fr: Cliquez sur :guilabel:`SUPPRIMER` dans la fenêtre de confirmation pour continuer, ou :guilabel:`ANNULER` pour quitter sans supprimer la classe.

source: Users enrolled in the class you are deleting will not be removed from the database.
fr: Les utilisateurs inscrits dans la classe que vous supprimez ne seront pas supprimés de la base de données.

source: Edit Class, Learners and Coaches
fr: Modifier les classes, les élèves et les éducateurs

source: A newly created class does not have any learners or coaches. To edit a class select it from the default view in the **Classes** tab. In this view, you can change class name, add or remove currently enrolled learners and assign or remove coaches from the class.
fr: Une classe nouvellement créée n'a pas d'élèves ni d'éducateurs. Pour modifier une classe, sélectionnez-la dans la vue par défaut de l'onglet **Classes**. Dans cette vue, vous pourrez modifier le nom de la classe, ajouter ou supprimer des élèves actuellement inscrits et y assigner ou supprimer des éducateurs.

source: Enroll Learners in Class
fr: Inscrire des élèves dans une classe

source: Click the :guilabel:`ENROLL LEARNERS` button on the class details page.
fr: Cliquez sur le bouton :guilabel:`INSCRIRE LES ÉLÈVES` sur la page détaillée de la classe.

source: List in this view contains all the learners currently **NOT** enrolled for the selected class.
fr: La liste qui apparaîtra contient tous les élèves qui ne sont **PAS** inscrits à la classe sélectionnée.

source: You can search for a specific learner by name.
fr: Vous pouvez rechercher un élève particulier par son nom.

source: Use checkboxes to select all the learners in the list, or the search field for specific learners you want to enroll to class.
fr: Utilisez les cases à cocher ou la fonction de recherche pour sélectionner tous les élèves qui vous souhaitez inscrire à la classe.

source: Click :guilabel:`CONFIRM` to finish enrolling the selected learners and return to the main class page.
fr: Cliquez sur :guilabel:`CONFIRMER` pour finaliser l'inscription des élèves sélectionnés et retourner à la page principale de la classe.

source: Remove Learners from Class
fr: Supprimer des élèves d'une classe

source: Click :guilabel:`REMOVE` for the chosen learner.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour l'élève en question.

source: Click :guilabel:`REMOVE` to confirm, or :guilabel:`CANCEL` to exit without removing the learner.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans supprimer l'élève.

source: Learners removed from the class will not be deleted from the database, and you can still access their accounts from the **Users** tab in the **Facility** dashboard.
fr: Les élèves retirés d'une classe ne seront pas supprimés de la base de données, et vous pourrez toujours accéder à leur compte à partir de l'onglet **Utilisateurs** du tableau de bord **Institut**.

source: Assign Coaches to Class
fr: Assigner des éducateurs à la classe

source: Click the :guilabel:`ASSIGN COACHES` on the class details page.
fr: Cliquez sur le :guilabel:`ASSIGNER ÉDUCATEURS` sur la page détaillée de la classe.

source: List in this view contains all the users with *Coach*, *Facility coach* or *Admin* roles.
fr: La liste qui apparaîtra contient tous les utilisateurs ayant des rôles d'*éducateurs*, d'*éducateurs d'établissement* ou d'*administrateurs*.

source: You can search for a specific user by name.
fr: Vous pouvez rechercher un utilisateur particulier par son nom.

source: Use checkboxes to select all the users in the list, or the search field for specific users you want to assign as a coach to class.
fr: Utilisez les cases à cocher ou la fonction de recherche pour sélectionner tous les utilisateurs de la liste à qui vous souhaitez attribuer la classe en tant qu'éducateurs.

source: Click :guilabel:`CONFIRM` to finish.
fr: Cliquez sur :guilabel:`CONFIRMER` pour finaliser l'opération.

source: Remove Coaches from a Class
fr: Supprimer des éducateurs d'une classe

source: Click :guilabel:`REMOVE` for the chosen coach.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour l'éducateur en question.

source: Click :guilabel:`REMOVE` to confirm, or :guilabel:`CANCEL` to exit without removing the coach.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans retirer l'éducateur.

source: Coaches removed from the class will not be deleted from the database, and you can still access their accounts from the **Users** tab in the **Facility** dashboard.
fr: Les éducateurs retirés de la classe ne seront pas supprimés de la base de données, et vous pourrez toujours accéder à leur compte à partir de l'onglet **Utilisateurs** du tableau de bord **Institut**.

source: Rename Class
fr: Renommer une classe

source: To edit class name, follow these steps.
fr: Pour modifier le nom d'une classe, suivez les étapes suivantes.

source: Click on the **Edit** link next to the class’ name.
fr: Cliquez sur le lien **Modifier** à côté du nom de la classe en question.

source: Write the new name in the **Class name** field.
fr: Saisissez le nouveau nom dans le champ **Nom de la classe**.

source: Click :guilabel:`SAVE` to confirm the edited information, or :guilabel:`CANCEL` to exit without saving.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour confirmer la modification, ou sur :guilabel:`ANNULER` pour quitter sans enregistrer.

source: Manage Data
fr: Gestion des données

source: You can download Kolibri *Detail* and *Summary* logs usage data and export in the CSV format from the **Data** tab in your **Facility** dashboard (|data| icon).
fr: Vous pouvez télécharger le *Détail* et le *Résumé* des données d'utilisation de Kolibri et les exporter au format CSV à partir de l'onglet **Données** du tableau de bord **Institut** (icône |data|).

source: To download session or summary logs, follow these steps.
fr: Pour télécharger le journal des sessions ou le résumé des journaux, suivez les étapes suivantes.

source: Click the *Generate log file* link for the file you require.
fr: Cliquez sur le lien *Générer le fichier de logs* pour le journal souhaité.

source: Click the :guilabel:`DOWNLOAD` button.
fr: Cliquez sur :guilabel:`TÉLÉCHARGER`.

source: Save the generated ``csv`` file on your local drive.
fr: Enregistrez le fichier ``csv`` généré sur votre disque local.

source: To download again after more interactions click the *Generate a new log file* link.
fr: Pour le télécharger à nouveau suite à des interactions ultérieures, cliquez sur le lien *Générer un nouveau fichier de logs*.

source: Troubleshooting
fr: Dépannage

source: Troubleshoot Network Issues
fr: Dépannage des problèmes de réseau

source: Can you access Kolibri when you type ``http://127.0.0.1:8080`` in the address bar of the browser?
fr: Pouvez-vous accéder à Kolibri lorsque vous saisissez ``http://127.0.0.1:8080`` dans la barre d'adresse de votre navigateur ?

source: Can you access anything from the :ref:`external IP <access_LAN>` of the device running Kolibri **FROM** the device itself? Read more information :ref:`about IP addresses <ips>`.
fr: Pouvez-vous accéder à quoi que ce soit à l'adresse :ref:`IP externe <access_LAN>` de l'appareil exécutant Kolibri **À PARTIR DE** l'appareil lui-même ? Pour plus d'informations, consultez la section :ref:`À propos des adresses IP <ips>`.

source: Can you ping the external IP address from another device on the network? For example, if Kolibri is on a device/computer with IP address ``192.168.0.104``, type this in the Terminal or Command prompt:
fr: Pouvez-vous envoyer un ping à l'adresse IP externe à partir d'un autre appareil sur le réseau ? Par exemple, si Kolibri fonctionne sur un appareil/ordinateur avec l'adresse IP ``192.168.0.104``, tapez la commande suivante dans le Terminal ou l'invite de commande :

source: Firewalls
fr: Les pare-feux

source: If you are having trouble connecting to Kolibri from other computers, your firewall might be blocking access.
fr: Si vous avez des difficultés à vous connecter à Kolibri à partir d'autres ordinateurs, il se peut que votre pare-feu en bloque l'accès.

source: Windows systems often come with firewalls bundled and enabled, and this may interfere with running Kolibri. That said, you probably want to keep your firewall enabled for security reasons, especially if the server is connected to the public internet.
fr: Les systèmes Windows sont souvent équipés de pare-feu intégrés et activés, ce qui peut interférer avec le fonctionnement de Kolibri. Cela dit, pour des raisons de sécurité, vous voudrez probablement garder votre pare-feu activé, surtout si le serveur est connecté à l'Internet public.

source: You can try temporarily disable your firewall to see if it helps with connecting to Kolibri. If so, you'll want to turn the firewall back on and then create a exception rule for Kolibri to allow access.
fr: Vous pouvez essayer de désactiver temporairement votre pare-feu pour voir si cela vous permet de vous connecter à Kolibri. Si oui, il vous faudra réactiver le pare-feu et créer ensuite une règle d'exception pour autoriser l'accès à Kolibri.

source: Troubleshoot Database Issues
fr: Dépannage des problèmes liés à la base de données

source: In case you receive the ``database disk image is malformed`` error in Terminal, try running these commands (note that **you must have the** ``sqlite3`` **command available on your system**).
fr: Si l'erreur ``database disk image is malformed`` s'affiche dans le Terminal, essayez d'exécuter ces commandes (veuillez noter que **la commande** ``sqlite3`` **doit impérativement être disponible sur votre système**).

source: For further assistance, please report the issue on our `Community Forums <https://community.learningequality.org/>`_, stating the operating system and Kolibri version.
fr: Pour une assistance supplémentaire, veuillez signaler le problème sur nos `Forums communautaires <https://community.learningequality.org/>`_, en précisant le système d'exploitation et la version de Kolibri concernés.

source: Videos are not playing
fr: Impossible de visionner les vidéos

source: Make sure to check the :ref:`system requirements <sys_reqs>` to see if you can support video playback. Please report any issues on our `Community Forums <https://community.learningequality.org/>`_, stating the operating system and browser you are using.
fr: Référez-vous aux :ref:`exigences du système <sys_reqs>` pour vérifier que le vôtre supporte bien la fonction de lecture vidéo. Veuillez signaler tout problème sur nos `Forums communautaires <https://community.learningequality.org/>`_, en indiquant le système d'exploitation et le navigateur que vous utilisez.

source: Some overzealous antivirus programs on Windows platform may preventively impede Kolibri or some of its components (for example ``python.exe``) from running correctly. If that happens you need to add them to the antivirus exclusion list. Below steps refer to the program **Avast**, but should be similar in other antivirus applications.
fr: Par précaution, certains programmes antivirus trop zélés de la plateforme Windows peuvent empêcher Kolibri ou certains de ses composants (par exemple ``python.exe``) de fonctionner correctement. Dans un tel cas de figure, il faudra les ajouter à la liste d'exclusions de l'antivirus. Les étapes ci-dessous s'appliquent au programme **Avast**, mais devraient être similaires dans d'autres applications antivirus.

source: Open **Avast**.
fr: Ouvrez **Avast**.

source: Click on **Protection** in the sidebar.
fr: Cliquez sur **Protection** dans la barre latérale.

source: Click on **Virus Chest**.
fr: Cliquez sur **Zone de quarantaine**.

source: Find the file `python.exe` in the list.
fr: Localisez le fichier `python.exe` dans la liste.

source: Right click on the file and select *Scan*.
fr: Faites un clic droit sur le fichier et sélectionnez *Scanner*.

source: If the scan is inconclusive the ``python.exe`` file is not infected with a virus.
fr: Si le scan n'est pas concluant, le fichier ``python.exe`` n'est pas infecté par un virus.

source: Right click on the file and select *Restore and add to exclusions*.
fr: Faites un clic droit sur le fichier et sélectionnez *Restaurer et ajouter aux exclusions*.

source: Problems with import and export from USB drives
fr: Problèmes d'import et d'export à partir de supports USB

source: Kolibri needs read and write access to USB drives in order to import and export content. There are several possibilities why you may encounter issues during this procedure.
fr: Kolibri doit accéder aux supports USB en mode lecture et écriture pour importer et exporter du contenu. Les problèmes que vous pourriez rencontrer lors de ces opérations peuvent émaner de différentes causes.

source: **User account does not have access**:
fr: **Le compte utilisateur n'a pas d'accès** :

source: you installed Kolibri in your own environment running as a non-desktop user (for instance UWSGI)
fr: vous avez installé Kolibri dans votre propre environnement, en tant qu'utilisateur non bureautique (par exemple UWSGI)

source: you have upgraded Kolibri on Debian from a version prior to v0.10. Follow these instructions to :ref:`change the ownership of Kolibri system service <changing-system-user>` from one user account to another
fr: vous avez mis Kolibri à niveau sur Debian à partir d'une version antérieure à la v0.10. Suivez ces instructions pour :ref:`changer la propriété du service système Kolibri <changing-system-user>` d'un compte utilisateur à un autre

source: to grant access to USB drives to other accounts, refer to the documentation of your operating system
fr: pour accorder l'accès aux supports USB à d'autres comptes, reportez-vous à la documentation de votre système d'exploitation

source: **Write access denied**: Some USB drives will experience problems when they are unplugged from the computer in an "unclean" way. If you are denied access to write, look for options to "fix" or "repair" the file system.
fr: **Accès en mode écriture interdit** : certains supports USB rencontrent des problèmes lorsqu'ils sont débranchées de l'ordinateur de façon « non sécurisée ». Si l'accès en mode écriture vous est refusé, tentez de « corriger » ou « réparer » le système de fichiers.

source: **Data failures**: Copying the data can take a long time. If you do not see the final success confirmation message after the copy apparently finishes, do not assume that the data has been imported or exported correctly. Restart the process instead, otherwise you risk inconsistent and malfunctioning content data.
fr: **Échec des données** : copier des données peut prendre beaucoup de temps. Si le message de confirmation finale ne s'affiche pas une fois le transfert apparemment terminé, ne supposez pas que les données ont été importées ou exportées correctement. Redémarrez plutôt le processus, car les données de contenu risquent autrement d'être incohérentes et défectueuses.

source: **Hardware life expectancy**: SD and flash storage drives can "expire". Reading and writing large quantities of content data, especially on older or models with smaller capacity, may produce data errors over time.
fr: **Durée de vie du matériel** : les disques de stockage SD et USB peuvent « expirer ». La lecture et l'écriture de grandes quantités de données de contenu, en particulier sur des modèles plus anciens ou de plus petite capacité, peuvent produire des erreurs de données au fil du temps.

source: Locate Kolibri log files
fr: Localiser les fichiers journaux de Kolibri

source: When you report a problem with Kolibri, we may ask you to send us Kolibri **log** files to help us find out why is it not working or crashing.
fr: Lorsque vous signalez un problème à Kolibri, nous pourrions vous demander de nous envoyer les fichiers **journaux** de Kolibri pour nous aider à découvrir pourquoi il ne fonctionne pas ou se bloque.

source: Open the ``.kolibri/`` folder inside the :ref:`Home <home>` folder of the Kolibri server and locate the ``logs/`` folder. You will be able to find these two files:
fr: Ouvrez le dossier ``.kolibri/`` dans le dossier :ref:`Accueil <home>` du serveur Kolibri et localisez le dossier ``logs/``. Vous y trouverez ces deux fichiers :

source: If the problem happened earlier than the dates in the above log, you can open the ``archive/`` folder inside ``logs/`` to find older log files:
fr: Si le problème est arrivé avant les dates du journal ci-dessus, vous pouvez ouvrir le dossier ``archive/`` à l'intérieur de ``logs/`` pour trouver les anciens fichiers journaux :

source: On Linux and MacOS systems you will need to activate the *Show Hidden Files* option in your file browser, in order to view the ``.kolibri`` folder.
fr: Sur les systèmes Linux et MacOS, l'option *Afficher les fichiers cachés* doit être activée dans votre navigateur de fichiers pour que le dossier ``.kolibri`` s'affiche.

source: About IP addresses
fr: À propos des adresses IP

source: ``127.0.0.1`` IP address, or ``localhost``, is device's own IP address. You can use it in the browser on the device where Kolibri is running to make sure it is working correctly.
fr: L'adresse IP ``127.0.0.1``, ou ``localhost``, est l'adresse IP propre à l'appareil. Vous pouvez l'utiliser dans le navigateur de l'appareil sur lequel Kolibri est lancé pour vous assurer qu'il fonctionne correctement.

source: Aside from its own `localhost <https://en.wikipedia.org/wiki/Localhost>`_ address, a device running Kolibri also has an external IP address like ``192.*.*.*`` or ``10.*.*.*``, under which it is recognized by other devices in the same local network. That is the IP address that you need to use in the :ref:`browsers on client devices <access_LAN>` (learner tablets or computers), to connect with Kolibri server.
fr: Outre sa propre adresse `localhost <https://fr.wikipedia.org/wiki/Localhost>`_, un appareil chargé d'exécuter Kolibri a aussi une adresse IP externe comme ``192.*.*.*`` ou ``10.*.*.*``, sous laquelle il est reconnu par d'autres appareils dans le même réseau local. C'est cette adresse IP que vous devez utiliser dans les :ref:`navigateurs des appareils clients <access_LAN>` (tablettes ou ordinateurs des élèves) pour vous connecter au serveur Kolibri.

source: Kolibri by default runs on the port number ``8080``, but you can :ref:`change this setting <port>` to meet your particular needs.
fr: Par défaut, Kolibri communique sur le numéro de port ``8080``, mais vous pouvez :ref:`modifier ce paramètre <port>` pour répondre à vos besoins particuliers.

source: So when you type the full IP address like ``http://192.168.1.1:8080`` in the browser of a client device, you are telling it to: "Connect to IP address ``192.168.1.1`` on port ``8080`` with the HTTP protocol, and display its content".
fr: Quand vous saisissez l'adresse IP complète comme ``http://192.168.1.1:8080`` dans le navigateur d'un appareil client, vous lui dites en d'autres termes de « Se connecter à l'adresse IP ``192.168.1.1`` sur le port ``8080`` avec le protocole HTTP, et afficher son contenu ».
