Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/manage.po
Languages: fr

source: You can also import content from a different device running Kolibri in your same local network, or even from a Kolibri server hosted outside your LAN, provided you know its exact IP address. This feature is useful for when you have:
fr: Il est également possible d'importer du contenu à partir d'un autre appareil de votre réseau local sur lequel fonctionne Kolibri, voire à partir d'un serveur Kolibri hébergé en dehors de votre réseau local, à condition que vous connaissiez son adresse IP exacte. Cette fonctionnalité est utile dans le cas où vous avez mis en place :

source: a larger country- or region level Kolibri content server outside your LAN, but with resources specific to your implementation requirements
fr: un serveur de contenu Kolibri plus important au niveau du pays ou de la région en dehors de votre réseau local, mais avec des ressources spécifiques à vos besoins

source: various instances of Kolibri servers in your local network, in order to support a high number of client (learner) devices
fr: divers serveurs Kolibri dans votre réseau local, afin de permettre à un grand nombre de clients (élèves) d'en bénéficier

source: Follow these steps to import content channels.
fr: Suivez les étapes suivantes pour importer des chaînes de contenu.

source: Choose option *Local network or internet*, and click :guilabel:`CONTINUE`.
fr: Choisissez l'option *Réseau local ou Internet*, et cliquez sur :guilabel:`CONTINUER`.

source: Click *New address* link to add a new network address.
fr: Cliquez sur le lien *Ajouter une nouvelle adresse* pour renseigner une nouvelle adresse réseau.

source: Input the full network address, and assign a name for this network. Don't forget to add the correct port if different from the default one ``8080``. You can use either the IP address or the domain name.
fr: Saisissez l'adresse complète du réseau et attribuez lui un nom. N'oubliez pas d'ajouter le bon port s'il est autre que ``8080``, le port par défaut. Vous pouvez indiquer soit l'adresse IP, soit le nom de domaine.

source: Click :guilabel:`ADD` to save this address to your device settings. If you later decide to delete it, use the link *Forget*.
fr: Cliquez sur :guilabel:`AJOUTER` pour enregistrer cette adresse dans les paramètres de votre appareil. Si vous décidez plus tard de la supprimer, utilisez le lien *Oublier*.

source: Click :guilabel:`CONTINUE` and follow the same steps for selecting topics and resources as for the :ref:`import from Kolibri Studio <import_studio>`.
fr: Cliquez sur :guilabel:`CONTINUER` et suivez les mêmes étapes de sélection des sujets et ressources que pour l':ref:`import à partir de Kolibri Studio <import_studio>`.

source: This feature was introduced in Kolibri version 0.11, and all the server devices to be used for this type of content import **must have the Kolibri version 0.11 or later** running.
fr: Cette fonctionnalité a été introduite dans la version 0.11 de Kolibri, par conséquent, pour ce type d'importation de contenu, tous les appareils serveurs **doivent exécuter la version 0.11 ou une version ultérieure de Kolibri**.

source: Import Content from a Local Drive
fr: Importer du contenu à partir d'un support amovible

source: If the computer where Kolibri server is running does not have access to Internet or has insufficient bandwidth, you have the option to receive content channels stored on an external drive (USB stick or hard disk). Follow these steps to import content channels.
fr: Si l'ordinateur sur lequel s'exécute le serveur Kolibri n'a pas accès à Internet ou à une bande passante insuffisante, vous avez la possibilité d'importer des chaînes de contenu stockées sur un support externe (clé USB ou disque dur). Pour ce faire, suivez les étapes suivantes.

source: Connect the external USB drive to your computer.
fr: Connectez le lecteur USB externe à votre ordinateur.

source: Choose option for *Attached drive or memory card*, and click :guilabel:`CONTINUE`.
fr: Choisissez l'option *Lecteur attaché ou carte mémoire*, et cliquez sur :guilabel:`CONTINUER`.

source: Kolibri will automatically detect and display the drive(s) with available Kolibri content files.
fr: Kolibri détectera et affichera automatiquement le(s) lecteur(s) avec du contenu Kolibri disponible.

source: Select the drive where the desired channel is stored, and click :guilabel:`CONTINUE`.
fr: Sélectionnez le lecteur sur lequel la chaîne souhaitée est stockée, et cliquez sur :guilabel:`CONTINUER`.

source: Click :guilabel:`SELECT` for the desired channel, and follow the same steps for selecting topics and resources as for the :ref:`import from Kolibri Studio <import_studio>`.
fr: Cliquez sur :guilabel:`SÉLECTIONNER` pour choisir la chaîne souhaitée, et suivez les mêmes étapes de sélection des sujets et des ressources que pour l':ref:`import à partir de Kolibri Studio <import_studio>`.

source: Workaround for import from external drive on older devices
fr: Solution de secours pour l'import de contenu à partir d'un disque dur externe sur des appareils plus anciens

source: If Kolibri is installed on an older or a low-resource device, you can try the following procedure for importing content channels for faster results.
fr: Si Kolibri est installé sur un appareil plus ancien ou à faibles ressources, vous pouvez essayer de suivre la procédure suivante pour importer des chaînes de contenu plus rapidement.

source: Stop Kolibri.
fr: Arrêtez Kolibri.

source: Browse the local drive with the file explorer of your operating system.
fr: Naviguez vers votre support amovible à l'aide de l'explorateur de fichiers de votre système d'exploitation.

source: Copy the ``content`` folder located inside the ``KOLIBRI_DATA`` folder on the local drive.
fr: Copiez le dossier ``content`` situé dans le dossier ``KOLIBRI_DATA`` du support amovible.

source: Paste the copied ``content`` folder inside the ``.kolibri`` folder on your hard disk. The location of the ``.kolibri`` folder will depend on your operating system (see the table below).
fr: Collez le dossier ``content`` dans le dossier ``.kolibri`` de votre disque dur. L'emplacement du dossier ``.kolibri`` dépendra de votre système d'exploitation (voir le tableau ci-dessous).

source: Confirm the merge of the two folders.
fr: Confirmez la fusion des deux dossiers.

source: Restart Kolibri, and the new channels should now be available.
fr: Redémarrez Kolibri, et les nouvelles chaînes devraient maintenant être disponibles.

source: **Beware that the restart might take longer after these steps, as Kolibri needs to map all the new content in the database.**
fr: **Attention, le redémarrage peut prendre un peu plus de temps suite à cette opération, car Kolibri a besoin de cartographier tout le nouveau contenu de la base de données.**

source: **Operating system**
fr: **Système d'exploitation**

source: **Location**
fr: **Emplacement**

source: ``C:/Users/<your_username>/.kolibri/``
fr: ``C:/Utilisateurs/<your_username>/.kolibri/``

source: ``HD/Users/<your_username>/.kolibri/``
fr: ``HD/Utilisateurs/<your_username>/.kolibri/``

source: ``/home/<your_username>/.kolibri/``
fr: ``/page d'accueil/<your_username>/.kolibri/``

source: On Linux and OSX you will need to enable the **Show hidden folders** option in order to view the ``.kolibri`` folder.
fr: Sous Linux et OSX, il vous faudra activer l'option **Afficher les dossiers cachés** pour voir le dossier ``.kolibri``.

source: Update Content Channels
fr: Mettre à jour les chaînes de contenu

source: Public channels on Kolibri Studio are periodically updated from their original sources. Private and unlisted channels that you have on your local Kolibri device may also have changed since you first imported them. You can update your local channels from Kolibri Studio from online sources, from another updated device in your local network or from an external drive where the latest version of the channels has been :ref:`previously exported <export>`.
fr: Les chaînes publiques sur Kolibri Studio sont périodiquement mises à jour à partir de leurs sources originales. Les chaînes privées et non répertoriées disponibles sur votre appareil Kolibri local peuvent également avoir changé depuis leur première importation. Vous pouvez mettre à jour vos chaînes locales à partir de sources en ligne, d'un autre appareil à jour dans votre réseau local ou d'un disque externe sur lequel la dernière version des chaînes a été :ref:`précédemment exportée <export>`.

source: Use caution when updating channels that have been used to make **currently-active** :ref:`lessons <manage_lessons>` and :ref:`quizzes <manage_quizzes>`. The structure and location of some resources inside the channel may have changed in the updated version, which can cause lessons and quizzes to not load correctly.
fr: Soyez prudent lors de la mise à jour des chaînes qui ont été utilisées pour créer :ref:`des leçons <manage_lessons>` et :ref:`des quiz <manage_quizzes>` **actuellement actifs**. La structure et l'emplacement de certaines ressources à l'intérieur de la chaîne peuvent avoir changé dans la version mise à jour, ce qui pourrait empêcher le bon chargement des leçons et des quiz.

source: It is recommended to schedule and perform channel updates only during periods of low activity on the server. Updating content while people are using the server may cause errors or performance issues..
fr: Il est recommandé de programmer et d'effectuer les mises à jour des chaînes uniquement pendant les périodes de moindre activité sur le serveur. La mise à jour du contenu en cours d'utilisation du serveur peut provoquer des erreurs ou des problèmes de performance.

source: To update a channel to its latest version and import new content into Kolibri, follow these steps.
fr: Pour télécharger la dernière version d'une chaîne et importer de nouveaux contenus dans Kolibri, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` for the channel you want to update, and select **Import more**.
fr: Cliquez sur :guilabel:`OPTIONS` pour la chaîne que vous voulez mettre à jour, et sélectionnez **Importer plus**.

source: Choose the source option: **Kolibri Studio**, **Local network or internet** or **Attached drive or memory card**.
fr: Choisissez la source souhaitée : **Kolibri Studio**, **Réseau local ou Internet**, ou **Lecteur attaché ou carte mémoire**.

source: If there is a new channel version available, you will see the notification.
fr: Lorsqu'une nouvelle version de la chaîne est disponible, une notification s'affichera.

source: Notification for the new version of the content channel.
fr: Notification de l'existence d'une nouvelle version de la chaîne de contenu.

source: Click the :guilabel:`UPDATE` button and wait for the updated topic tree to load.
fr: Cliquez sur :guilabel:`METTRE À JOUR` et attendez que la dernière arborescence des sujets soit chargée.

source: You will see empty check boxes for any new content added to the channel since your last import. Select and import content by following the steps from :ref:`Kolibri Studio <import_studio>`, :ref:`local network <local_network>`, or :ref:`attached drive <local_drive>`.
fr: Des cases à cocher vides signaleront tout nouveau contenu ajouté à la chaîne depuis votre dernière importation. Sélectionnez et importez le en suivant les étapes indiquées pour l'import à partir de :ref:`Kolibri Studio <import_studio>`, :ref:`d'un réseau local <local_network>`, ou :ref:`d'un support amovible <local_Drive>`.

source: Export from Kolibri to Local Drive
fr: Exporter du contenu de Kolibri vers un support amovible

source: If you have imported content on one Kolibri device, and want to make it available on another computer where Kolibri is installed, follow these steps to export your content channels.
fr: Si vous avez importé du contenu sur un appareil Kolibri et que vous souhaitez le rendre disponible sur un autre ordinateur où Kolibri est installé, suivez les étapes suivantes pour exporter vos chaînes de contenu.

source: You must have an external drive (SD card, USB stick or hard disk) attached to your device.
fr: Assurez-vous d'avoir connecté un support externe (carte SD, clé USB ou disque dur) à votre appareil.

source: Click :guilabel:`EXPORT` in the **Channels** tab on the **Device** page.
fr: Cliquez sur :guilabel:`EXPORTER` dans l'onglet **Chaînes** de la page **Appareil**.

source: Select the local drive (destination for the export) where you wish to export Kolibri content, and click :guilabel:`CONTINUE`.
fr: Sélectionnez le disque local (destination de l'exportation) sur lequel vous souhaitez exporter le contenu de Kolibri, et cliquez sur :guilabel:`CONTINUER`.

source: In the *Export to <name-of-your-drive>* page you will be able to see all the available content channels on your device.
fr: Sur la page *Exporter vers <name-of-your-drive>*, vous pourrez voir toutes les chaînes de contenu disponibles sur votre appareil.

source: Click :guilabel:`SELECT` for the desired channel, and wait for Kolibri to display the channel information and the topic tree.
fr: Cliquez sur :guilabel:`SÉLECTIONNER` pour choisir la chaîne souhaitée, et attendez que Kolibri affiche les informations sur la chaîne et l'arborescence des sujets.

source: In the **Select content from...** page you will see all the details of the selected channel: description, version, total size and number of learning resources.
fr: Sur la page **Sélectionner le contenu à partir de...** vous pourrez visualiser tous les détails relatifs à la chaîne sélectionnée : sa description, version, taille totale et le nombre de ressources pédagogiques qu'elle contient.

source: Under **Choose content to export** you can browse the channel topics and individual resources. Use the *Select all* checkbox to import the content channel in full, or select only certain topics or resources. As you keep selecting, you will see the total number and size on disk under *Resources selected:*, and the remaining space on the destination drive.
fr: Dans la rubrique **Choisir le contenu à exporter**, vous pouvez visualiser les sujets de la chaîne et les ressources individuelles. Cochez *Tout sélectionner* pour exporter la chaîne de contenu dans son intégralité, ou choisissez uniquement certains sujets ou ressources. Au fur et à mesure de votre sélection, le nombre total de ressources et leur volume sous *Ressources sélectionnées :*, ainsi que l'espace disque disponible sur le support de destination seront automatiquement calculés.

source: Click :guilabel:`EXPORT` once you finish selecting all the desired content.
fr: Une fois terminée la sélection de l'ensemble du contenu souhaité, cliquez sur :guilabel:`EXPORTER` .

source: Wait for Kolibri to export the selected content and click :guilabel:`CLOSE`.
fr: Attendez que Kolibri exporte le contenu sélectionné et cliquez sur :guilabel:`FERMER`.

source: Once the export is finished, safely disconnect the drive according to the recommended procedure for your operating system, and proceed to import channels on other devices.
fr: Une fois l'export terminé, éjectez le support externe en toute sécurité selon la procédure recommandée pour votre système d'exploitation, et procédez à importer les chaînes sur d'autres appareils.

source: This procedure makes a copy of the ``content`` folder located inside the ``.kolibri`` folder on your hard disk, and places it in the ``KOLIBRI_DATA`` folder on the selected local drive. This structure is recognized by the **Import from local drive** command.
fr: Cette procédure permet de créer une copie du dossier ``content`` situé dans le dossier ``.kolibri`` de votre disque dur, et de le placer dans le dossier ``KOLIBRI_DATA`` sur le support amovible sélectionné. Cette structure est reconnue par la commande **Import from local drive**.

source: Delete Channel
fr: Supprimer une chaîne

source: To delete a content channel from your device, follow these steps.
fr: Pour supprimer une chaîne de contenu de votre appareil, suivez les étapes suivantes.

source: Click :guilabel:`OPTIONS` for the channel you want to delete.
fr: Cliquez sur :guilabel:`OPTIONS` pour sélectionner la chaîne que vous voulez supprimer.

source: Select **Delete** option.
fr: Sélectionnez l'option **Supprimer**.

source: Click :guilabel:`DELETE` to proceed, or :guilabel:`CANCEL` to exit without deleting the channel.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour continuer, ou :guilabel:`ANNULER` pour quitter sans supprimer la chaîne.

source: Manage Facility
fr: Gestion des établissements

source: You can edit facility configuration settings in Kolibri from the **Settings** tab in your **Facility** dashboard (|settings| icon).
fr: Vous pouvez modifier les paramètres de configuration des établissements dans Kolibri à partir de l'onglet **Paramètres** du tableau de bord de votre **Institut** (icône |settings|).

source: Activate the options you want to make available for the users of your facility. You have the possibility to allow users to:
fr: Activez les permissions que vous souhaitez donner aux utilisateurs de votre établissement. Vous avez la possibilité d'autoriser les utilisateurs à :

source: edit their full names and usernames
fr: modifier leurs nom et prénom et leur nom d'utilisateur

source: sign in without password (except Admin users)
fr: se connecter sans mot de passe (option non applicable aux administrateurs)

source: download content items (videos, documents, etc.) on their own devices
fr: télécharger des éléments de contenu (vidéos, documents, etc.) sur leurs propres appareils

source: browse content without signing in
fr: parcourir le contenu sans s'authentifier

source: create accounts on your facility
fr: créer des comptes dans votre établissement

source: Manage facility configuration settings.
fr: Gérez les paramètres de configuration de votre établissement.

source: To manage facility settings in Kolibri you must sign in as **admin** or **super admin**.
fr: Seuls les utilisateurs connectés en tant qu'**admin** ou **super admin** peuvent gérer les paramètres de l'établissement.

source: Manage Users
fr: Gestion des utilisateurs

source: You can search for, filter, add, and edit user accounts in Kolibri from the **Users** tab in your **Facility** dashboard (|users| icon).
fr: Vous pouvez rechercher, filtrer, ajouter et modifier des comptes utilisateurs dans Kolibri à partir de l'onglet **Utilisateurs** du tableau de bord **Institut** (icône |users|).

source: To manage Kolibri users you must sign in as **admin** or **super admin**.
fr: Seuls les utilisateurs connectés en tant qu'**admin** ou **super admin** peuvent gérer les paramètres des utilisateurs de Kolibri.

source: Create a New User Account
fr: Créer un nouveau compte utilisateur

source: To create a new user account, follow these steps.
fr: Pour créer un nouveau compte utilisateur, suivez les étapes suivantes.

source: Click :guilabel:`NEW USER` button.
fr: Cliquez sur :guilabel:`NOUVEL UTILISATEUR`.

source: Fill in the required information (name, username, password).
fr: Remplissez les informations demandées (nom, nom d'utilisateur, mot de passe).

source: Select the user type (*Admin*, *Coach* or *Learner*).
fr: Sélectionnez le type d'utilisateur (*Administrateur*, *Éducateur* ou *Élève*).

source: Click :guilabel:`SAVE` to add the new user.
fr: Click sur :guilabel:`ENREGISTRER` pour enregistrer le nouveau utilisateur.

source: Coach Type
fr: Types d'éducateurs

source: When you create a new *Coach* user account, or change the type (role) to *Coach* for an existing user, you can choose between:
fr: Lorsque vous créez un nouveau compte utilisateur *éducateur*, ou que vous changez le type (rôle) d'un utilisateur existant en *éducateur*, vous pouvez choisir entre :

source: **Class coach**, that will have access to the coach dashboard and permissions to instruct ONLY the learners in the classes they are assigned to.
fr: **Éducateur de classe**, pour lui donner accès au tableau de bord des éducateurs et l'autorisation d'instruire UNIQUEMENT les élèves des classes auxquelles il est assigné.

source: **Facility coach**, that will have access to the coach dashboard and permissions to instruct ALL the classes and the learners in the facility.
fr: **Éducateur de l'établissement**, pour lui donner accès au tableau de bord des éducateurs et l'autorisation d'enseigner à TOUTES les classes et à tous les élèves de l'établissement.

source: Select Users by Type
fr: Sélectionner les utilisateurs par type

source: Click to open the selector under **User type** to see filtering options. **All** users are displayed by default.
fr: Ouvrez le menu déroulant situé sous **Type d'utilisateur** pour voir les options de filtrage. Par défaut, **Tous** les utilisateurs sont affichés.

source: Toggle between options (learners, coaches, admins) to display the users according to type.
fr: Alterner entre les options (élèves, éducateurs, admins) pour afficher les utilisateurs selon leur type.

source: Edit User’s Account
fr: Modifier les comptes utilisateurs

source: To edit username, full name or account type, follow these steps.
fr: Pour modifier le nom d'utilisateur, le nom complet ou le type de compte d'un utilisateur, suivez les étapes suivantes.

source: Click on the :guilabel:`OPTIONS` button for the desired user and select the **Edit details** option.
fr: Cliquez sur le bouton :guilabel:`OPTIONS` pour l'utilisateur en question et sélectionnez l'option **Modifier les détails**.

source: Edit **Full name**, **Username** or **User type** in the **Edit user details** window.
fr: Modifiez les champs **Nom complet**, **Nom d'utilisateur** ou **Type d'utilisateur** dans la fenêtre **Modifier les détails utilisateur**.

source: Click :guilabel:`SAVE` to update the edited information, or :guilabel:`CANCEL` to exit without saving.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour mettre à jour les informations modifiées, ou sur :guilabel:`ANNULER` pour quitter sans enregistrer.

source: Reset User’s Password
fr: Réinitialiser le mot de passe d'un utilisateur

source: Click on the :guilabel:`OPTIONS` for the desired user and select the **Reset password** option.
fr: Cliquez sur :guilabel:`OPTIONS` pour l'utilisateur en question et sélectionnez **Réinitialiser le mot de passe** .

source: Enter the new password in both fields in the **Reset user password** window.
fr: Saisissez le nouveau mot de passe dans les deux champs de la fenêtre **Réinitialiser le mot de passe de l'utilisateur**.

source: Click :guilabel:`SAVE` to confirm, or :guilabel:`CANCEL` to exit without changing the password.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans changer le mot de passe.

source: Delete User’s Account
fr: Supprimer un compte utilisateur

source: Click on the :guilabel:`OPTIONS` for the desired user and select the **Delete** option.
fr: Cliquez sur :guilabel:`OPTIONS` pour l'utilisateur en question et sélectionnez l'option **Supprimer** .

source: Click :guilabel:`DELETE` to confirm, or :guilabel:`CANCEL` to exit without deleting the account.
fr: Cliquez sur :guilabel:`SUPPRIMER` pour confirmer, ou sur :guilabel:`ANNULER` pour quitter sans supprimer le compte.

source: When you delete a user, all their learning records will be erased from the database.
fr: Lorsque vous supprimez un utilisateur, tout son historique d'apprentissage s'effacera de la base de données.

source: Manage Classes
fr: Gestion des classes
