Repository: SavvyOsive/kolibri-docs
Catalog: docs/locale/docs/*/LC_MESSAGES/manage.po
Languages: fr

source: Manage Kolibri
fr: Gestion de Kolibri

source: Default User Roles
fr: Les rôles d'utilisateur par défaut

source: Kolibri users by default can be divided in 3 different roles with respective access to features.
fr: Par défaut, les utilisateurs de Kolibri peuvent être divisés en 3 rôles différents, chacun disposant d'un accès spécifique aux fonctionnalités.

source: Default user roles
fr: Les rôles d'utilisateur par défaut

source: **Learners** can:
fr: **Les élèves** peuvent :

source: View content and have their progress tracked
fr: Visualiser le contenu et suivre leur évolution

source: **Coaches** can:
fr: **Les éducateurs** peuvent :

source: View *Coach* dashboard and track progress of other users and usage stats for individual exercises
fr: Accéder au tableau de bord des *éducateurs* et suivre l'évolution d'autres utilisateurs ainsi que les statistiques d'utilisation pour les exercices individuels

source: Create/Edit/Delete *Groups* in *Classes* and add users to them
fr: Créer/Modifier/Supprimer les *Groupes* dans les *Classes* et y ajouter des utilisateurs

source: Create/Edit/Delete *Quizzes* and assign them to users
fr: Créer/Modifier/Supprimer les *Quiz* et les attribuer aux utilisateurs

source: Create/Edit/Delete *Lessons* and assign them to users
fr: Créer/Modifier/Supprimer les *Leçons* et les attribuer aux utilisateurs

source: *Facility coaches* have access to all classes, *class coaches* only to ones they are assigned to
fr: Les *éducateurs d'établissements* ont accès à toutes les classes tandis que les *éducateurs de classe* ont seulement accès à celles auxquelles ils sont assignés

source: **Admins** can:
fr: Les **administrateurs** peuvent :

source: Create/Edit/Delete other **admins**, **coaches**, and **learners**
fr: Créer/Modifier/Supprimer d'autres **admins**, **éducateurs**, et **élèves**

source: Create/Edit/Delete *Classes* and enroll users in them
fr: Créer/Modifier/Supprimer des *Classes* et y inscrire des utilisateurs

source: View/Edit *Facility configuration* settings
fr: Visualiser/Modifier les paramètres de *Configuration de l'établissement*

source: Export *Detail* and *Summary* logs usage data
fr: Exporter le *Journal des sessions* et le *Résumé des journaux* pour obtenir les données d'utilisation

source: Kolibri Super Admins
fr: Les super administrateurs de Kolibri

source: Kolibri **super admin** users have all device permissions, and are able to :ref:`assign them to other users <permissions>`. Therefore **super admin** users can:
fr: Les **supers administrateurs** de Kolibri ont toutes les permissions sur l'appareil, et sont capables de :ref:`les attribuer à d'autres utilisateurs <permissions>`. Par conséquent, les **supers administrateurs** peuvent :

source: Import/Export *Content* channels
fr: Importer/Exporter les chaines de *Contenus*

source: View/Edit *Permissions* of other users
fr: Visualiser/Modifier les *Autorisations* des autres utilisateurs

source: If you are unable to retrieve the username and password for a super admin account in your facility, you can :ref:`create a new super admin account using the command line <create_superuser>`.
fr: Si vous ne pouvez pas récupérer le nom d'utilisateur et le mot de passe d'un compte super admin pour votre établissement, vous pouvez en :ref:`créer un nouveau en utilisant la ligne de commande <create_superuser>`.

source: Assign Additional Permissions
fr: Attribuer des autorisations supplémentaires

source: By default, only **super admin** users can view the **Device** dashboard, import/export **Content** channels in Kolibri, and modify **Permissions** for other users. However, depending on the needs of the institution, **super admin** users can also :ref:`grant these permissions <permissions>` to other users.
fr: Par défaut, seuls les utilisateurs **super admin** peuvent accéder au tableau de bord d'un **Appareil**, importer/exporter des chaines de **Contenu** dans Kolibri, et modifier les **Autorisations** des autres utilisateurs. Cependant, en fonction des besoins de l'institution, les **super admins** peuvent aussi :ref:`accorder ces autorisations <permissions>` à d'autres utilisateurs.

source: Manage Device
fr: Gestion de l'appareil

source: You can manage content and permissions, and view the detailed info of the device where Kolibri is running from the **Device** dashboard.
fr: Vous pouvez gérer le contenu et les autorisations, et afficher les informations détaillées sur l'appareil sur lequel Kolibri fonctionne à partir du tableau de bord de l'**Appareil**.

source: To manage device settings you must have the appropriate permissions.
fr: Pour gérer les paramètres de l'appareil, vous devez avoir les autorisations appropriées.

source: Assign Permissions
fr: Attribuer des autorisations

source: You can assign additional permissions to Kolibri users which will provide them access to more features compared to their :ref:`user roles <user_roles>`. To manage permissions for Kolibri users, use the **Permission** tab in the **Device** dashboard (|permissions| icon).
fr: Vous pouvez attribuer aux utilisateurs de Kolibri des autorisations supplémentaires pour leur donner accès à plus de fonctionnalités par rapport à leur :ref:`rôle d'utilisateur <user_roles>`. Pour gérer les autorisations des utilisateurs de Kolibri, utilisez l'onglet **Autorisations** du le tableau de bord de l'**Appareil** (icône |permissions|).

source: Permission to Manage Content
fr: Autorisation de gestion du contenu

source: To grant permission to another user to manage content channels in Kolibri, that is to import, export and delete them from the device, follow these steps.
fr: Pour accorder à un autre utilisateur l'autorisation de gérer des chaînes de contenu dans Kolibri, c'est-à-dire de les importer, les exporter et les supprimer de l'appareil, suivez les étapes suivantes.

source: Click :guilabel:`EDIT PERMISSIONS` for the chosen user.
fr: Cliquez sur :guilabel:`MODIFIER LES AUTORISATIONS` pour l'utilisateur choisi.

source: Under **Device permissions** activate the option *Can import and export content channels*.
fr: Dans la rubrique **Autorisations de l’appareil**, cochez l'option *A le droit de gérer le contenu sur cet appareil*.

source: Click :guilabel:`SAVE CHANGES` to apply and finish.
fr: Cliquez sur :guilabel:`ENREGISTRER LES MODIFICATIONS` pour effectuer les changements et mettre fin au processus.

source: The users who have been granted the permissions to manage content channels will have a black key indicator in front of their name, and will be able to see the **Device** dashboard with the **Channels** tab.
fr: Une clé de couleur noire apparaîtra devant le nom des utilisateurs autorisés à gérer les chaînes de contenu, lesquels pourront accéder à l'onglet **Chaîne** du tableau de bord de l'**Appareil**.

source: Super Admin Permissions
fr: Autorisations du super admin

source: To grant **super admin** permissions to another user, follow these steps.
fr: Pour accorder les permissions de **super admin** à un autre utilisateur, suivez les étapes suivantes.

source: Activate the option *Make super admin*.
fr: Cochez l'option *Créer un super admin*.

source: The users who have been granted the **super admin** permissions will have a yellow key indicator in front of their name, and will be able to see the **Device** dashboard with both the **Content** and **Permissions** tabs.
fr: Une clé de couleur jaune apparaîtra devant le nom des utilisateurs ayant reçu les autorisations de **super admin**, lesquels pourront accéder aux onglets **Chaînes** et **Autorisations** du tableau de bord de l'**Appareil**.

source: View Device Info
fr: Visualiser les informations sur l'appareil

source: To view the detailed info of the device where Kolibri is running on, use the **Info** tab in the **Device** dashboard (|info| icon). This information will be useful in case you need to report an issue with Kolibri on the :ref:`Learning Equality Community Forums <forums>`.
fr: Pour visualiser les informations détaillées sur l'appareil sur lequel Kolibri fonctionne, cliquez sur l'onglet **Information** du tableau de bord de l'**Appareil** (icône |info|). Ces informations seront utiles dans le cas où vous auriez besoin de signaler un problème lié à Kolibri sur le :ref:`Forum communautaire Learning Equality <forums>`.

source: Click the **Show** link to open the *Advanced* device info.
fr: Cliquez sur le lien **Afficher** pour consulter les infos *Avancées* sur l'appareil.

source: Make note or copy the following device details to clipboard.
fr: Notez ou copiez dans le presse-papier les informations suivantes sur l'appareil.

source: Server IP/URL(s)
fr: IP/URL(s) du serveur

source: Kolibri version
fr: La version de Kolibri

source: Operating system
fr: Le système d'exploitation

source: Installer type
fr: Le type d'installateur

source: Database path
fr: Le chemin de la base de données

source: Device name
fr: Le nom de l'appareil

source: Free disk space
fr: L'espace libre sur le disque

source: Server time
fr: L'heure du serveur

source: Server timezone
fr: Le fuseau horaire du serveur

source: Find out the extended device info in the Device > Info tab.
fr: Découvrez les informations avancées sur l'appareil dans l'onglet, Appareil > Information.

source: Set Default Language
fr: Définir la langue par défaut

source: The language you have chosen during the :ref:`setup_initial` will be set as the **default language** for all users who access Kolibri on the server device. You can change the default language for Kolibri from the **Settings** tab in your **Device** dashboard (|lock| icon).
fr: La langue que vous avez choisie lors de la :ref:`setup_initial` sera définie comme la **langue par défaut** pour tous les utilisateurs qui accèdent à Kolibri sur l'appareil serveur. Vous pouvez changer la langue par défaut de Kolibri à partir de l'onglet **Paramètres** (icône |lock|) du tableau de bord **Appareil**.

source: Select the desired default language from the drop-down menu. You can set Kolibri to display in the language defined by the browser content settings, or in any of the :ref:`currently supported languages <languages>`.
fr: Sélectionnez la langue par défaut de votre choix dans le menu déroulant. Vous pouvez configurer Kolibri pour qu'il s'affiche dans la langue définie dans les paramètres de contenu du navigateur, ou dans l'une :ref:`des langues actuellement prises en charge <languages>`.

source: Manage device language settings.
fr: Gérer les paramètres de langue de l'appareil.

source: Click :guilabel:`SAVE` to apply and finish.
fr: Cliquez sur :guilabel:`ENREGISTRER` pour effectuer les changements et mettre fin au processus.

source: All users will still be able to :ref:`change to their own language of preference <change_language>` from the user menu options.
fr: Tous les utilisateurs pourront toujours :ref:`changer vers leur propre langue de préférence <change_language>` à partir des options du menu utilisateur.

source: Manage Content
fr: Gestion du contenu

source: To manage Kolibri content channels you must have the appropriate permissions.
fr: Pour gérer les chaînes de contenu de Kolibri, vous devez avoir les autorisations appropriées.

source: Kolibri **Content Channel** is a collection of educational resources (video, audio, document files or interactive apps) prepared and organized by the content curator for their use in Kolibri. You can import and export content channels in Kolibri from the **Channels** tab of the **Device** dashboard (|channels| icon).
fr: Sur Kolibri, une **chaîne de contenu** est une collection de ressources pédagogiques (vidéo, audio, documents ou applications interactives) préparées et organisées par le curateur du contenu en vue de leur usage dans Kolibri. Vous pouvez importer et exporter des chaînes de contenu dans Kolibri à partir de l'onglet **Chaînes** du tableau de bord de l’**Appareil** (icône |channels|).

source: Kolibri content channels in the Device > Channels tab.
fr: Les chaînes de contenu Kolibri dans l'onglet Appareil > Chaînes.

source: Each Kolibri content channel has its own **token/ID** in `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__. You can freely view and browse content to import from the **public** channels in Kolibri, but in order to :ref:`import content from private or unlisted channels <import_with_token>`, you will need the **channel token from the content curator who assembled it**.
fr: Chaque chaîne de contenu Kolibri a son propre **jeton/ID** dans `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__. Vous pouvez visualiser et parcourir librement le contenu des chaînes **publiques** dans Kolibri, mais pour :ref:`importer le contenu de chaînes privées ou non listées <import_with_token>`, il faudra que le **curateur de la chaîne en question vous communique son jeton**.

source: The term **Channel ID** was valid for Kolibri versions up to 0.6, while from the Kolibri version 0.7 onward, we started using exclusively the term **token** to uniquely designate each channel.
fr: Le terme **ID de chaîne** était appliqué jusqu'à la version 0.6 de Kolibri, mais à partir de la version 0.7, nous avons commencé à utiliser exclusivement le terme **jeton** pour désigner de manière unique chaque chaîne.

source: When you :ref:`use the Terminal or command prompt <import_command_line>` to import content channels in Kolibri from the command line, you still must use the **32 digit channel ID**, as the command will not work with the token. Make sure to receive the correct channel ID from the person who curated the channel you need to import, or refer to `Kolibri Studio user guide <https://kolibri-studio.readthedocs.io/en/latest/share_channels.html#make-content-channels-available-for-import-into-kolibri>`__ how to find it in Studio user interface, if you have channel editor access.
fr: Lorsque vous :ref:`utilisez le Terminal ou l'invite de commande <import_command_line>` pour importer des chaînes de contenu dans Kolibri à partir de la ligne de commande, vous devez toujours utiliser les **32 chiffres de l'ID de chaîne**, car la commande ne fonctionnera pas avec le jeton. Assurez-vous d'obtenir le bon ID de chaîne de la part de la personne ayant créé la chaîne que vous devez importer, ou référez-vous au `Guide de l'utilisateur de Kolibri Studio <https://kolibri studio.readthedocs.io/en/latest/share_channels.html#make-content-channels-available-for-import-into-kolibri>`__ pour découvrir comment le localiser dans l'interface utilisateur du Studio si vous avez accès aux chaînes en tant qu'éditeur.

source: Import Content into Kolibri
fr: Importer du contenu dans Kolibri

source: **Important**: You **cannot** import your own files (videos, documents, etc.) as learning resources directly into Kolibri from your computer. Kolibri can **only** import content from:
fr: **Important** : Vous **ne pouvez pas** importer vos propres fichiers (vidéos, documents, etc.) comme ressources pédagogiques dans Kolibri directement à partir de votre ordinateur. Kolibri peut **uniquement** importer du contenu issu :

source: already curated **content channels** on `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__, if the computer running Kolibri is connected to internet
fr: des **chaînes de contenu** déjà créées sur `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__, si l'ordinateur sur lequel s'exécute Kolibri est connecté à internet

source: OR
fr: OU

source: an external storage drive (USB or hard drive) where content channels have been previously exported to from another Kolibri installation, if the computer running Kolibri is not connected to internet
fr: d'un support de stockage externe (USB ou disque dur) sur lequel les chaînes de contenu ont été préalablement exportées à partir d'une autre installation Kolibri, si l'ordinateur exécutant Kolibri n'est pas connecté à Internet

source: **To import your own files for use in Kolibri**, you need to register at `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__ site (it's free), and build your own content channel that you can subsequently import into Kolibri. Read more about how to do this in our `Kolibri Studio user guide <https://kolibri-studio.readthedocs.io/en/latest/index.html>`__.
fr: **Pour importer vos propres fichiers pour les utiliser dans Kolibri**, vous devez vous enregistrer (gratuitement) sur le site `Kolibri Studio <https://studio.learningequality.org/accounts/login/>`__ , et créer votre propre chaîne de contenu, que vous pourrez ensuite importer dans Kolibri. Pour comprendre comment, consultez notre `Guide de l'utilisateur de Kolibri Studio <https://kolibri-studio.readthedocs.io/en/latest/index.html>`__.

source: Kolibri database and content may become temporarily unavailable while importing or updating large content channels. Therefore, as a precaution, we recommend you:
fr: Il est possible que la base de données et le contenu de Kolibri soient temporairement indisponibles lors de l'importation ou de la mise à jour de chaînes de contenu volumineuses. Par conséquent, en guise de précaution, nous vous recommandons :

source: avoid other interactions with Kolibri (view learner pages or manage users, for example) while content import is in progress
fr: d'éviter toutes autres interactions avec Kolibri (consultation des pages élèves ou gestion des utilisateurs, par exemple) lorsque que l'importation de contenu est en cours

source: perform these maintenance operations outside the periods when system is being used by learners
fr: d'effectuer ces opérations de maintenance en dehors des périodes d'utilisation du système par les élèves

source: To import content into Kolibri, follow these steps.
fr: Pour importer du contenu dans Kolibri, suivez les étapes suivantes.

source: Click :guilabel:`IMPORT` in the **Channels** tab on the **Device** page.
fr: Cliquez sur :guilabel:`IMPORTER` dans l'onglet **Chaînes** de la page **Appareil**.

source: Choose the source option: **Kolibri Studio**, **Local network or internet**, or **Attached drive or memory card**.
fr: Sélectionnez la source souhaitée : **Kolibri Studio**, **Réseau local ou Internet**, ou **Lecteur attaché ou carte mémoire**.

source: Select a source to import Kolibri content channels.
fr: Sélectionnez une source à partir de laquelle importer des chaînes de contenu Kolibri.

source: Import Content from Kolibri Studio
fr: Importer du contenu à partir de Kolibri Studio

source: If the computer where Kolibri is running has an Internet connection with the sufficient bandwidth, follow these steps to import content channels.
fr: Si l'ordinateur sur lequel Kolibri fonctionne dispose d'une connexion Internet avec une bande passante suffisante, suivez les étapes suivantes pour importer des chaînes de contenu.

source: Choose option *Kolibri Studio*, click :guilabel:`CONTINUE` and you will be able to see all the available **public** content channels.
fr: Choisissez l'option *Kolibri Studio*, et cliquez sur :guilabel:`CONTINUER` pour voir toutes les chaînes de contenu **publiques** disponibles.

source: Select which public channel on Kolibri Studio you want to import content from.
fr: Sélectionnez la chaîne publique sur Kolibri Studio dont vous souhaitez importer le contenu.

source: Channels from which you have already imported some or all content onto your device will have the |on-device| icon.
fr: Les chaînes dont vous avez déjà importé une partie ou la totalité du contenu vers votre appareil porteront l'icône |on-device|.

source: Click :guilabel:`SELECT` for the desired channel, and wait for Kolibri to load the channel information and the topic tree.
fr: Cliquez sur :guilabel:`SÉLECTIONNER` pour choisir la chaîne souhaitée, et attendez que Kolibri charge les informations sur cette dernière ainsi que l'arborescence de ses sujets.

source: This could take some time for big channels. Please be patient, as Kolibri needs to retrieve a lot of information to display.
fr: Pour les chaînes volumineuses, cette opération peut prendre un certain temps, car Kolibri doit récupérer beaucoup d'informations pour les afficher, alors merci de patienter.

source: In the **Select content from...** page you will see all the details for the selected channel: description, version, total size and number of learning resources, with the information weather you have some of the resources from that channel already imported on the local device.
fr: Sur la page **Sélectionner le contenu de...**, vous pourrez visualiser tous les détails relatifs à la chaîne sélectionnée : sa description, version, taille totale et le nombre de ressources pédagogiques qu'elle contient, y si vous avez déjà importé ou non quelques-unes de ces ressources sur votre appareil local.

source: Under **Choose content to import** click the topics links to browse through the channel contents. Use the *Select all* checkbox to import the content channel in full, or select only certain topics or resources. As you keep selecting, you will see the total number and size on disk under *Content selected:*, and the remaining space on your device.
fr: Dans la rubrique **Choisir le contenu à importer**, cliquez sur les liens des sujets pour parcourir le contenu de la chaîne. Cochez *Tout sélectionner* pour importer la chaîne de contenu dans son intégralité, ou choisissez uniquement certains sujets ou ressources. Au fur et à mesure de votre sélection, le nombre total de ressources et le volume sous *Contenu sélectionné :*, ainsi que l'espace disque disponible sur votre appareil seront automatiquement calculés.

source: Click :guilabel:`IMPORT` once you finish selecting all the desired content.
fr: Une fois terminée la sélection de l'ensemble du contenu souhaité, cliquez sur :guilabel:`IMPORTER`.

source: Wait for the content to be downloaded and click :guilabel:`CLOSE` for the new channel to appear under the **Channel** heading.
fr: Attendez que le contenu soit téléchargé et cliquez sur :guilabel:`FERMER` pour que la nouvelle chaîne apparaisse dans la rubrique **Chaînes**.

source: If you need to import content from a **private/unlisted** channel, click on **Try adding the token** link above the channel list.
fr: Pour importer du contenu d'une chaîne **privée/non répertoriée**, cliquez sur le lien **Essayer d'ajouter un jeton** situé au-dessus de la liste des chaînes.

source: Enter the **channel token** received from the channel curator on Kolibri Studio.
fr: Saisissez le **jeton de chaîne** transmis par le curateur de la chaîne Kolibri Studio.

source: Click :guilabel:`CONFIRM` to unlock the channel, or :guilabel:`CANCEL` to exit.
fr: Cliquez sur :guilabel:`CONTINUER` pour déverrouiller la chaîne, ou :guilabel:`ANNULER` pour quitter.

source: Proceed to select and import channel topics and resources as for the public channels.
fr: Sélectionnez et importez les sujets et les ressources de la chaîne tout comme pour les chaînes publiques.

source: Unlisted or private channels in the list are indicated with the |unlisted-channel| icon.
fr: Les chaînes non répertoriées ou privées de votre liste sont indiquées par l'icône |unlisted-channel|.

source: To add more learning resources from a channel that you previously imported content from, click :guilabel:`OPTIONS`, select **Import more**, and repeat the selection procedure from step 3.
fr: Pour importer des ressources pédagogiques supplémentaires d'une de vos chaînes existantes, cliquez sur :guilabel:`OPTIONS`, sélectionnez **Importer plus**, et répétez la procédure à partir de l'étape 3.

source: Import Content from a Local Network or Internet
fr: Importer du contenu à partir d'un réseau local ou d'Internet
